Repository: onionshare/onionshare
Catalog: docs/source/locale/*/LC_MESSAGES/advanced.po
Languages: es, km, pt_br, ru, sv, uk

source: The easiest way to generate the onion address and private key is to first create a 'pinned' OnionShare tab in the desktop app and started the share for the first time. This will then have saved the persistent settings to your ``.config/onionshare/persistent/`` folder with a random name. You can unpin that tab once you've generated it the first time. Or, you can leave it where it is, and use that persistent file in your systemd unit file below.
es: La forma más sencilla de generar la dirección Onion y la clave privada es crear primero una pestaña de OnionShare fijada en la aplicación de escritorio e iniciar el recurso compartido por primera vez. Esto guardará la configuración persistente en la carpeta ``.config/onionshare/persistent/`` con un nombre aleatorio. Puedes desanclar esa pestaña una vez generada la primera vez. O bien, puedes dejarla donde está y usar ese archivo persistente en el archivo de unidad systemd que aparece a continuación.
ru: Самый простой способ создать ионный адрес и приватный ключ - сначала создать вкладку OnionShare в настольном приложении и впервые запустить эту долю. Это позволит сохранить постоянные настройки в папке ``.config/onionshare/persistent/`` с случайным именем. Вы можете отобразить эту вкладку, как только вы создали ее в первый раз. Или, вы можете оставить его там, где он есть, и использовать этот стойкий файл в вашем системном файле единицы ниже.
sv: Det enklaste sättet att generera onion-adressen och den privata nyckeln är att först skapa en "fäst" OnionShare-flik i skrivbordsappen och starta delningen för första gången. Detta kommer då att ha sparat de permanenta inställningarna i din ``.config/onionshare/persistent/``-mapp med ett slumpmässigt namn. Du kan lossa den fliken när du har genererat den första gången. Eller så kan du lämna den där den är och använda den permanenta filen i din systemd-enhetsfil nedan.

source: Now you can create a systemd unit file in ``/etc/systemd/system/onionshare-cli.service``. Be sure to adjust the User and Group to your own user/group, as well as changes to any paths to the onionshare-cli binary or the paths to your JSON configs and shares.
es: Ahora puede crear un archivo de unidad systemd en ``/etc/systemd/system/onionshare-cli.service``. Asegúrese de ajustar el Usuario y el Grupo a su propio usuario/grupo, así como los cambios en las rutas al binario onionshare-cli o las rutas a sus configuraciones y recursos compartidos JSON.
ru: Теперь можно создать системный единичный файл в ``/etc/systemd/system/onionshare-cli.service``. Обязательно настройте пользователя и группу на свой собственный пользователь/группу, а также измените любые пути к двойному устройству onionshare-cli или пути к вашим конфигурациям и акциям JSON.
sv: Nu kan du skapa en systemd-enhetsfil i ``/etc/systemd/system/onionshare-cli.service``. Se till att justera Användare och Grupp till din egen användare/grupp, samt ändringar av eventuella sökvägar till onionshare-cli-binärfilen eller sökvägarna till dina JSON-konfigurationer och delningar.

source: The systemd unit file should look like this::
es: El archivo de la unidad systemd se aparecería como esto::
ru: Systemd unit file должен выглядеть так:
sv: Systemd-enhetsfilen ska se ut så här::

source: Note that although ``/home/user/my-shared-file.txt`` was defined in the ``filenames`` section of the ``my-persistent-onion.json`` file, it's still necessary to specify it as the argument to the onionshare-cli command.
es: Tenga en cuenta que, aunque ``/home/user/my-shared-file.txt`` se definió en la sección ``filenames`` del archivo ``my-persistent-onion.json``, aún es necesario especificarlo como argumento del comando onionshare-cli.
ru: Обратите внимание, что хотя ``/home/user/my-shared-file.txt`` был определен в ``filenames `` разделе ``my-persistent-onion.json``, все же необходимо указать его в качестве аргумента к команде onionshare-cli.
sv: Observera att även om ``/home/user/my-shared-file.txt`` definierades i avsnittet ``filenames`` i filen ``my-persistent-onion.json``, är det fortfarande nödvändigt att ange det som argument till onionshare-cli-kommandot.

source: Be sure to run ``sudo systemctl daemon-reload`` after creating the unit file.
es: Asegúrese de ejecutar ``sudo systemctl daemon-reload`` después de crear el archivo de unidad.
ru: Обязательно запустите ``sudo systemctl daemon-reload `` после создания файла единицы.
sv: Se till att köra ``sudo systemctl daemon-reload`` efter att du skapat enhetsfilen.

source: Now you can run ``sudo systemctl start onionshare-cli.service``. If you have ``journalctl`` installed, you can run ``sudo journalctl -f -t onionshare-cli``, and you should see some output of your service starting::
es: Ahora puedes ejecutar ``sudo systemctl start onionshare-cli.service``. Si tienes ``journalctl`` instalado, puede ejecutar ``sudo journalctl -f -t onionshare-cli`` y deberías ver el resultado del inicio de su servicio:
ru: Теперь вы можете запустить ``sudo systemctl start onionshare-cli.service``. Если у вас установлен ``journalctl``, вы можете запустить ``sudo journalctl -f -t onionshare-cli``, и вы должны увидеть некоторые результаты своей службы, начиная::
sv: Nu kan du köra ``sudo systemctl start onionshare-cli.service``. Om du har ``journalctl`` installerat kan du köra ``sudo journalctl -f -t onionshare-cli``, och du bör se utdata från din tjänst som startar::

source: If you don't want your users to use a Private Key, set ``public`` to be ``true`` in the ``general`` settings of the my-persistent-onion.json file.
es: Si no desea que sus usuarios no utilicen una Clave Privada, establezca ``public`` para ser ``true`` en los ajustes ``general``del archivo my-persistent-onion.json.
ru: Если вы не хотите, чтобы ваши пользователи использовали Private Key, установите ``public``, чтобы быть `` True`` в ``general `` настройках файла my-persistent-onion.json.
sv: Om du inte vill att dina användare ska använda en privat nyckel, ställ in ``public`` till ``true`` i ``general``-inställningarna för my-persistent-onion.json-filen.

source: Keyboard Shortcuts
es: Atajos del Teclado
ru: Горячие клавиши
sv: Tangentbordsgenvägar

source: The OnionShare desktop application contains some keyboard shortcuts, for convenience and accessibility::
es: La aplicación de escritorio OnionShare contiene algunos atajos de teclado, para mayor comodidad y accesibilidad::
ru: Настольное приложение OnionShare содержит несколько сочетаний клавиш для удобства и доступности::
sv: OnionShare-skrivbordsapplikationen innehåller några tangentbordsgenvägar för bekvämlighet och tillgänglighet::

source: And from the main mode chooser screen::
es: Y desde la pantalla principal del selector de modo::
ru: А на главном экране выбора режима::
sv: Och från huvudskärmen för lägesväljaren::

source: Migrating your OnionShare data to another computer
es: Migrar tus datos de OnionShare a otro equipo
ru: Мигрировать ваш лук Поделиться данными с другим компьютером
sv: Migrera dina OnionShare-data till en annan dator

source: You may want to migrate your OnionShare data when switching to another computer. This is especially true if you had a 'persistent' onion address and you want to preserve it.
es: Quizás quieras migrar tus datos de OnionShare al cambiar a otro equipo. Esto es especialmente cierto si tenías una dirección cebolla 'persistente' y quieres preservarla.
ru: Вы можете мигрировать данные OnionShare при переходе на другой компьютер. Это особенно верно, если у вас был «постоянный» адрес лука, и вы хотите сохранить его.
sv: Du kanske vill migrera dina OnionShare-data när du byter till en annan dator. Detta gäller särskilt om du hade en "beständig" onion-adress och vill bevara den.

source: OnionShare stores all such data in a specific folder. Copy the relevant folder for your operating system below, to your new computer:
es: OnionShare almacena todos estos datos en una carpeta específica. Copie la carpeta correspondiente a su sistema operativo a continuación, en su equipo nuevo:
ru: OnionShare хранит все такие данные в определенной папке. Скопируйте соответствующую папку для операционной системы ниже, на ваш новый компьютер:
sv: OnionShare lagrar all sådan data i en specifik mapp. Kopiera den relevanta mappen för ditt operativsystem nedan till din nya dator:

source: Configuration file parameters
es: Parámetros del archivo de configuración
ru: Параметры файла конфигурации
sv: Konfigurationsfilparametrar

source: OnionShare stores its settings in a JSON file. Both the CLI and the Desktop versions use this configuration file. The CLI also lets you specify a path to a custom configuration file with ``--config``.
es: OnionShare almacena sus ajustes en un archivo JSON. Ambos el CLI y las versiones del Escritorio utiliza este archivo de configuración. El CLI además de permite especificar una ruta a un archivo de configuración personalizado con ``--config``.
ru: OnionShare сохраняет свои настройки в файле JSON. И CLI, и настольные версии используют этот файл конфигурации. CLI также позволяет указать путь к пользовательскому файлу конфигурации с ``-конфигурацией``.
sv: OnionShare lagrar sina inställningar i en JSON-fil. Både CLI- och skrivbordsversionerna använder denna konfigurationsfil. CLI-gränssnittet låter dig också ange en sökväg till en anpassad konfigurationsfil med ``--config``.

source: Below are the configuration file parameters and what they mean. If your configuration file has other parameters not listed here, they may be obsolete from older OnionShare versions.
es: Debajo están los parámetros del archivo de configuración y qué significa. Si su archivo de configuración tiene otros parámetros no listados aquí, puede estar obsoleto desde otras versiones de OnionShare.
ru: Ниже приведены параметры файла конфигурации и что они означают. Если ваш файл конфигурации имеет другие параметры, не перечисленные здесь, они могут быть устаревшими от старых версий OnionShare.
sv: Nedan följer konfigurationsfilens parametrar och vad de betyder. Om din konfigurationsfil har andra parametrar som inte listas här, kan de vara föråldrade från äldre OnionShare-versioner.

source: Parameter
es: Parámetro
ru: Параметр

source: Type
es: Tipo
ru: Тип

source: Explanation
es: Explicación
ru: Толкование
sv: Förklaring

source: version
es: versión
ru: Версия

source: ``string``
es: ``segmento``
ru: ``строка``
sv: ``sträng``

source: The version of OnionShare. You should not ever need to change this value.
es: La versión de OnionShare. No incluso necesitaría cambiar este valor.
ru: Версия OnionShare. Вам никогда не нужно менять эту ценность.
sv: Versionen av OnionShare. Du borde aldrig behöva ändra detta värde.

source: connection_type
ru: Тип соединения

source: The way in which OnionShare connects to Tor. Valid options are 'bundled', 'automatic' (use Tor Browser's Tor connection), 'control_port' or 'socket_file'. Default: 'bundled'
es: La manera en la cual OnionShare conecta a Tor. Las opciones válidas son 'bundled', 'automatic' (utiliza conexión de Tor del Navegador Tor), 'control-port' o 'socket_file'. Por defecto: 'bundled'
ru: То, как OnionShare подключается к Tor. Valid опции "bundled", "automatic" (использовать Tor Browser's Tor connection), "control_port" или "socket_file". По умолчанию: "
sv: Hur OnionShare ansluter till Tor. Giltiga alternativ är 'bundled', 'automatic' (använd Tor Browsers Tor-anslutning), 'control_port' eller 'socket_file'. Standard: 'bundled'

source: The IP address of Tor's Control port, if ``connection_type`` is set to 'control_port'. Default: '127.0.0.1'
es: La dirección de IP del puerto de Control de Tor, si ``connection_type`` está fijado a 'control_port'. Por defecto: '127.0.0.1'
ru: IP-адрес порта Tor's Control, если ``connection_type `` настроен на «control_port». По умолчанию: '127.0.0.1 "
sv: IP-adressen för Tors kontrollport, om ``connection_type`` är satt till 'control_port'. Standard: '127.0.0.1'

source: ``integer``
ru: ``число``
sv: ``heltal``

source: The port number of Tor's Control port, if ``connection_type`` is set to 'control_port'. Default: '9051'
es: El número del puerto del puerto de Control de Tor, si ``connection_type`` está fijado a 'control_port'. Por defecto: '9051'
ru: Номер порта порта порта Tor's Control Port, если ``connection_type`` настроен на «control_port». По умолчанию: 9051 "
sv: Portnumret för Tors kontrollport, om ``connection_type`` är satt till 'control_port'. Standard: '9051'

source: The IP address of Tor's SOCKS proxy, if ``connection_type`` is set to 'control_port' or 'socket_file'. Default: '127.0.0.1'
es: La dirección IP del proxy de SOCKS de Tor, si ``connection_type`` está fijado para 'control_port' o 'socket_file'. Por defecto: '127.0.0.1'
ru: IP-адрес прокси-сервера Tor's SOCKS, если ``connection_type `` настроен на «control_port» или «socket_file». По умолчанию: '127.0.0.1 "
sv: IP-adressen för Tors SOCKS-proxy, om ``connection_type`` är satt till 'control_port' eller 'socket_file'. Standard: '127.0.0.1'

source: The port number of Tor's SOCKS proxy, if ``connection_type`` is set to 'control_port' or 'socket_file'. Default: ''9050'
es: El número del puerto del proxy SOCKS de Tor, si ``connection_type`` está fijado para 'control_port' o 'socket_file': Por defecto: ''9050'
ru: Номер порта прокси Tor SOCKS, если ``connection_type `` настроен на "control_port" или "socket_file". По умолчанию: '9050 "
sv: Portnumret för Tors SOCKS-proxy, om ``connection_type`` är satt till 'control_port' eller 'socket_file'. Standard: ''9050'

source: The path to Tor's socket file, if ``connection_type`` is set to 'socket_file'. Default: '/var/run/tor/control'
es: La ruta para el archivo del zócalo de Tor, si ``connection_type`` está establecido a 'socket_file': Por defecto: '/var/run/tor/control'
ru: Путь к файлу сокета Tor, если ``connection_type `` настроен на «socket_file». По умолчанию: '/var/run/tor/control "
sv: Sökvägen till Tors socketfil, om ``connection_type`` är satt till 'socket_file'. Standard: '/var/run/tor/control'

source: If access to Tor's control port requires a password, this can be set to 'password', otherwise 'no_auth'. Default: 'no_auth'
es: Si accede al puerto de control de Tor requiere una contraseña, esto puede ser puesto a 'password', en otro caso 'no_auth'. Por defecto: 'no_auth'
ru: Если доступ к порту управления Tor требует пароля, это может быть установлено как «пароль», иначе «no_auth». По умолчанию: "
sv: Om åtkomst till Tors kontrollport kräver ett lösenord kan detta ställas in på 'password', annars 'no_auth'. Standard: 'no_auth'

source: If access to Tor's control port requires a password, and ``auth_type`` is set to 'password', specify the password here. Default: ''
es: Si acceder al puerto de control de Tor requiere una contraseña, y ``auth_type`` está establecido a 'password', especifica la contraseña aquí. Por defecto: ''
ru: Если доступ к порту управления Tor требует пароля, и ``auth_type `` установлен для «пароля», укажите здесь пароль. По умолчанию
sv: Om åtkomst till Tors kontrollport kräver ett lösenord, och ``auth_type`` är satt till 'password', ange lösenordet här. Standard: ''

source: Whether OnionShare should automatically connect to Tor when it starts. Default: False
es: Si OnionShare automáticamente conectaría a Tor cuando comienza. Por defecto: False
ru: Является ли Onion Акции должны автоматически подключаться к Tor при его запуске. По умолчанию: False
sv: Om OnionShare ska ansluta till Tor automatiskt när det startar. Standard: False

source: Whether OnionShare should automatically check for updates (over Tor). This setting is only valid for MacOS or Windows installations. Default: True.
es: Si OnionShare debe buscar actualizaciones automáticamente (a través de Tor). Estos ajustes solo son válidos para instalaciones de macOS o Windows. Valor predeterminado: True.
ru: Является ли Onion Акции должны автоматически проверять обновления (по Tor). Этот параметр действителен только для установок MacOS или Windows. Правда.
sv: Om OnionShare ska söka efter uppdateringar automatiskt (via Tor). Den här inställningen gäller endast för MacOS- eller Windows-installationer. Standard: True.

source: The last time OnionShare checked for updates. Default: None
es: La última vez que OnionShare buscó actualizaciones. Predeterminado: None
ru: Последний раз OnionShare проверялся на обновления. По умолчанию: нет
sv: Senaste gången OnionShare sökte efter uppdateringar. Standard: None

source: Whether to connect to Tor using bridges. Default: False
es: Si se conecta a Tor utilizando puentes. Predeterminado: False
ru: Подключение к Tor с помощью мостов. По умолчанию: False
sv: Om man ska ansluta till Tor med hjälp av broar. Standard: False

source: When ``bridges_enabled`` is True, where to load bridges from. Options are "built-in" (bridges shipped with OnionShare and which may get updated from Tor), "moat" (request bridges from Tor's Moat API), or "custom" (user-supplied bridges). Default: "built-in"
es: Cuando ``bridges_enabled`` es True, desde donde cargar los puentes. Las opciones son integrados, "built-in", (puentes incluidos con OnionShare y que pueden actualizarse desde Tor), "moat" (solicitar puentes desde la API Moat de Tor) o "custom", personalizados, (puentes proporcionados por el usuario). Valor predeterminado: "built-in"
ru: Когда ``bridges_enbled `` является True, где загружать мосты. Варианты «встроены» (встроены мосты, отправленные с OnionShare и которые могут быть обновлены от Tor), «моут» (запросные мосты от Tor's Moat API) или «таможенные» (упрощенные пользователями мосты). По умолчанию: "встроенный"
sv: När ``bridges_enabled`` är True, varifrån broar ska laddas. Alternativen är "built-in" (broar som levereras med OnionShare och som kan uppdateras från Tor), "moat" (begär broar från Tors Moat API) eller "custom" (användarlevererade broar). Standard: "built-in"

source: When ``bridges_type`` is set to "built-in", this specifies which type of bridge protocol to use. Options are "obfs4", "meek-azure" or "snowflake". Default: "obfs4"
es: Cuando ``bridges_type``está establecido a "build-in", esto especifica cual tipo del protocolo del puente a utilizar. Las opciones son "obfs4", "meek-azure" o "snowflake". Predeterminado: "obfs4"
ru: Когда ``bridges_type `` настроен на «встроенное», это указывает, какой тип протокола моста использовать. Варианты: «obfs4», «meek-azure» или «snowflake». По умолчанию: "obfs4"
sv: När ``bridges_type`` är satt till "inbyggt" anger detta vilken typ av broprotokoll som ska användas. Alternativen är "obfs4", "meek-azure" eller "snowflake". Standard: "obfs4"

source: When ``bridges_type`` is set to "moat", the bridges returned from Tor's Moat API are stored here. Default: ""
es: Cuando ``bridges_type``está establecido a "moat", los puentes devueltos desde el API Moat de Tor son almacenados aquí. Predeterminado: ""
ru: Когда ``bridges_type `` настроен на «движение», мосты, возвращенные из Moat API Tor, хранятся здесь. ""
sv: När ``bridges_type`` är satt till "moat" lagras broarna som returneras från Tors Moat API här. Standard: ""

source: When ``bridges_type`` is set to "custom", the bridges specified by the user are stored here. Separate each bridge line in the string with '\n'. Default: ""
es: Cuando ``bridges_type`` se configura como "custom", los puentes especificados por el usuario se almacenan aquí. Separe cada línea de puente en la cadena con '\n'. Valor predeterminado: ""
ru: Когда ``bridges_type `` установлен на «таможенный», мосты, указанные пользователем, хранятся здесь. Отделить каждую линию моста в строке с 'n. ""
sv: När ``bridges_type`` är satt till "custom" lagras de broar som anges av användaren här. Separera varje brorad i strängen med '\n'. Standard: ""

source: When ``bridges_type`` is set to "built-in", OnionShare obtains the latest built-in bridges recommended by Tor and stores them here. Default: {}
es: Cuando ``bridges_type`` se configura a "built-in", OnionShare obtiene los puentes integrados más recientes recomendados por Tor y los almacena aquí. Predeterminado: {}
ru: Когда ``bridges_type `` настроен на «встроенное», OnionShare получает последние встроенные мосты, рекомендованные Tor, и хранит их здесь. По умолчанию
sv: När ``bridges_type`` är satt till "inbyggt" hämtar OnionShare de senaste inbyggda broarna som rekommenderas av Tor och lagrar dem här. Standard: {}

source: If the user has defined any tabs as 'saved' (meaning that they are persistent each time OnionShare starts, and their onion address doesn't change), these are given a random identifier which gets listed here. The persistent onion is stored as a JSON file with the same name as this identifier, in a subfolder of the OnionShare configuration folder called 'persistent'. Default: []
es: Si el usuario ha definido alguna pestaña como ‘guardada’ (es decir, que se mantiene cada vez que se inicia OnionShare y su dirección cebolla no cambia), se le asigna un identificador aleatorio que se alista aquí. La cebolla persistente se almacena como un archivo JSON con el mismo nombre que este identificador, en una subcarpeta de la carpeta de configuración de OnionShare llamada ‘persistent’. Predeterminado: []
ru: Если пользователь определил какие-либо вкладки как «сохраненные» (что означает, что они постоянны каждый раз, когда начинается OnionShare, и их onion-адрес не меняется), им присваивается случайный идентификатор, который перечисляется здесь. Стойкий лук хранится как файл JSON с тем же именем, что и этот идентификатор, в подскладке папки конфигурации OnionShare под названием «персистент». По умолчанию: []
sv: Om användaren har definierat några flikar som "sparade" (vilket betyder att de är beständiga varje gång OnionShare startas, och deras Onion-adress inte ändras), får dessa en slumpmässig identifierare som listas här. Den beständiga Onion-filen lagras som en JSON-fil med samma namn som denna identifierare, i en undermapp i OnionShare-konfigurationsmappen som heter "beständig". Standard: []

source: locale
es: local
ru: Язык
sv: språk

source: The locale used in OnionShare. Default: None (which is the same as 'en'). For valid locale codes, see 'available_locales' in https://github.com/onionshare/onionshare/blob/main/cli/onionshare_cli/settings.py
es: La configuración regional utilizada en OnionShare. Valor predeterminado: None (equivale a 'en'). Para códigos de región válidos, consulte 'available_locales' en https://github.com/onionshare/onionshare/blob/main/cli/onionshare_cli/settings.py
ru: The locale used in OnionShare. По умолчанию: Нет (что такое же, как «en»). For valid locale codes, see 'available_locales' in https://github.com/onionshare/onionshare/blob/main/cli/onionshare_cli/settings.py
sv: Språkinställningen som används i OnionShare. Standard: None (vilket är samma som 'en'). För giltiga språkkoder, se 'available_locales' i https://github.com/onionshare/onionshare/blob/main/cli/onionshare_cli/settings.py

source: theme
es: tema
ru: темы
sv: tema

source: The theme for the OnionShare desktop app. Valid options are 0 (automatically detect the user's computer's light or dark theme), 1 (light) or 2 (dark).
es: El tema de la aplicación de escritorio OnionShare. Las opciones válidas son 0 (detectar automáticamente el tema claro u oscuro del equipo del usuario), 1 (claro) o 2 (oscuro).
ru: Тема настольного приложения OnionShare. 0 (автоматически обнаруживайте светлую или темную тему компьютера пользователя), 1 (свет) или 2 (темный).
sv: Temat för OnionShare-skrivbordsappen. Giltiga alternativ är 0 (identifierar automatiskt användarens dators ljusa eller mörka tema), 1 (ljust) eller 2 (mörkt).

source: Configuration file parameters for persistent onions
es: Configuración de parámetros de archivo para cebollas persistentes
ru: Параметры файла конфигурации для стойких луков
sv: Konfigurationsfilparametrar för persistenta onions
