Repository: onionshare/onionshare
Catalog: docs/source/locale/*/LC_MESSAGES/advanced.po
Languages: es, km, pt_br, ru, sv, uk

source: Advanced Usage
es: Uso avanzado
km: ការប្រើប្រាស់កម្រិតខ្ពស់
pt_br: Uso Avançado
ru: Расширенные возможности
sv: Avancerad användning
uk: Розширене використання

source: Save Tabs
es: Guardar pestañas
km: រក្សាទុកផ្ទាំង
pt_br: Salvar Abas
ru: Сохранение вкладок
sv: Spara flikar
uk: Збереження вкладок

source: Closing OnionShare tabs you host destroys them, preventing reuse. Persistently hosted websites are available on the same address even if the computer they are shared from is rebooted.
es: Al cerrar las pestañas de OnionShare que alojas, se destruyen y se impide su reutilización. Los sitios web alojados de forma persistente están disponibles en la misma dirección incluso si se reinicia el equipo desde el que se comparten.
ru: Закрытие вкладок OnionShare, размещенных на вашем хостинге, уничтожает их, предотвращая повторное использование. Постоянно размещенные веб-сайты доступны по одному и тому же адресу, даже если компьютер, с которого они доступны, перезагружен.
sv: Om du stänger OnionShare-flikar som du är värd för förstörs dem, vilket förhindrar återanvändning. Webbplatser som är beständigt värdar är tillgängliga på samma adress även om datorn de delas från startas om.

source: Make any tab persistent by checking the "Always open this tab when OnionShare is started" box before starting your server.
es: Se hace cualquier pestaña persistente al pulsar en la casilla “Abrir siempre esta pestaña cuando se inicie OnionShare” antes de iniciar tu servidor.
ru: Сделайте любую вкладку постоянной, установив флажок “Всегда открывать эту вкладку при запуске OnionShare“ перед запуском сервера.
sv: Gör en flik bestående genom att markera rutan "Öppna alltid den här fliken när OnionShare startas" innan du startar din server.

source: When opening OnionShare, your saved tabs from the prior session will start opened. Each service then can be started manually, and will be available on the same OnionShare address and be protected by the same private key.
es: Al abrir OnionShare, se abrirán las pestañas guardadas de la sesión anterior. Luego, cada servicio se puede iniciar manualmente y estará disponible en la misma dirección de OnionShare y protegido por la misma clave privada.
ru: При открытии OnionShare ваши сохраненные вкладки из предыдущего сеанса начнут открываться. Затем каждую службу можно запустить вручную, она будет доступна по одному и тому же адресу OnionShare и защищена одним и тем же закрытым ключом.
sv: När du öppnar OnionShare kommer dina sparade flikar från föregående session att börja öppnas. Varje tjänst kan sedan startas manuellt och kommer att vara tillgänglig på samma OnionShare-adress och skyddas av samma privata nyckel.

source: If you save a tab, a copy of its onion service secret key is stored on your computer.
es: Si guardas una pestaña, se almacenará en su equipo una copia de la clave secreta del servicio cebolla.
ru: Если вы сохраните вкладку, копия секретного ключа луковой службы будет сохранена на вашем компьютере.
sv: Om du sparar en flik, lagras en kopia av dess hemliga nyckel för onion-tjänsten på din dator.

source: Turn Off Private Key
es: Apagar Clave Privada
km: បិទកូនសោសម្ងាត់
pt_br: Desligar Chave Privada
ru: Отключить использование секретного ключа
sv: Stäng av privat nyckel

source: By default, all OnionShare services are protected with a private key, which Tor calls "client authentication".
es: Por defecto, todos los servicios de OnionShare están protegidos con una clave privada, la cual Tor la llama “autenticación de cliente”.
km: តាមលំនាំដើម គ្រប់សេវាកម្ម OnionShare ត្រូវបានការពារជាមួយនឹងកូនសោសម្ងាត់ ដែល Tor ហៅថា "យថាភូកម្មរបស់អ្នកប្រើប្រាស់"។
pt_br: Por padrão, todos os serviços do OnionShare são protegidos com uma chave privada, que o Tor chama de "autenticação de cliente".
ru: По умолчанию все сервисы OnionShare защищены секретным ключом, который на сленге Tor называется "клиентская аутентификация".
sv: Som standard är alla OnionShare-tjänster skyddade med en privat nyckel, som Tor kallar "klientautentisering".

source: The Tor Browser will ask you to enter your private key when you load an OnionShare service. If you want to allow the public to use your service, it's better to disable the private key altogether.
es: El Navegador Tor le pedirá que ingrese su clave privada cuando cargue un servicio OnionShare. Si quiere conceder que el público use su servicio, es mejor inhabilitar la clave privada por completo.
ru: Браузер Tor попросит вас ввести закрытый ключ при загрузке службы OnionShare. Если вы хотите разрешить публично использовать ваш сервис, лучше вообще отключить закрытый ключ.
sv: Tor Browser kommer att be dig ange din privata nyckel när du laddar en OnionShare-tjänst. Om du vill tillåta allmänheten att använda din tjänst är det bättre att inaktivera den privata nyckeln helt och hållet.

source: To turn off the private key for any tab, check the "This is a public OnionShare service (disables private key)" box before starting the server. Then the server will be public and a private key is not needed to load it in the Tor Browser.
es: Para desactivar la clave privada en cualquier pestaña, marque la casilla “Este es un servicio público de OnionShare (inhabilita la clave privada)” antes de iniciar el servidor. Entonces el servidor será público y no necesitará una clave privada para verlo en el Navegador Tor.
ru: Чтобы отключить закрытый ключ для любой вкладки, перед запуском сервера установите флажок “Это общедоступная служба OnionShare (отключает закрытый ключ)“. Тогда сервер будет публичным и для его загрузки в Tor Browser не понадобится приватный ключ.
sv: För att stänga av den privata nyckeln för en flik, markera rutan "Detta är en offentlig OnionShare-tjänst (inaktiverar privat nyckel)" innan du startar servern. Då blir servern offentlig och en privat nyckel behövs inte för att ladda den i Tor Browser.

source: Custom Titles
es: Títulos Personalizados
km: ចំណងជើងផ្ទាល់ខ្លួន
pt_br: Títulos Personalizados
ru: Указать заголовок
sv: Anpassade titlar
uk: Власні заголовки

source: When people load OnionShare services in the Tor Browser they see the default title for each type of service. For example, the default title for chat services is "OnionShare Chat".
es: Cuando las personas carguen un servicio de OnionShare en el Navegador Tor verán el título predeterminado por cada tipo de servicio. Por ejemplo, el título predeterminado de un servicio de chat es “OnionShare Chat”.
ru: Когда люди загружают сервисы OnionShare в браузере Tor, они видят заголовок по умолчанию для каждого типа сервиса. Например, заголовок службы чата по умолчанию — “Чат OnionShare“.
sv: När personer laddar OnionShare-tjänster i Tor Browser ser de standardtiteln för varje typ av tjänst. Till exempel är standardtiteln för chattjänster "OnionShare-chatt".

source: If you edit the "Custom title" setting before starting a server you can change it.
es: Si edita la configuración de “Título personalizado” antes de iniciar un servidor, puede cambiarla.
ru: Если вы отредактируете настройку “Пользовательский заголовок“ перед запуском сервера, вы можете изменить ее.
sv: Om du redigerar inställningen "Anpassad titel" innan du startar en server kan du ändra den.

source: Scheduled Times
es: Tiempos planificados
km: ពេលវេលាដែលបានកំណត់
pt_br: Horários programados
ru: Планирование времени
sv: Schemalagda tider
uk: Запланований час

source: OnionShare supports scheduling exactly when a service should start and stop. Before starting a server, click "Show advanced settings" in its tab and then check the boxes next to either "Start onion service at scheduled time", "Stop onion service at scheduled time", or both, and set the respective desired dates and times.
es: OnionShare admite la temporización exacta de cuándo debe iniciarse y detenerse un servicio. Antes de iniciar un servidor, pulse en “Mostrar ajustes avanzados” en su pestaña, y luego se marca la casilla próxima a “Iniciar el servicio cebolla en el tiempo programado”, o “Detener el servicio cebolla en el tiempo programado”, o ambas, y establece las fechas y horas deseadas.
km: OnionShare គាំទ្រការកំណត់ពេលវេលាជាក់លាក់នៅពេលសេវាកម្មមួយគួរចាប់ផ្ដើម និងបញ្ចប់។ មុនពេលចាប់ផ្ដើមម៉ាស៊ីនមេ សូមចុច "បង្ហាញការកំណត់កម្រិតខ្ពស់" នៅក្នុងផ្ទាំងរបស់វា ហើយបន្ទាប់មកធីកប្រអប់នៅជាប់នឹង "ចាប់ផ្ដើមសេវាកម្ម onion នៅពេលវេលាដែលបានកំណត់" ឬ "បញ្ឈប់សេវាកម្ម onion នៅពេលវេលាដែលបានកំណត់" ឬទាំងពីរ ហើយកំណត់កាលបរិច្ចេទដែលចង់បាន។
pt_br: OnionShare suporta agendamento exatamente quando um serviço deve iniciar e parar. Antes de iniciar um servidor, clique em "Mostrar configurações avançadas" em sua guia e marque as caixas ao lado de "Iniciar serviço onion no horário agendado", "Parar serviço onion no horário agendado", ou ambos, e defina as respectivas datas e horários desejados.
ru: OnionShare поддерживает возможность точного планирования, когда сервис должен запуститься или остановиться. Перед запуском сервера, нажмите на его вкладке кнопку "Показать дополнительные настройки", отметьте нужные пункты: "Запустить onion-сервис в назначенное время", "Остановить onion-сервис в назначенное время", и укажите нужную дату и время для каждого пункта.
sv: OnionShare stöder schemaläggning av exakt när en tjänst ska starta och sluta. Innan du startar en server klickar du på "Visa avancerade inställningar" på dess flik och kryssar sedan i rutorna bredvid antingen "Starta onion-tjänst vid schemalagd tid", "Stoppa onion-tjänst vid schemalagd tid" eller båda, och ställer in önskade datum och tider.
uk: OnionShare підтримує планування, коли саме служба повинна запускатися та зупинятися. Перш ніж запускати сервер, натисніть «Показати розширені налаштування» на його вкладці, а потім позначте «Запускати службу onion у запланований час», «Зупинити службу onion у запланований час» або обидва і встановіть бажані дати та час.

source: Services scheduled to start in the future display a countdown timer when the "Start sharing" button is clicked. Services scheduled to stop in the future display a countdown timer when started.
es: Los servicios planificados para iniciar en el futuro exhibe un cronómetro regresivo al pulsar en el botón “Comenzar a compartir”. Los servicios planificados para detenerse en el futuro exhiben un cronómetro de cuenta regresiva cuando se inician.
ru: Службы, запуск которых запланирован на будущее, отображают таймер обратного отсчета при нажатии кнопки “Начать общий доступ“. Службы, которые планируется остановить в будущем, при запуске отображают таймер обратного отсчета.
sv: Tjänster som är schemalagda att starta i framtiden visar en nedräkningstimer när knappen "Starta delning" klickas. Tjänster som är schemalagda att stoppa i framtiden visar en nedräkningstimer när de startas.

source: **Scheduling an OnionShare service to automatically start can be used as a dead man's switch**. This means your service is made public at a given time in the future if you are not there to prevent it. If nothing happens to you, you can cancel the service before it's scheduled to start.
es: **Planificar un servicio de OnionShare para que se inicie automáticamente se puede usar como un dispositivo HM**. Esto significa que tu servicio será público en un momento dado en el futuro si no lo detiene. Si no sucede nada, puedes cancelar el servicio antes de que su planificación empiece.
ru: **Планирование автоматического запуска службы OnionShare можно использовать как выключатель**. Это означает, что ваша услуга станет общедоступной в определенный момент в будущем, если вы не сможете предотвратить это. Если с вами ничего не произойдет, вы можете отменить услугу до ее запуска.
sv: **Att schemalägga en OnionShare-tjänst för att starta automatiskt kan användas som en dödmansbrytare**. Detta innebär att din tjänst offentliggörs vid en viss tidpunkt i framtiden om du inte är där för att förhindra det. Om inget händer dig kan du avbryta tjänsten innan den är planerad att starta.

source: **Scheduling an OnionShare service to automatically stop limits its exposure**. If you want to share secret info or something that will be outdated, you can do so for selected limited time.
es: **Planificar un servicio OnionShare para que se detenga automáticamente limita su exposición**. Si desea compartir información secreta o algo que se desactualizará, puede hacerlo por un tiempo limitado seleccionado.
ru: **Планирование автоматической остановки службы OnionShare ограничивает ее уязвимость**. Если вы хотите поделиться секретной информацией или чем-то, что устареет, вы можете сделать это в течение ограниченного времени.
sv: **Att schemalägga en OnionShare-tjänst för att automatiskt stoppa begränsar dess exponering**. Om du vill dela hemlig information eller något som kommer att vara föråldrat kan du göra det under en begränsad tid.

source: Command-line Interface
es: Interfaz de línea de comando
km: ផ្ទៃឃ្លាបញ្ជា
pt_br: Interface da Linha de comando
ru: Интерфейс командной строки
sv: Gränssnitt för kommandoraden
uk: Інтерфейс командного рядка

source: In addition to its graphical interface, OnionShare has a command-line interface.
es: Además de su interfaz gráfico, OnionShare tiene una interfaz de línea de comando.
km: OnionShare មានផ្ទៃឃ្លាបញ្ជាមួយបន្ថែមពីលើផ្ទាំងក្រាហ្វិករបស់វា។
pt_br: Além de sua interface gráfica, OnionShare possui uma interface de linha de comando.
ru: В дополнение к графическому интерфейсу, у OnionShare есть интерфейс командной строки.
sv: Förutom sitt grafiska gränssnitt har OnionShare ett kommandoradsgränssnitt.
uk: Окрім графічного інтерфейсу, OnionShare має інтерфейс командного рядка.

source: Installing the CLI version
es: Instalar la versión de CLI
ru: Установка версии CLI
sv: Installera CLI-versionen

source: If you have installed the Snap, macOS or Windows package, you already have the CLI version installed.
es: Si has instalado el Snap, paquetes macOS o Windows, ya tienes la versión de CLI instalada.
ru: Если вы установили пакет Snap, macOS или Windows, у вас уже установлена версия CLI.
sv: Om du har installerat Snap-, macOS- eller Windows-paketet har du redan CLI-versionen installerad.

source: Alternatively, you can install just the command-line version of OnionShare using ``pip3``::
es: Alternativamente, puedes instalar la versión de línea de comando de OnionShare usando ``pip3``::
ru: В качестве альтернативы можно установить только командную версию OnionShare с использованием ``pip3``:
sv: Alternativt kan du installera bara kommandoradsversionen av OnionShare med hjälp av ``pip3``::

source: Note that you will also need the ``tor`` package installed. In macOS, install it with: ``brew install tor``
es: Ten en cuenta que también necesitarás el paquete ``tor`` instalado. En macOS, instálalo con: ``brew install tor``
km: ចំណាំថា អ្នកក៏នឹងត្រូវការដំឡើងកញ្ចប់ ``tor``។ នៅក្នុង macOS សូមដំឡើងវាដោយ: ``brew install tor``
pt_br: Note que você também precisará do pacote `` tor`` instalado. No macOS, instale-o com: `` brew install tor``
ru: Для работы консольной версии также необходимо установить пакет ``tor``. Для установки пакета в операционной системе macOS выполните команду: ``brew install tor``
sv: Observera att du också behöver paketet ``tor`` installerat. I macOS installerar du det med: ``brew install tor``
uk: Зауважте, що вам також знадобиться встановлений пакунок ``tor``. У macOS встановіть його за допомогою: ``brew install tor``

source: Then run it like this::
es: Luego, ejecútalo así::
km: បន្ទាប់មក ដំណើរការវាដូចនេះ::
pt_br: Em seguida, execute-o assim:
ru: Затем произведите запуск следующим образом::
sv: Kör den sedan så här::
uk: Потім запустіть його так::

source: Info about installing it on different operating systems can be found in the `CLI README file <https://github.com/onionshare/onionshare/blob/develop/cli/README.md>`_ in the Git repository.
es: Para información sobre cómo instalarlo en diferentes sistemas operativos, consulte el `archivo README de CLI <https://github.com/onionshare/onionshare/blob/develop/cli/README.md>` _ en el repositorio de Git.
ru: Информацию об установке его в различных операционных системах можно найти в файле `CLI README <https://github.com/onionshare/onionshare/blob/develop/cli/README.md>`_ в репозитории Git.
sv: Information om hur du installerar det på olika operativsystem finns i `CLI README-filen <https://github.com/onionshare/onionshare/blob/develop/cli/README.md>`_ i Git-arkivet.

source: Running the CLI from Snap
es: Ejecutar el CLI desde Snap
ru: Запуск CLI из Snap
sv: Köra CRI från Snap

source: If you installed OnionShare using the Snap package, you can run ``onionshare.cli`` to access the command-line interface version.
es: Si instalaste OnionShare usando el paquete Snap, puedes ejecutar ``onionshare.cli`` para acceder a la versión de interfaz de línea de comando.
ru: Если вы установили OnionShare с помощью пакета Snap, вы можете запустить ``onionshare.cli`` для доступа к версии интерфейса командной строки.
sv: Om du installerade OnionShare med Snap-paketet kan du köra ``onionshare.cli`` för att komma åt kommandoradsgränssnittsversionen.

source: Running the CLI from macOS
es: Ejecutar el CLI desde macOS
ru: Запуск CLI от macOS
sv: Köra CLI från macOS

source: From Terminal, you can run ``/Applications/OnionShare.app/Contents/MacOS/onionshare-cli --help``
es: Desde la Terminar, puedes ejecutar ``/Applications/OnionShare.app/Contents/MacOS/onionshare-cli --help``
ru: Из терминала можно запустить ``/Applications/OnionShare.app/Contents/MacOS/onionshare-cli -help``
sv: Från Terminal, kan du köra ``/Applications/OnionShare.app/Contents/MacOS/onionshare-cli --help``

source: Running the CLI from Windows
es: Al ejecutar el CLI desde Windows
ru: Запуск CLI из Windows
sv: Köra CLI från Windows

source: In the Windows installation, the executable ``onionshare-cli.exe`` is available.
es: En la instalación de Windows, está disponible el ejecutable ``onionshare-cli.exe``.
ru: В установке Windows доступна исполняемая ``onionshare-cli.exe``.
sv: I Windows-installationen finns den körbara filen ``onionshare-cli.exe`` tillgänglig.

source: Usage
es: Uso
km: ការប្រើប្រាស់
pt_br: Uso
ru: Использование
sv: Användning
uk: Користування

source: Browse the command-line documentation by running ``onionshare --help``::
es: Navega por la documentación de línea de comando ejecutando ``onionshare --help``::
ru: Просмотрите документацию по командной строке, запустив ``onionshare --help``::
sv: Bläddra i kommandoradsdokumentationen genom att köra ``onionshare --help``::

source: Running the CLI as a systemd unit file
es: Ejecutar el CLI como un archivo de unidad de systemd
ru: Запуск CLI в качестве системного файла
sv: Köra CLI som en systemd-enhetsfil

source: It is possible to automatically start OnionShare from the CLI using a systemd unit file.
es: Esto es posible para iniciar automáticamente OnionShare desde el CLI utilizando el archivo de unidad de systemd.
ru: Можно автоматически запустить OnionShare из CLI с помощью системного файла единицы.
sv: Det är möjligt att automatiskt starta OnionShare från CLI med hjälp av en systemd-enhetsfil.

source: You may find this particularly useful if you are operating in 'persistent' mode, and want to start the same onion service every time your machine starts.
es: Puedes encontrar esta particularidad útil si está operando un modo ‘persistente’, y desea iniciar el mismo servicio cebolla cada vez que su máquina arranque.
ru: Вы можете найти это особенно полезно, если вы работаете в режиме «персистент», и хотите начать тот же сервис лука каждый раз, когда ваша машина начинает работать.
sv: Du kan tycka att detta är särskilt användbart om du använder "beständigt"-läge och vill starta samma onion-tjänst varje gång din maskin startar.

source: To do this, you need to prepare some OnionShare json config first.
es: Para hacer esto, necesitas primero preparar algún config de json de OnionShare.
ru: Чтобы это сделать, вам нужно подготовить лук Сначала поделитесь конфигурацией json.
sv: För att göra detta måste du först förbereda lite OnionShare json-konfiguration.

source: Here is the main OnionShare config. In this example, it's stored in ``/home/user/.config/onionshare/onionshare.json``. You may need to adjust some of the settings, but if you already have OnionShare installed, it probably looks much like this already::
es: Aquí está la configuración principal de OnionShare. Esto es un ejemplo, está almacenado en ``/home/usuario/.config/onionshare,json``. Puede necesitar ajustar algo de los parámetros, pero si ya tiene instalado OnionShare, probablemente parece mucho a esto preparado::
ru: Вот основная конфигурация OnionShare. В этом примере он хранится в ``/доме/пользователье/.config/onionshare/onionshare.json``. Возможно, вам придется скорректировать некоторые настройки, но если вы уже установили OnionShare, это, вероятно, выглядит так уже::
sv: Här är den huvudsakliga OnionShare-konfigurationen. I det här exemplet lagras den i ``/home/user/.config/onionshare/onionshare.json``. Du kan behöva justera några av inställningarna, men om du redan har OnionShare installerat ser det förmodligen ut ungefär så här redan::

source: Notice the 'persistent_tabs' section. We will now create a file at ``/home/user/.config/onionshare/persistent/my-persistent-onion.json``, that looks like this::
es: Dese cuenta que la sección 'persistent_tabs'. Ahora crearemos un archivo en ``/home/usuario/.config/onionshare/persistent/my-persistent-onion.json``, que es similar a esto::
ru: Обратите внимание на раздел "peristent_tabs". Теперь мы создадим файл на ``/home/user/.config/onionshare/persistent/my-persistent-onion.json``, который выглядит так:
sv: Lägg märke till avsnittet 'persistent_tabs'. Vi ska nu skapa en fil på ``/home/user/.config/onionshare/persistent/my-persistent-onion.json``, som ser ut så här::

source: **Don't actually use this private key, service_id or client_auth keys! They are shown only as an example. Never share the private_key with anyone.**
es: **Actualmente ¡no utilice esta clave privada, service_id o client_auth! Son mostrados solo como un ejemplo. Nunca comparta el private_key con nadie.**
ru: ** Не используйте этот приватный ключ, сервис_id или клиент_auth ключи! Они показаны только в качестве примера. Никогда не делись с кем бы то ни было на private_key.**
sv: **Använd inte den här privata nyckeln, service_id-nycklarna eller client_auth-nycklarna! De visas endast som ett exempel. Dela aldrig den privata nyckeln med någon.**
