Repository: onionshare/onionshare
Catalog: docs/source/locale/*/LC_MESSAGES/advanced.po
Languages: es, km, pt_br, ru, sv, uk

source: To use legacy addresses, before starting a server click "Show advanced settings" from its tab and check the "Use a legacy address (v2 onion service, not recommended)" box. In legacy mode you can optionally turn on Tor client authentication. Once you start a server in legacy mode you cannot remove legacy mode in that tab. Instead you must start a separate service in a separate tab.
uk: Щоб вживати застарілі адреси, перед запуском сервера натисніть «Показати розширені налаштування» на його вкладці та позначте «Користуватися застарілою адресою (служба onion v2, не рекомендовано)». У застарілому режимі ви можете додатково ввімкнути автентифікацію клієнта Tor. Після запуску сервера у застарілому режимі ви не зможете вилучити застарілий режим у цій вкладці. Натомість ви повинні запустити окрему службу в окремій вкладці.

source: Tor Project plans to `completely deprecate v2 onion services <https://blog.torproject.org/v2-deprecation-timeline>`_ on October 15, 2021, and legacy onion services will be removed from OnionShare before then.
uk: Проєкт Tor планує `повністю припинити роботу службами onion v2 <https://blog.torproject.org/v2-deprecation-timeline>`_ 15 жовтня 2021 р. і застарілі служби onion також буде вилучено з OnionShare незадовго до цього часу.

source: When you quit OnionShare and then open it again, your saved tabs will start opened. You'll have to manually start each service, but when you do they will start with the same OnionShare address and private key.
km: នៅពេលអ្នកចាកចេញពី OnionShare ហើយបន្ទាប់មកអ្នកបើកវាម្ដងទៀត នោះផ្ទាំងដែលអ្នកបានរក្សាទុកនឹងចាប់ផ្ដើមបើក។ អ្នកនឹងត្រូវចាប់ផ្ដើមសេវាកម្មនីមួយៗដោយខ្លួនឯង ប៉ុន្តែនៅពេលអ្នកធ្វើ នោះវានឹងចាប់ផ្ដើមជាមួយអាសយដ្ឋាន OnionShare និងកូនសោសម្ងាត់ដូចគ្នា។
pt_br: Quando você sair do OnionShare e depois entrar novamente, suas abas salvas começarão a ser abertas. Você terá que iniciar manualmente cada serviço, mas quando o fizer, eles começarão com o mesmo endereço e chave privada do OnionShare.

source: When browsing to an OnionShare service in Tor Browser, Tor Browser will prompt for the private key to be entered.
km: នៅពេលឆែកមើលសេវាកម្ម OnionShare នៅក្នុងកម្មវិធីរុករក Tor នោះកម្មវិធីរុករក Tor នឹងទាមទារឱ្យបញ្ចូលកូនសោសម្ងាត់។
pt_br: Ao navegar para um serviço OnionShare no Tor Browser, o Tor Browser irá solicitar que a chave privada seja inserida.

source: Sometimes you might want your OnionShare service to be accessible to the public, like if you want to set up an OnionShare receive service so the public can securely and anonymously send you files. In this case, it's better to disable the private key altogether.
km: នៅពេលខ្លះ អ្នកប្រហែលជាចង់ឱ្យសេវាកម្ម OnionShare របស់អ្នកអាចចូលប្រើបានជាសាធារណៈ ដូចជាប្រសិនបើអ្នកចង់ដំឡើងសេវាកម្មទទួល OnionShare ដូច្នេះសាធារណជនអាចផ្ញើឯកសារឱ្យអ្នកដោយសុវត្ថិភាព និងអនាមិក។ ក្នុងករណីនេះ វាជាការល្អក្នុងការបិទកូនសោសម្ងាត់ទាំងអស់គ្នា។
pt_br: Às vezes você pode querer que seu serviço OnionShare seja acessível ao público, como quando você quiser configurar um serviço OnionShare para que o público possa enviar arquivos de forma segura e anônima para você. Neste caso, é melhor desativar a chave privada por completo.

source: To turn off the private key for any tab, check the "This is a public OnionShare service (disables private key)" box before starting the server. Then the server will be public and won't need a private key to view in Tor Browser.
km: ដើម្បីបិទកូនសោសម្ងាត់នៅលើផ្ទាំងណាមួយ សូមធីកប្រអប់ "នេះជាសេវាកម្ម OnionShare សាធារណៈ (បិទកូនសោសម្ងាត់)" មុននឹងចាប់ផ្ដើមម៉ាស៊ីនមេ។ បន្ទាប់មក ម៉ាស៊ីនមេនឹងក្លាយជាសាធារណៈ ហើយនឹងមិនត្រូវការកូនសោសម្ងាត់ដើម្បីមើលក្នុងកម្មវិធីរុករក Tor នោះទេ។
pt_br: Para desligar a chave privada para qualquer aba, marque a caixa "Este é um serviço público OnionShare (desativa a chave privada)" antes de iniciar o servidor. Então o servidor será público e não precisará de uma chave privada para visualizar no Tor Browser.

source: **Scheduling an OnionShare service to automatically stop can be useful to limit exposure**, like if you want to share secret documents while making sure they're not available on the internet for more than a few days.
km: **ការកំណត់ពេលវេលាឱ្យសេវាកម្ម OnionShare បញ្ឈប់ដោយស្វ័យប្រវត្តិ អាចមានប្រយោជន៍ក្នុងការកម្រិតនៃការប៉ះពាល់** ដូចជាប្រសិនបើអ្នកចង់ចែករំលែកឯកសារសម្ងាត់ខណៈដែលត្រូវប្រាកដថា ពួកវាមិនមាននៅលើអុីនធឺណិតលើសពីពីរបីថ្ងៃ។
pt_br: **Agendar um serviço OnionShare para parar automaticamente pode ser útil para limitar a exposição**, como quando você quiser compartilhar documentos secretos enquanto se certifica de que eles não estão disponíveis na internet por mais de alguns dias.

source: For information about installing it on different operating systems, see the `CLI readme file <https://github.com/onionshare/onionshare/blob/develop/cli/README.md>`_ in the git repository.
km: សម្រាប់ព័ត៌មានអំពីការដំឡើងវានៅលើប្រព័ន្ធប្រតិបត្តិការផ្សេងៗទៀត សូមមើល `អានឯកសារ CLI <https://github.com/onionshare/onionshare/blob/develop/cli/README.md>`_ នៅក្នុងថតឯកសារ git។
pt_br: Para informações sobre como instalá-lo em diferentes sistemas operacionais, veja o arquivo `CLI readme <https://github.com/onionshare/onionshare/blob/develop/cli/README.md>`_ no repositório do git.
