Repository: onionshare/onionshare
Catalog: docs/source/locale/*/LC_MESSAGES/advanced.po
Languages: es, km, pt_br, ru, sv, uk

source: As described above, each 'persistent' onion has parameters of its own which are stored in its own JSON file. The path to this file can be specified for the CLI tool with ``--persistent``.
es: Como se describió anteriormente, cada cebolla persistente tiene sus propios parámetros, los cuales se almacenan en su propio archivo JSON. La ruta a este archivo se puede especificar para la herramienta CLI con ``--persistent``.
ru: Как описано выше, каждый «персистентный» лук имеет свои параметры, которые хранятся в собственном файле JSON. Путь к этому файлу может быть указан для инструмента CLI с помощью ``-постоянного ``.
sv: Som beskrivits ovan har varje "beständig" onion sina egna parametrar som lagras i sin egen JSON-fil. Sökvägen till denna fil kan anges för CLI-verktyget med ``--persistent``.

source: Here is an example persistent JSON configuration::
es: A continuación se muestra un ejemplo de configuración JSON persistente::
ru: Вот пример стойкой конфигурации JSON::
sv: Här är ett exempel på en permanent JSON-konfiguration::

source: Below are the configuration file parameters for a persistent onion and what they mean, for each section in the JSON
es: A continuación se muestran los parámetros del archivo de configuración para una cebolla persistente y lo que significan, para cada sección en el JSON
ru: Ниже приведены параметры файла конфигурации для стойкого лука и что они означают для каждого раздела в JSON
sv: Nedan följer konfigurationsfilparametrarna för en persistent onion och vad de betyder, för varje avsnitt i JSON-filen

source: onion
es: cebolla
ru: лук

source: Base64-encoded private key of the onion service
es: Clave privada codificada en Base64 del servicio Onion
ru: Base64 - закодированный частный ключ службы лука
sv: Base64-kodad privat nyckel för Onion-tjänsten

source: The private key when using Client Authentication. Send this to the user.
es: La clave privada al usar la Autenticación de Cliente. Envíe esto al usuario.
ru: Частный ключ при использовании подлинности клиента. Отправьте это пользователю.
sv: Den privata nyckeln vid användning av klientautentisering. Skicka detta till användaren.

source: The public key when using Client Authentication. Used on OnionShare's side.
es: La clave pública al usar la Autenticación de Cliente. Se utiliza en la lado de OnionShare.
ru: Открытый ключ при использовании аутентификации клиента. Используется на стороне OnionShare.
sv: Den offentliga nyckeln vid klientautentisering. Används på OnionShares sida.

source: persistent
es: persistente
ru: Постоянно
sv: beständig

source: mode
es: modo
ru: режим
sv: läge

source: The mode used by this persistent onion. Options are "share", "receive", "website" or "chat".
es: El modo utilizado por esta cebolla persistente. Las opciones son "share "receive", "website" o "chat".
ru: Режим, используемый этим постоянным луком. Варианты - «теневой», «прием», «веб-сайт» или «чат».
sv: Läget som används av denna ihållande onion. Alternativen är "dela", "ta emot", "webbplats" eller "chatta".

source: enabled
es: habilitado
ru: включен
sv: aktiverad

source: Whether persistence is enabled for this onion. When the persistent option is unchecked in the desktop, this entire JSON file is deleted. Default: true
es: Si la persistencia está habilitada para esta cebolla. Cuando la opción de persistencia está desmarcada en el escritorio, se borra todo el archivo JSON. Predeterminado: true
ru: Способен ли упорство для этого лука. Когда стойкая опция не проверяется на рабочем столе, весь этот файл JSON удаляется. По умолчанию: True
sv: Om persistens är aktiverat för denna onion. När alternativet persistens är avmarkerat på skrivbordet tas bort hela denna JSON-fil. Standard: true

source: Whether to automatically start this persistent onion when OnionShare starts and once Tor is connected. Default: false
es: Si se debe iniciar automáticamente esta cebolla persistente al iniciar OnionShare y una vez que Tor se conecta. Predeterminado: false
ru: Начать ли автоматически этот упорный лук при запуске OnionShare и после подключения Tor. По умолчанию
sv: Om denna permanenta onion ska startas automatiskt när OnionShare startar och när Tor är ansluten. Standard: false

source: general
ru: общие сведения
sv: allmän

source: title
es: título
ru: название
sv: titel

source: An optional custom title for displaying on the onion service. Default: null ("OnionShare" will be shown instead)
es: Un título personalizado opcional para exhibir en el servicio Onion. Valor predeterminado: null (nulo) (se mostrará "OnionShare" en su lugar)
ru: Опционный пользовательский заголовок для отображения на сервисе лука. По умолчанию: null (OnionShare) будет показан
sv: En valfri anpassad titel för visning på Onion-tjänsten. Standard: null ("OnionShare" visas istället)

source: public
es: público
ru: публичный
sv: offentlig

source: Whether the onion service can be accessed with or without a Private Key (Client Authentication). If true, no Private Key is required.
es: Si se puede ser accedo al servicio Cebolla con o sin una clave privada (autenticación de cliente). Si es verdadero, no se requiere una Clave Privada.
ru: Можно ли получить доступ к службе лука с помощью или без частного ключа (Client Authentication). Если это так, то не требуется никакого частного ключа.
sv: Om onion-tjänsten kan nås med eller utan en privat nyckel (klientautentisering). Om sant krävs ingen privat nyckel.

source: Whether the onion service is configured to start at a specific time. The time can be set in the desktop app or specified in seconds with ``--auto-start-timer`` with the CLI tool. Default: false
es: Si el servicio Cebolla está configurado para iniciarse a una hora específica. La hora se puede configurar en la aplicación de escritorio o especificar en segundos con ``--auto-start-timer`` en la herramienta CLI. Valor predeterminado: false
ru: Настраивается ли служба лука для запуска в определенное время. Время может быть установлено в настольном приложении или указано в секундах с ``-авто-старт-таймером `` с помощью инструмента CLI. По умолчанию
sv: Om onion-tjänsten är konfigurerad att starta vid en specifik tidpunkt. Tiden kan ställas in i skrivbordsappen eller anges i sekunder med ``--auto-start-timer`` med CLI-verktyget. Standard: false

source: Whether the onion service is configured to stop at a specific time. The time can be set in the desktop app or specified in seconds with ``--auto-stop-timer`` with the CLI tool. Default: false
es: Si el servicio Onion está configurado para detenerse a una hora específica. El tiempo se puede configurar en la aplicación de escritorio o especificar en segundos con ``--auto-stop-timer`` con la herramienta CLI. Predeterminado: false
ru: Настраивается ли служба лука для остановки в определенное время. Время может быть установлено в настольном приложении или указано в секундах с ``-авто-остановщиком `` с помощью инструмента CLI. По умолчанию
sv: Om Onion-tjänsten är konfigurerad att stoppa vid en specifik tidpunkt. Tiden kan ställas in i skrivbordsappen eller anges i sekunder med ``--auto-stop-timer`` med CLI-verktyget. Standard: false

source: The 32-character onion service URL, without the scheme and without the '.onion' suffix.
es: La URL del servicio Onion de 32 caracteres, sin el esquema y sin el sufijo '.onion'.
ru: 32-характерный луковый URL-адрес, без схемы и без суффикса '.onion'.
sv: URL:en för Onion-tjänsten på 32 tecken, utan schemat och utan suffixet '.onion'.

source: The below are settings specific to the 'mode' specified in the ``persistent`` section above.
es: Las siguientes son ajustes específicos del 'modo' especificado en la sección ``persistent`` anterior.
ru: Ниже приведены параметры, специфичные для «режима», указанного в ``разделе ``, выше.
sv: Nedan följer inställningar som är specifika för det 'läge' som anges i avsnittet ``beständig`` ovan.

source: share
es: compartir
ru: Поделиться
sv: dela

source: Whether to automatically stop the share once files are downloaded the first time. Default: true
es: Si se debe detener automáticamente el uso compartido una vez descargados los archivos por primera vez. Predeterminado: true
ru: Остановить ли автоматически долю после загрузки файлов в первый раз. По умолчанию: True
sv: Om delningen ska stoppas automatiskt när filer hämtas första gången. Standard: true

source: filenames
es: ID de archivo
ru: имя файла
sv: filnamn

source: A list of files to share. Default: []
es: Un listado de archivos para compartir. Predeterminado: []
ru: Список файлов для обмена. По умолчанию: []
sv: En lista över filer att dela. Standard: []

source: Whether to log URL requests to stdout when using the CLI tool. Default: false
es: Si se deben registrar las solicitudes de URL en stdout cuando se utiliza la herramienta CLI. Por defecto: falso
ru: Следует ли регистрировать запросы URL-адреса, чтобы застрять при использовании инструмента CLI. По умолчанию
sv: Om URL-förfrågningar till stdout ska loggas när CLI-verktyget används. Standard: false

source: receive
es: recepcionar
ru: получить
sv: ta emot

source: The path where received files or text messages will be stored. Default: the 'OnionShare' folder of the user's home directory.
es: La ruta donde recibió archivos o mensaje de texto será almacenado. Por defecto: la carpeta 'OnionShare' del directorio de inicio del usuario.
ru: Путь, где будут храниться полученные файлы или текстовые сообщения. По умолчанию: папка «OnionShare» исходного каталога пользователя.
sv: Sökvägen där mottagna filer eller textmeddelanden lagras. Standard: mappen 'OnionShare' i användarens hemkatalog.

source: A webhook URL that OnionShare will POST to when it receives files or text messages. Default: null
es: URL de webhook a la que OnionShare enviará mensajes POST cuando reciba archivos o mensajes de texto. Predeterminado: null
ru: URL-адрес веб-хук, к которому OnionShare будет относиться, когда он получает файлы или текстовые сообщения. По умолчанию: null
sv: En webhook-URL som OnionShare skickar till när den tar emot filer eller textmeddelanden. Standard: null

source: Whether to disable receiving text messages. Default: false
es: Si se inhabilita la recepción de mensajes de texto. Predeterminado: false
ru: Отключить получение текстовых сообщений. По умолчанию
sv: Om mottagande av textmeddelanden ska inaktiveras. Standard: falskt

source: Whether to disable receiving files. Default: false
es: Si se deshabilita la recepción de archivos. Predeterminado: false
ru: Отключить прием файлов. По умолчанию
sv: Om mottagning av filer ska inaktiveras. Standard: false

source: website
es: sitio web
ru: веб-сайт
sv: webbplats

source: If set to ``true``, OnionShare won't set its default Content Security Policy header for the website. Default: ``false``
es: Si se establece como ``true``, OnionShare no establecerá su encabezado de Directiva de Seguridad de Contenido predeterminado para el sitio web. Valor predeterminado: ``false``
ru: `` True``, Onion Share не установит свой заголовок политики безопасности контента для веб-сайта. По умолчанию: ``false``
sv: Om den är inställd på ``true`` kommer OnionShare inte att ställa in standardrubriken för innehållssäkerhetspolicyn för webbplatsen. Standard: ``false``

source: A custom Content Security Policy header to send instead of the default.
es: Una cabecera personalizada de Directiva de Seguridad del Contenido para enviar en vez de lo predeterminado.
ru: Настраиваемый заголовок политики безопасности контента для отправки вместо по умолчанию.
sv: En anpassad rubrik för innehållssäkerhetspolicy att skicka istället för standardrubriken.

source: chat
es: charla
ru: чат
sv: chatt

source: There are currently no configurable settings for the Chat mode.
es: Actualmente no hay ajustes configurables para el modo Charla.
ru: В настоящее время нет настраиваемых настроек для режима чата.
sv: Det finns för närvarande inga konfigurerbara inställningar för chattläget.

source: ``boolean``
sv: ``booleskt``

source: ``list``
sv: ``lista``

source: Everything in OnionShare is temporary by default. If you close an OnionShare tab, its address no longer exists and it can't be used again. Sometimes you might want an OnionShare service to be persistent. This is useful if you want to host a website available from the same OnionShare address even if you reboot your computer.
km: តាមលំនាំដើម គ្រប់យ៉ាងនៅក្នុង OnionShare គឺបណ្ដោះអាសន្ន។ ប្រសិនបើអ្នកបិទផ្ទាំង OnionShare មួយ នោះអាសយដ្ឋានរបស់វានឹងលែងមានទៀតហើយ ហើយវាមិនអាចប្រើបានម្ដងទៀតឡើយ។ នៅពេលខ្លះ អ្នកប្រហែលជាចង់ឱ្យសេវាកម្ម OnionShare មួយនៅតែមាន។ វាមានប្រយោជន៍ ប្រសិនបើអ្នកចង់បង្ហោះវេបសាយមួយពីអាសយដ្ឋាន OnionShare ដូចគ្នា ទោះបីជាអ្នកចាប់ផ្ដើមកុំព្យូទ័ររបស់អ្នកម្ដងទៀតក៏ដោយ។
pt_br: Tudo no OnionShare é temporário por padrão. Se você fechar uma aba do OnionShare, o seu endereço não existirá mais e não poderá ser utilizado novamente. As vezes você pode querer que um serviço do OnionShare seja persistente. Isso é útil se você quer hospedar um website disponível do mesmo endereço do OnionShare mesmo se você reiniciar seu computador.
uk: Усе в OnionShare типово є тимчасовим. Якщо закрити вкладку OnionShare, її адреса більше не існуватиме й її більше не можна використовувати. Іноді вам може знадобитися, щоб служба OnionShare була постійною. Це корисно, якщо ви хочете розмістити вебсайт, доступний з тієї ж адреси OnionShare, навіть якщо ви перезапустите свій комп’ютер.

source: To make any tab persistent, check the "Save this tab, and automatically open it when I open OnionShare" box before starting the server. When a tab is saved a purple pin icon appears to the left of its server status.
km: ដើម្បីធ្វើឱ្យផ្ទាំងមួយនៅតែរក្សាជាប់លាប់ សូមធីកប្រអប់ "រក្សាផ្ទាំងនេះ និងបើកវាដោយស្វ័យប្រវត្តិនៅពេលខ្ញុំបើក OnionShare" នៅមុនពេលចាប់ផ្ដើមម៉ាស៊ីនមេ។ នៅពេលផ្ទាំងមួយត្រូវបានរក្សាទុក នោះរូបតំណាងពណ៌ស្វាយលេចឡើងនៅខាងឆ្វេងនៃស្ថានភាពម៉ាស៊ីនមេ។
pt_br: Para deixar uma aba persistente, selecione a caixa "Salve esta aba, e automaticamente a abra quando eu abrir o OnionShare", antes de iniciar o servidor. Quando uma aba é salva um alfinete roxo aparece à esquerda do status de seu servidor.
uk: Щоб зробити будь-яку вкладку постійною, позначте "Зберегти цю вкладку та автоматично відкривати її, коли я відкриваю OnionShare" перед запуском сервера. Коли вкладку збережено, ліворуч від стану сервера з’являється фіолетова піктограма у вигляді шпильки.

source: When you quit OnionShare and then open it again, your saved tabs will start opened. You'll have to manually start each service, but when you do they will start with the same OnionShare address and password.
uk: Коли ви вийдете з OnionShare, а потім знову відкриєте його, збережені вкладки почнуть відкриватися. Вам доведеться власноруч запускати кожну службу, але коли ви це зробите, вони запустяться з тієї ж адреси OnionShare і з тим же паролем.

source: If you save a tab, a copy of that tab's onion service secret key will be stored on your computer with your OnionShare settings.
km: ប្រសិនបើអ្នករក្សាទុកផ្ទាំងមួយ នោះច្បាប់ចម្លងនៃសោសម្ងាត់នៃសេវាកម្ម onion របស់ផ្ទាំងនោះនឹងត្រូវបានរក្សាទុកនៅលើកុំព្យូទ័ររបស់អ្នកជាមួយការកំណត់ OnionShare របស់អ្នក។
pt_br: Se você salvar uma ama, uma cópia da chave secreta do serviço onion dessa aba será armazenada no seu computador com as suas configurações OnionShare.
uk: Якщо ви збережете вкладку, копія таємного ключа служби onion цієї вкладки зберігатиметься на вашому комп’ютері з налаштуваннями OnionShare.

source: Turn Off Passwords
uk: Вимкнення паролів

source: By default, all OnionShare services are protected with the username ``onionshare`` and a randomly-generated password. If someone takes 20 wrong guesses at the password, your onion service is automatically stopped to prevent a brute force attack against the OnionShare service.
uk: Типово всі служби OnionShare захищені іменем користувача ``onionshare`` і випадково створеним паролем. Якщо хтось вводить пароль неправильно 20 разів, ваша служба onion автоматично зупинениться, щоб запобігти грубій спробі зламу служби OnionShare.

source: Sometimes you might want your OnionShare service to be accessible to the public, like if you want to set up an OnionShare receive service so the public can securely and anonymously send you files. In this case, it's better to disable the password altogether. If you don't do this, someone can force your server to stop just by making 20 wrong guesses of your password, even if they know the correct password.
uk: Іноді вам може знадобитися, щоб ваша служба OnionShare була загальнодоступною, наприклад, якщо ви хочете налаштувати службу отримання OnionShare, щоб інші могли безпечно та анонімно надсилати вам файли. У цьому випадку краще взагалі вимкнути пароль. Якщо ви цього не зробите, хтось може змусити ваш сервер зупинитися, просто зробивши 20 неправильних спроб введення паролю, навіть якщо вони знають правильний пароль.

source: To turn off the password for any tab, just check the "Don't use a password" box before starting the server. Then the server will be public and won't have a password.
uk: Щоб вимкнути пароль для будь-якої вкладки, просто позначте «Не використовувати пароль» перед запуском сервера. Тоді сервер буде загальнодоступним і не матиме пароля.

source: By default, when people load an OnionShare service in Tor Browser they see the default title for the type of service. For example, the default title of a chat service is "OnionShare Chat".
km: តាមលំនាំដើម នៅពេលមនុស្សដំណើរការសេវាកម្ម OnionShare នៅក្នុងកម្មវិធីរុករក Tor នោះពួកគេនឹងឃើញចំណងជើងលំនាំដើមសម្រាប់ប្រភេទសេវាកម្មនោះ។ ឧទាហរណ៍ ចំណងជើងលំនាំដើមនៃសេវាកម្មឈែត គឺ "OnionShare ឈែត"។
pt_br: Por padrão, quando as pessoas carregam um serviço OnionShare no Tor Browser elas vêem o título padrão para o tipo de serviço. Por exemplo, o título padrão de um serviço de bate-papo é "OnionShare Chat".
uk: Усталено, коли користувачі завантажують службу OnionShare у браузері Tor, вони бачать типову назву для типу служби. Наприклад, типовою назвою чату є "OnionShare Chat".

source: If you want to choose a custom title, set the "Custom title" setting before starting a server.
km: ប្រសិនបើអ្នកចង់ជ្រើសរើសចំណងជើងផ្ទាល់ខ្លួន សូមកំណត់ "ចំណងជើងផ្ទាល់ខ្លួន" មុនពេលចាប់ផ្ដើមម៉ាស៊ីនមេ។
pt_br: Se você quiser escolher um título personalizado, defina a configuração "Título personalizado" antes de iniciar um servidor.
uk: Якщо потрібно вибрати власний заголовок, перед запуском сервера встановіть параметр «Власний заголовок».

source: If you scheduled a service to start in the future, when you click the "Start sharing" button you will see a timer counting down until it starts. If you scheduled it to stop in the future, after it's started you will see a timer counting down to when it will stop automatically.
km: ប្រសិនបើអ្នកបានកំណត់ពេលវេលាឱ្យម៉ាស៊ីនមេមួយចាប់ផ្ដើមនៅពេលអនាគត នោះនៅពេលអ្នកចុចប៊ូតុង "ចាប់ផ្ដើមបញ្ជូន" អ្នកនឹងឃើញពេលវេលារាប់ថយក្រោយរហូតដល់វាចាប់ផ្ដើម។ ប្រសិនបើអ្នកបានកំណត់ពេលវេលាឱ្យវាបញ្ឈប់នៅពេលអនាគត នោះបន្ទាប់ពីវាបានចាប់ផ្ដើម អ្នកនឹងឃើញពេលវេលារាប់ថយក្រោយទៅកាន់ពេលវេលាដែលវានឹងបញ្ឈប់ដោយស្វ័យប្រវត្តិ។
pt_br: Se você agendou um serviço para iniciar no futuro, ao clicar no botão "Iniciar compartilhamento", você verá um cronômetro contando até que ele comece. Se você o programou para parar no futuro, depois que ele for iniciado, você verá um cronômetro em contagem regressiva até quando ele irá parar automaticamente.
uk: Якщо ви запланували запуск послуги в майбутньому, після натискання кнопки «Почати надсилання» ви побачите таймер зі зворотним відліком до початку запуску. Якщо ви запланували його зупинку в майбутньому, після його запуску ви побачите таймер з відліком часу, коли його буде автоматично зупинено.

source: **Scheduling an OnionShare service to automatically start can be used as a dead man's switch**, where your service will be made public at a given time in the future if anything happens to you. If nothing happens to you, you can cancel the service before it's scheduled to start.
km: **ការកំណត់ពេលវេលានៃសេវាកម្ម OnionShare ដើម្បីចាប់ផ្ដើមដោយស្វ័យប្រវត្តិ អាចត្រូវបានប្រើដូចជាកុងតាក់ស្វ័យប្រវត្តិដែរ** ដែលសេវាកម្មរបស់អ្នកនឹងត្រូវបានធ្វើឱ្យជាសាធារណៈនៅពេលវេលាណាមួយនៅពេលអនាគត ប្រសិនបើមានអ្វីមួយកើតឡើងចំពោះអ្នក។ ប្រសិនបើគ្មានអ្វីកើតឡើងចំពោះអ្នកទេ នោះអ្នកនឹងអាចបញ្ឈប់សេវាកម្មនោះនៅមុនពេលដែលវាត្រូវបានកំណត់ពេលវេលាឱ្យចាប់ផ្ដើម។
pt_br: ** Agendar um serviço OnionShare para iniciar automaticamente pode ser usado como uma chave de homem morto **, onde seu serviço será tornado público em um determinado momento no futuro, se algo acontecer com você. Se nada acontecer com você, você pode cancelar o serviço antes do programado para iniciar.
uk: **Планування служби OnionShare для автоматичного запуску може використовуватися як кнопка мерця**, де вашу службу буде оприлюднено в певний час у майбутньому, якщо з вами щось станеться. Якщо з вами нічого не відбувається, ви можете вимкнути службу до запланованого запуску.

source: **Scheduling an OnionShare service to automatically stop can be useful to limit exposure**, like if you want to share secret documents while making sure they're not available on the Internet for more than a few days.
uk: **Планування автоматичної зупинки служби OnionShare може бути корисним для обмеження надсилання**, наприклад, якщо ви хочете поділитися таємними документами й буди певними, що вони не доступні в Інтернеті впродовж більше кількох днів.

source: You can install just the command-line version of OnionShare using ``pip3``::
km: អ្នកអាចដំឡើងកំណែឃ្លាបញ្ជានៃ OnionShare ដោយប្រើប្រាស់ ``pip3``::
pt_br: Você pode instalar apenas a versão de linha de comando do OnionShare usando `` pip3`` ::
uk: Ви можете встановити версію для командного рядка OnionShare лише використовуючи ``pip3``::

source: If you installed OnionShare using the Linux Snapcraft package, you can also just run ``onionshare.cli`` to access the command-line interface version.
km: ប្រសិនបើអ្នកបានដំឡើង Onionshare ដោយប្រើប្រាស់កញ្ចប់ Linux Snapcraft នោះអ្នកគ្រាន់តែដំណើរការ ``onionshare.cli`` ដើម្បីចូលប្រើកំណែផ្ទៃឃ្លាបញ្ជា។
pt_br: Se você instalou o OnionShare usando o pacote Linux Snapcraft, você também pode simplesmente executar `` onionshare.cli`` para acessar a versão da interface de linha de comando.
uk: Якщо ви встановили OnionShare за допомогою пакунка Linux Snapcraft, ви можете просто запустити ``onionshare.cli`` для доступу до версії інтерфейсу командного рядка.

source: You can browse the command-line documentation by running ``onionshare --help``::
km: អ្នកអាចរកមើលឯកសារឃ្លាបញ្ជាដោយដំណើរការ ``onionshare --help``::
pt_br: Você pode navegar pela documentação da linha de comando executando `` onionshare --help`` ::
uk: Ви можете переглянути документацію командного рядка, запустивши ``onionshare --help``::

source: Legacy Addresses
uk: Застарілі адреси

source: OnionShare uses v3 Tor onion services by default. These are modern onion addresses that have 56 characters, for example::
uk: Типово, OnionShare використовує служби onion Tor v3. Це сучасні адреси onion, що мають 56 символів, наприклад::

source: OnionShare still has support for v2 onion addresses, the old type of onion addresses that have 16 characters, for example::
uk: OnionShare досі підтримує адреси onion v2, старий тип адрес onion, які мають 16 символів, наприклад::

source: OnionShare calls v2 onion addresses "legacy addresses", and they are not recommended, as v3 onion addresses are more secure.
uk: OnionShare називає адреси onion v2 «застарілими адресами» і вони не рекомендовані, оскільки адреси onion v3 безпечніші.
