Repository: onionshare/onionshare
Catalog: docs/source/locale/*/LC_MESSAGES/develop.po
Languages: bg

source: Developing OnionShare
bg: Разработка на OnionShare

source: Collaborating
bg: Сътрудничество

source: OnionShare has an open Keybase team to discuss the project, ask questions, share ideas and designs, and making plans for future development. (It's also an easy way to send end-to-end encrypted direct messages to others in the OnionShare community, like OnionShare addresses.) To use Keybase, download the `Keybase app <https://keybase.io/download>`_, make an account, and `join this team <https://keybase.io/team/onionshare>`_. Within the app, go to "Teams", click "Join a Team", and type "onionshare".
bg: OnionShare има отворен екип в Keybase за обсъждане на проекта, задаване на въпроси, споделяне на идеи и дизайни, и планиране на бъдещото развитие. Също така е лесен начин за изпращане на шифровани директни съобщения до други членове на общността на OnionShare, като адреси на услуги на OnionShare. За да използвате Keybase, изтеглете `приложението Keybase <https://keybase.io/download>`_, създайте профил и `се присъединете към този екип <https://keybase.io/team/onionshare>`_. В приложението отворете „Teams“, докоснете „Join a Team“ и въведете „onionshare“.

source: OnionShare also has a `mailing list <https://lists.riseup.net/www/subscribe/onionshare-dev>`_ for developers and and designers to discuss the project.
bg: Също така OnionShare разполага и с `пощенски списък <https://lists.riseup.net/www/subscribe/onionshare-dev>`_ за разработчици и дизайнери.

source: Contributing Code
bg: Допринасяне на код

source: OnionShare source code is to be found in this Git repository: https://github.com/onionshare/onionshare
bg: Изходният код на OnionShare може да бъде намерен в хранилището в Гитхъб: https://github.com/onionshare/onionshare

source: If you'd like to contribute code to OnionShare, it helps to join the Keybase team and ask questions about what you're thinking of working on. You should also review all of the `open issues <https://github.com/onionshare/onionshare/issues>`_ on GitHub to see if there are any you'd like to tackle.
bg: Ако искате да допринесете код към OnionShare, е полезно да се присъедините към екипа в Keybase и да зададете въпроси относно това, върху което смятате да работите. Също така трябва да прегледате всички `докладвани дефекти <https://github.com/onionshare/onionshare/issues>`_ в Гитхъб, за да видите дали има някои, с които бихте искали да занимавате.

source: When you're ready to contribute code, open a pull request in the GitHub repository and one of the project maintainers will review it and possibly ask questions, request changes, reject it, or merge it into the project.
bg: Когато сте готови да допринесете код, направете заявка за сливане към хранилището в Гитхъб и един от поддръжниците на проекта ще го прегледа и евентуално ще зададе въпроси, поиска промени, отхвърли или го приеме.

source: Starting Development
bg: Начало на разработката

source: OnionShare is developed in Python. To get started, clone the Git repository at https://github.com/onionshare/onionshare/ and then consult the ``cli/README.md`` file to learn how to set up your development environment for the command-line version, and the ``desktop/README.md`` file to learn how to set up your development environment for the graphical version.
bg: OnionShare се разработва на Python. За да започнете клонирайте хранилището на Git от https://github.com/onionshare/onionshare/. Последвайте стъпките от файла ``cli/README.md``, за да настроите обкръжението на средата за разработка на конзолния вариант на приложението, а във файла ``desktop/README.md`` ще откриете стъпките за настройка на обкръжението за разработка на графичната версия.

source: Those files contain the necessary technical instructions and commands install dependencies for your platform, and to run OnionShare from the source tree.
bg: Тези файлове съдържат инструкциите и командите за инсталиране на необходимите зависимости за платформата, на която планирате да разработвате приложението, а също така и начини за изпълняване на OnionShare директно от работната папка.

source: Debugging tips
bg: Съвети за отстраняване на дефекти

source: Verbose mode
bg: Подробен режим

source: When developing, it's convenient to run OnionShare from a terminal and add the ``--verbose`` (or ``-v``) flag to the command. This prints a lot of helpful messages to the terminal, such as when certain objects are initialized, when events occur (like buttons clicked, settings saved or reloaded), and other debug info. For example::
bg: По време на разработката за удобство при стартиране на OnionShare от команден ред е препоръчително да добавите флага ``--verbose`` (или ``-v``). По този начин в терминала се извежда подробна информация за това кога дадени обекти се създават, кога възникват дадени събития (натискане на бутони, зареждане или запазване на настройки) и друга информация, полезна при отстраняване на дефекти. Например::

source: You can add your own debug messages by running the ``Common.log`` method from ``onionshare/common.py``. For example::
bg: Можете да добавите собствени съобщения за отстраняване на грешки, като изпълните метода ``Common.log`` от ``onionshare/common.py``. Например::

source: This can be useful when learning the chain of events that occur when using OnionShare, or the value of certain variables before and after they are manipulated.
bg: Може да бъде от полза при изучаване на последователност от събития при използване на OnionShare или стойностите на определени променливи преди и след тяхната промяна.

source: Local Only
bg: Местна разработка

source: Tor is slow, and it's often convenient to skip starting onion services altogether during development. You can do this with the ``--local-only`` flag. For example::
bg: Мрежата на Tor е бавна, и често е по-удобно да пропуснете стартирането на услугите на Onion по време на разработка. Това можете да направите с ключа за команден ред ``--local-only``. Например::

source: In this case, you load the URL ``http://127.0.0.1:17641`` in a normal web-browser like Firefox, instead of using the Tor Browser. The private key is not actually needed in local-only mode, so you can ignore it.
bg: В този случай отворете адреса ``http://127.0.0.1:17641`` в обикновен четец като Firefox, вместо да използвате Tor Browser. Тайният ключ всъщност не е необходим в режим на локално използване, така че можете да го пренебрегнете.

source: Contributing Translations
bg: Допринасяне с превод

source: Help make OnionShare easier to use and more familiar and welcoming for people by translating it on `Hosted Weblate <https://hosted.weblate.org/projects/onionshare/>`_. Always keep the "OnionShare" in latin letters, and use "OnionShare (localname)" if needed.
bg: Помогнете да направим OnionShare по-лесен за използване и по-познат и приветлив за хората, като го преведете на `Hosted Weblate <https://hosted.weblate.org/projects/onionshare/>`_. Винаги изписвайте „OnionShare“ с латински букви, и използвайте „OnionShare (местно име)“, ако е необходимо.

source: To help translate, make a Hosted Weblate account and start contributing.
bg: За да помогнете с превода, създайте профил в Hosted Weblate и започнете да допринасяте.

source: Suggestions for Original English Strings
bg: Предложения към изходните английски текстове

source: Sometimes the original English strings are wrong, or don't match between the application and the documentation.
bg: Понякога изходните текстове на английски език съдържат грешки или има разминаване между приложението и документацията.

source: File source string improvements by adding @kingu to your Weblate comment, or open a GitHub issue or pull request. The latter ensures all upstream developers see the suggestion, and can potentially modify the string via the usual code review processes.
bg: За да предложите промени в изходните низове добавете @kingu към коментара в Weblate. Също така можете да докладвате дефект или да създадете заявка за сливане, което ще ви гарантира, че основните разработчици ще могат да променят низа посредством обичайния процес по приемане на заявките за сливане.

source: Status of Translations
bg: Състояние на преводите

source: Here is the current translation status. If you want start a translation in a language not yet started, please write to the mailing list: onionshare-dev@lists.riseup.net
bg: Това е моментното състояние на преводите. Ако желаете да започнете превод на език, който липсва трябва да изпратите писмо до пощенския списък: onionshare-dev@lists.riseup.net
