Repository: onionshare/onionshare
Catalog: docs/source/locale/*/LC_MESSAGES/features.po
Languages: ga, ta

source: To host a static HTML website with OnionShare, open a website tab, drag the files and folders that make up the static content there, and click "Start sharing" when you are ready.
ga: Chun suíomh Gréasáin statach HTML a óstáil le OnionShare, oscail cluaisín láithreán gréasáin, tarraing na comhaid agus na fillteáin a dhéanann suas an t-ábhar statach ann, agus cliceáil "Tosaigh a roinnt" nuair atá tú réidh.
ta: வெங்காயர் மூலம் நிலையான உஉகுமொ வலைத்தளத்தை நடத்த, ஒரு வலைத்தள தாவலைத் திறக்கவும், அங்குள்ள நிலையான உள்ளடக்கத்தை உருவாக்கும் கோப்புகள் மற்றும் கோப்புறைகளை இழுத்து, நீங்கள் தயாராக இருக்கும்போது "பகிர்வைத் தொடங்கு" என்பதைக் சொடுக்கு செய்க.

source: If you add an ``index.html`` file, it will render when someone loads your website. You should also include any other HTML files, CSS files, JavaScript files, and images that make up the website. (Note that OnionShare only supports hosting *static* websites. It can't host websites that execute code or use databases. So you can't for example use WordPress.)
ga: Má chuireann tú comhad `` index.html`` leis, déanfar é a sholáthar nuair a lódálann duine éigin do shuíomh Gréasáin. Ba cheart duit aon chomhaid HTML eile, comhaid CSS, comhaid JavaScript, agus íomhánna ar an suíomh Gréasáin a chur san áireamh freisin. (Tabhair faoi deara nach dtacaíonn OnionShare ach le láithreáin ghréasáin *statacha* a óstáil. Ní féidir leis láithreáin ghréasáin a chuireann cód i bhfeidhm nó a úsáideann bunachair shonraí a óstáil. Mar sin ní féidir leat WordPress a úsáid mar shampla.)
ta: நீங்கள் ஒரு ``index.html`` கோப்பைச் சேர்த்தால், யாராவது உங்கள் வலைத்தளத்தை ஏற்றும்போது அது வழங்கப்படும். வலைத்தளத்தை உருவாக்கும் வேறு ஏதேனும் உஉகுமொ கோப்புகள், சிஎச்எச் கோப்புகள், சாவாகைஉரை கோப்புகள் மற்றும் படங்களையும் நீங்கள் சேர்க்க வேண்டும். (வெங்காயப் பகிர்வு *நிலையான* வலைத்தளங்களைப் புரவலன் செய்வதை மட்டுமே ஆதரிக்கிறது என்பதை நினைவில் கொள்ளவும். குறியீட்டை இயக்கும் அல்லது தரவுத்தளங்களைப் பயன்படுத்தும் வலைத்தளங்களை இது புரவலன் செய்ய முடியாது. எனவே நீங்கள் எடுத்துக்காட்டாகச் சொலச்சைப் பயன்படுத்த முடியாது.)

source: If you don't have an ``index.html`` file, it will show a directory listing instead, and people loading it can look through the files and download them.
ga: Mura bhfuil comhad `` index.html`` agat, taispeánfaidh sé liosta eolaire ina ionad sin, agus is féidir le daoine atá á lódáil breathnú tríd na comhaid agus iad a íoslódáil.
ta: உங்களிடம் `` index.html`` கோப்பு இல்லையென்றால், அது அதற்கு பதிலாக ஒரு அடைவு பட்டியலைக் காண்பிக்கும், மேலும் அதை ஏற்றும் நபர்கள் கோப்புகள் வழியாகப் பார்த்து அவற்றைப் பதிவிறக்கலாம்.

source: Content Security Policy
ga: Beartas Slándála Ábhar
ta: உள்ளடக்க பாதுகாப்பு கொள்கை

source: By default OnionShare helps secure your website by setting a strict `Content Security Policy <https://en.wikipedia.org/wiki/Content_Security_Policy>`_ header. However, this prevents third-party content from loading inside the web page.
ga: De réir réamhshocraithe cabhraíonn OnionShare le do shuíomh Gréasáin a dhéanamh slán trí cheanntásc dian `Polasaí Slándála Ábhar <https://en.wikipedia.org/wiki/Content_Security_Policy>`_ a shocrú. Mar sin féin, cuireann sé seo cosc ar ábhar tríú páirtí ó luchtú taobh istigh den leathanach gréasáin.
ta: இயல்பாகவே வெங்காயப் பகிர்வு ஒரு கண்டிப்பான `உள்ளடக்கப் பாதுகாப்புக் கொள்கையை <https://en.wikipedia.org/wiki/Content_Security_Policy>`_ தலைப்பை அமைப்பதன் மூலம் உங்கள் வலைத்தளத்தைப் பாதுகாக்க உதவுகிறது. இருப்பினும், இது மூன்றாம் தரப்பு உள்ளடக்கத்தை வலைப்பக்கத்திற்குள் ஏற்றுவதைத் தடுக்கிறது.

source: If you want to load content from third-party websites, like assets or JavaScript libraries from CDNs, you have two options:
ga: Más mian leat inneachar a lódáil ó shuíomhanna Gréasáin tríú páirtí, amhail sócmhainní nó leabharlanna JavaScript ó CDNanna, tá dhá rogha agat:
ta: சி.டி.என்-களில் இருந்து சொத்துக்கள் அல்லது சாவாச்கிரிப்ட் நூலகங்கள் போன்ற மூன்றாம் தரப்பு வலைத்தளங்களிலிருந்து உள்ளடக்கத்தை ஏற்ற விரும்பினால், உங்களுக்கு இரண்டு விருப்பங்கள் உள்ளன:

source: You can disable sending a Content Security Policy header by checking the "Don't send Content Security Policy header (allows your website to use third-party resources)" box before starting the service.
ga: Is féidir leat ceanntásc Beartas Slándála Ábhar a sheoladh a dhíchumasú ach an ceanntásc “Ná seol an Beartas Slándála Ábhar a sheoladh (a ligeann do láithreán gréasáin acmhainní tríú páirtí a úsáid)” a sheiceáil roimh thosú ar an tseirbhís.
ta: சேவையைத் தொடங்குவதற்கு முன் "உள்ளடக்க பாதுகாப்பு கொள்கை தலைப்பை அனுப்ப வேண்டாம் (உங்கள் வலைத்தளத்தை மூன்றாம் தரப்பு வளங்களைப் பயன்படுத்த அனுமதிக்கிறது)" பெட்டியைச் சரிபார்ப்பதன் மூலம் உள்ளடக்க பாதுகாப்பு கொள்கை தலைப்பை அனுப்புவதை முடக்கலாம்.

source: You can send a custom Content Security Policy header.
ga: Is féidir leat ceanntásc saincheaptha Beartas Slándála Ábhar a sheoladh.
ta: தனிப்பயன் உள்ளடக்க பாதுகாப்பு கொள்கை தலைப்பை அனுப்பலாம்.

source: Tips for running a website service
ga: Leideanna maidir le seirbhís láithreán gréasáin a reáchtáil
ta: வலைத்தள சேவையை இயக்குவதற்கான உதவிக்குறிப்புகள்

source: If you want to host a long-term website using OnionShare (meaning not just to quickly show someone something), it's recommended you do it on a separate, dedicated computer that is always powered on and connected to the internet, and not on the one you use on a regular basis. Save the tab (see :ref:`save_tabs`) so you can resume the website with the same address if you close OnionShare and re-open it later.
ga: Más mian leat láithreán gréasáin fadtéarmach a óstáil ag baint úsáide as OnionShare (rud a chiallaíonn ní hamháin rud éigin a thaispeáint do dhuine éigin go tapa), moltar duit é a dhéanamh ar ríomhaire tiomnaithe ar leith atá faoi thiomáint i gcónaí agus ceangailte leis an idirlíon, agus ní ar an gceann úsáideann tú ar bhonn rialta. Sábháil an cluaisín (féach :ref:`save_tabs`) ionas gur féidir leat an suíomh Gréasáin a atosú leis an seoladh céanna má dhúnann tú OnionShare agus é a oscailt arís níos déanaí.
ta: நீங்கள் வெங்காயத்தைப் பயன்படுத்தி ஒரு நீண்டகால வலைத்தளத்தை புரவலன் செய்ய விரும்பினால் (அதாவது யாரையாவது விரைவாகக் காண்பிப்பது மட்டுமல்ல), ஒரு தனி, அர்ப்பணிப்புள்ள கணினியில் இதைச் செய்ய பரிந்துரைக்கப்படுகிறது, அது எப்போதும் இயங்கும் மற்றும் இணையத்துடன் இணைக்கப்பட்டுள்ளது, ஆனால் ஒன்றல்ல நீங்கள் ஒரு வழக்கமான அடிப்படையில் பயன்படுத்துகிறீர்கள். தாவலைச் சேமிக்கவும் (பார்க்க: ref: `Save_tabs`) எனவே நீங்கள் வெங்காயத்தை மூடி பின்னர் மீண்டும் திறந்தால் அதே முகவரியுடன் வலைத்தளத்தை மீண்டும் தொடங்கலாம்.

source: If your website is intended for the public, you should run it as a public service (see :ref:`turn_off_private_key`).
ga: Má tá do shuíomh Gréasáin beartaithe don phobal, ba cheart duit é a rith mar sheirbhís phoiblí (féach :tag: `turn_off_private_key`).
ta: உங்கள் வலைத்தளம் பொதுமக்களுக்காக வடிவமைக்கப்பட்டிருந்தால், நீங்கள் அதை ஒரு பொது சேவையாக இயக்க வேண்டும் (பார்க்க: குறிப்பு: `turn_off_private_key`).

source: Chat Anonymously
ga: Comhrá gan ainm
ta: அநாமதேயமாக அரட்டையடிக்கவும்

source: You can use OnionShare to set up a private, secure chat room that doesn't log anything. Just open a chat tab and click "Start chat server".
ga: Is féidir leat OnionShare a úsáid chun seomra comhrá príobháideach slán a chur ar bun nach logálann aon rud. Just a oscailt cluaisín comhrá agus cliceáil "Start freastalaí comhrá".
ta: எதையும் உள்நுழையாத தனிப்பட்ட, பாதுகாப்பான அரட்டை அறையை அமைக்க நீங்கள் வெங்காயத்தைப் பயன்படுத்தலாம். அரட்டை தாவலைத் திறந்து "அரட்டை சேவையகத்தைத் தொடங்கு" என்பதைக் சொடுக்கு செய்க.

source: After you start the server, copy the OnionShare address and private key and send them to the people you want in the anonymous chat room. If it's important to limit exactly who can join, use an encrypted messaging app to send out the OnionShare address and private key.
ga: Tar éis duit an freastalaí a thosú, cóipeáil an seoladh OnionShare agus an eochair phríobháideach agus seol iad chuig na daoine atá uait sa seomra comhrá gan ainm. Má tá sé tábhachtach a theorannú go díreach cé atá in ann páirt a ghlacadh, bain úsáid as aip teachtaireachtaí criptithe chun an seoladh OnionShare agus an eochair phríobháideach a sheoladh amach.
ta: நீங்கள் சேவையகத்தைத் தொடங்கிய பிறகு, வெங்காய முகவரி மற்றும் தனியார் விசையை நகலெடுத்து அநாமதேய அரட்டை அறையில் நீங்கள் விரும்பும் நபர்களுக்கு அனுப்பவும். யார் சேரலாம் என்பதை சரியாகக் கட்டுப்படுத்துவது முதன்மை என்றால், வெங்காய முகவரி மற்றும் தனியார் விசையை அனுப்ப மறைகுறியாக்கப்பட்ட செய்தியிடல் பயன்பாட்டைப் பயன்படுத்தவும்.

source: People can join the chat room by loading its OnionShare address in Tor Browser. The chat room requires JavasScript, so everyone who wants to participate must have their Tor Browser security level set to "Standard" or "Safer", instead of "Safest".
ga: Is féidir le daoine dul isteach sa seomra comhrá trína sheoladh OnionShare a lódáil i Brabhsálaí Tor. Tá JavasScript ag teastáil ón seomra comhrá, mar sin ní mór do gach duine atá ag iarraidh a bheith rannpháirteach a leibhéal slándála Brabhsálaí Tor a shocrú go "Caighdeánach" nó "Níos Sábháilte", in ionad "Is Sábháilte".
ta: டோர் உலாவியில் அதன் வெங்காயக் முகவரியை ஏற்றுவதன் மூலம் மக்கள் அரட்டை அறையில் சேரலாம். அரட்டை அறைக்கு சாவாச்கிரிப்ட் தேவைப்படுகிறது, எனவே பங்கேற்க விரும்பும் அனைவருக்கும் அவர்களின் டோர் உலாவி பாதுகாப்பு நிலை "பாதுகாப்பானது" என்பதற்கு பதிலாக "தரநிலை" அல்லது "பாதுகாப்பானது" என அமைக்கப்பட்டிருக்க வேண்டும்.

source: When someone joins the chat room they get assigned a random name. They can change their name by typing a new name in the box in the left panel and pressing ↵. Since the chat history isn't saved anywhere, it doesn't get displayed at all, even if others were already chatting in the room.
ga: Nuair a théann duine isteach sa seomra comhrá, sanntar ainm randamach air. Is féidir leo a n-ainm a athrú trí ainm nua a chlóscríobh sa bhosca ar an bpainéal ar chlé agus ↵ a bhrú. Ós rud é nach bhfuil an stair chomhrá sábháilte in aon áit, ní thaispeántar ar chor ar bith é, fiú má bhí daoine eile ag comhrá sa seomra cheana féin.
ta: யாராவது அரட்டை அறையில் சேரும்போது அவர்கள் ஒரு சீரற்ற பெயரை ஒதுக்குகிறார்கள். இடது பேனலில் உள்ள பெட்டியில் ஒரு புதிய பெயரைத் தட்டச்சு செய்து ↵ அழுத்துவதன் மூலம் அவர்கள் தங்கள் பெயரை மாற்றலாம். அரட்டை வரலாறு எங்கும் சேமிக்கப்படாததால், மற்றவர்கள் ஏற்கனவே அறையில் அரட்டை அடித்துக்கொண்டிருந்தாலும் கூட, அது காண்பிக்கப்படாது.

source: In an OnionShare chat room, everyone is anonymous. Anyone can change their name to anything, and there is no way to confirm anyone's identity.
ga: I seomra comhrá OnionShare, tá gach duine gan ainm. Is féidir le duine ar bith a n-ainm a athrú go rud ar bith, agus níl aon bhealach ann chun céannacht aon duine a dhearbhú.
ta: ஒரு வெங்காய அரட்டை அறையில், எல்லோரும் அநாமதேயர்கள். எவரும் தங்கள் பெயரை எதற்கும் மாற்றலாம், யாருடைய அடையாளத்தையும் உறுதிப்படுத்த வழி இல்லை.

source: However, if you create an OnionShare chat room and securely send the address only to a small group of trusted friends using encrypted messages, you can be reasonably confident the people joining the chat room are your friends.
ga: Mar sin féin, má chruthaíonn tú seomra comhrá OnionShare agus má sheolann tú an seoladh go slán ach chuig grúpa beag cairde iontaofa ag baint úsáide as teachtaireachtaí criptithe, is féidir leat a bheith réasúnta muiníneach gur cairde iad na daoine a thagann isteach sa seomra comhrá.
ta: இருப்பினும், நீங்கள் ஒரு வெங்காய அரட்டை அறையை உருவாக்கி, குறியாக்கப்பட்ட செய்திகளைப் பயன்படுத்தி நம்பகமான நண்பர்களின் ஒரு சிறிய குழுவிற்கு மட்டுமே முகவரியை பாதுகாப்பாக அனுப்பினால், அரட்டை அறையில் சேரும் நபர்கள் உங்கள் நண்பர்கள்.

source: How is this useful?
ga: Cén chaoi a bhfuil sé seo úsáideach?
ta: இது எவ்வாறு பயனுள்ளதாக இருக்கும்?

source: If you need to already be using an encrypted messaging app, what's the point of an OnionShare chat room to begin with? It leaves less traces.
ga: Más gá duit a bheith ag baint úsáide as aip teachtaireachtaí criptithe cheana féin, cad é an pointe a bhaineann le seomra comhrá OnionShare ar dtús? Fágann sé níos lú rianta.
ta: நீங்கள் ஏற்கனவே மறைகுறியாக்கப்பட்ட செய்தியிடல் பயன்பாட்டைப் பயன்படுத்த வேண்டும் என்றால், ஒரு வெங்காய அரட்டை அறையின் பயன் என்ன? இது குறைந்த தடயங்களை விட்டு விடுகிறது.

source: If you for example send a message to a Signal group, a copy of your message ends up on each device (the smartphones, and computers if they set up Signal Desktop) of each member of the group. Even if disappearing messages is turned on, it's hard to confirm all copies of the messages are actually deleted from all devices, and from any other places (like notifications databases) they may have been saved to. OnionShare chat rooms don't store any messages anywhere, so the problem is reduced to a minimum.
ga: Má sheolann tú teachtaireacht chuig grúpa Comharthaí mar shampla, críochnaíonn cóip de do theachtaireacht ar gach gléas (na fóin chliste, agus ríomhairí má bhunaíonn siad Comhartha Deisce) de gach ball den ghrúpa. Fiú má chuirtear teachtaireachtaí atá imithe ar siúl, tá sé deacair a dhearbhú go bhfuil gach cóip de na teachtaireachtaí scriosta ó gach feiste, agus ó áit ar bith eile (cosúil le bunachair shonraí fógraí) a bhféadfaí iad a shábháil. Ní stórálann seomraí comhrá OnionShare teachtaireachtaí ar bith áit ar bith, mar sin laghdaítear an fhadhb chomh beag agus is féidir.
ta: நீங்கள் ஒரு சமிக்ஞை குழுவிற்கு ஒரு செய்தியை அனுப்பினால், குழுவின் ஒவ்வொரு உறுப்பினரின் ஒவ்வொரு சாதனத்திலும் (ச்மார்ட்போன்கள் மற்றும் சிக்னல் டெச்க்டாப்பை அமைத்தால் கணினிகள்) உங்கள் செய்தியின் நகல் முடிகிறது. காணாமல் போகும் செய்திகள் இயக்கப்பட்டிருந்தாலும், செய்திகளின் அனைத்து நகல்களும் உண்மையில் எல்லா சாதனங்களிலிருந்தும் நீக்கப்பட்டுள்ளன, வேறு எந்த இடங்களிலிருந்தும் (அறிவிப்புகள் தரவுத்தளங்கள் போன்றவை) அவை சேமிக்கப்பட்டிருக்கலாம் என்பதை உறுதிப்படுத்துவது கடினம். வெங்காய அரட்டை அறைகள் எந்த செய்திகளையும் எங்கும் சேமிக்காது, எனவே சிக்கல் குறைந்தபட்சமாக குறைக்கப்படுகிறது.

source: OnionShare chat rooms can also be useful for people wanting to chat anonymously and securely with someone without needing to create any accounts. For example, a source can send an OnionShare address to a journalist using a disposable email address, and then wait for the journalist to join the chat room, all without compromosing their anonymity.
ga: Is féidir le seomraí comhrá OnionShare a bheith úsáideach freisin do dhaoine ar mian leo comhrá a dhéanamh gan ainm agus go slán le duine gan aon chuntas a chruthú. Mar shampla, is féidir le foinse seoladh OnionShare a sheoladh chuig iriseoir ag baint úsáide as seoladh ríomhphoist indiúscartha, agus ansin fanacht leis an iriseoir dul isteach sa seomra comhrá, ar fad gan cur isteach ar a anaithnideacht.
ta: எந்தவொரு கணக்குகளையும் உருவாக்கத் தேவையில்லாமல் ஒருவருடன் அநாமதேயமாகவும் பாதுகாப்பாகவும் அரட்டை அடிக்க விரும்பும் மக்களுக்கு வெங்காயம் அரட்டை அறைகள் பயனுள்ளதாக இருக்கும். எடுத்துக்காட்டாக, ஒரு மூலமான மின்னஞ்சல் முகவரியைப் பயன்படுத்தி ஒரு பத்திரிகையாளருக்கு ஒரு வெங்காய முகவரியை அனுப்பலாம், பின்னர் பத்திரிகையாளர் அரட்டை அறையில் சேர காத்திருக்கலாம், அனைவருமே அவர்களின் பெயர் தெரியாமல் வேறுபாடின்மை செய்யாமல்.

source: How does the encryption work?
ga: Conas a oibríonn an criptiú?
ta: குறியாக்கம் எவ்வாறு செயல்படுகிறது?

source: Because OnionShare relies on Tor onion services, connections between the Tor Browser and OnionShare are all end-to-end encrypted (E2EE). When someone posts a message to an OnionShare chat room, they send it to the server through the E2EE onion connection, which then sends it to all other members of the chat room using WebSockets, through their E2EE onion connections.
ga: Toisc go mbraitheann OnionShare ar sheirbhísí oinniúin Tor, tá naisc idir Brabhsálaí Tor agus OnionShare criptithe ó cheann go ceann (E2EE). Nuair a phostálann duine éigin teachtaireacht chuig seomra comhrá OnionShare, seolann siad chuig an bhfreastalaí é tríd an nasc oinniún E2EE, a sheolann ansin chuig gach ball eile den seomra comhrá ag baint úsáide as WebSockets, trína naisc oinniún E2EE.
ta: வெங்காயர் டோர் வெங்காய சேவைகளை நம்பியிருப்பதால், டோர் உலாவி மற்றும் வெங்காயர் ஆகியவற்றுக்கு இடையேயான தொடர்புகள் அனைத்தும் இறுதி முதல் இறுதி மறைகுறியாக்கப்பட்டவை (E2EE). யாரோ ஒரு வெங்காய அரட்டை அறைக்கு ஒரு செய்தியை இடுகையிடும்போது, அவர்கள் அதை E2EE வெங்காய இணைப்பு மூலம் சேவையகத்திற்கு அனுப்புகிறார்கள், பின்னர் அதை தங்கள் E2EE வெங்காய இணைப்புகள் மூலம் வெப்சாக்கெட்டுகளைப் பயன்படுத்தி அரட்டை அறையின் மற்ற அனைத்து உறுப்பினர்களுக்கும் அனுப்புகிறார்கள்.

source: OnionShare doesn't implement any chat encryption on its own. It relies on the Tor onion service's encryption instead.
ga: Ní chuireann OnionShare aon chriptiú comhrá i bhfeidhm leis féin. Braitheann sé ar chriptiú na seirbhíse oinniúin Tor ina ionad sin.
ta: வெங்காயர் எந்த அரட்டை குறியாக்கத்தையும் சொந்தமாக செயல்படுத்தவில்லை. இது அதற்கு பதிலாக டோர் வெங்காய சேவையின் குறியாக்கத்தை நம்பியுள்ளது.
