Repository: onionshare/onionshare
Catalog: docs/source/locale/*/LC_MESSAGES/features.po
Languages: ga, ta

source: How OnionShare Works
ga: Conas a Oibríonn OnionShare
ta: வெங்காயம் எவ்வாறு செயல்படுகிறது

source: Web servers are started locally on your computer and made accessible to other people as `Tor <https://www.torproject.org/>`_ `onion services <https://community.torproject.org/onion-services/>`_.
ga: Tosaítear freastalaithe gréasáin go háitiúil ar do ríomhaire agus cuirtear ar fáil do dhaoine eile iad mar `Tor <https://www.torproject.org/>`_`onion services <https://community.torproject.org/onion-services/> `_.
ta: வலை சேவையகங்கள் உங்கள் கணினியில் உள்நாட்டில் தொடங்கப்படுகின்றன, மேலும் `tor <https://www.torproject.org/>` _ `வெங்காய சேவைகள் <https://community.torproject.org/onion-services/> `_.

source: By default, OnionShare web addresses are protected with a private key.
ga: De réir réamhshocraithe, cosnaítear seoltaí gréasáin OnionShare le heochair phríobháideach.
ta: இயல்பாக, வெங்காய வலை முகவரிகள் ஒரு தனிப்பட்ட விசையுடன் பாதுகாக்கப்படுகின்றன.

source: OnionShare addresses look something like this::
ga: Breathnaíonn seoltaí OnionShare rud éigin mar seo::
ta: வெங்காயக் முகவரிகள் இதுபோன்றதாகத் தெரிகிறது ::

source: And private keys might look something like this::
ga: Agus b’fhéidir go bhfeicfeadh eochracha príobháideacha rud éigin mar seo::
ta: தனிப்பட்ட விசைகள் இதுபோன்றதாகத் தோன்றலாம் ::

source: You're responsible for securely sharing that URL and private key using a communication channel of your choice like in an encrypted chat message, or using something less secure like unencrypted email, depending on your `threat model <https://ssd.eff.org/module/your-security-plan>`_.
ga: Tá tú freagrach as an URL agus an eochair phríobháideach sin a roinnt go slán trí úsáid a bhaint as cainéal cumarsáide de do rogha féin mar atá i dteachtaireacht chomhrá criptithe, nó as rud éigin nach bhfuil chomh slán sin cosúil le ríomhphost neamhchriptithe a úsáid, ag brath ar do mhúnla `bagairt <https://ssd.eff. org/module/your-security-plan>`_.
ta: உங்கள் `அச்சுறுத்தல் மாதிரி <https://ssd.eff.org/module/your-security-plan>`_ ஐப் பொறுத்து, மறைகுறியாக்கப்பட்ட அரட்டை செய்தியைப் போன்ற உங்கள் விருப்பப்படி ஒரு தகவல்தொடர்பு சேனலைப் பயன்படுத்தி அல்லது மறைகுறியாக்கப்படாத மின்னஞ்சலைப் போலக் குறைவான பாதுகாப்பான ஒன்றைப் பயன்படுத்துவதன் மூலம் அந்த முகவரி மற்றும் தனிப்பட்ட விசையைப் பாதுகாப்பாகப் பகிர்வதற்கு நீங்கள் பொறுப்பு.

source: The people you send the URL to then copy and paste it into their `Tor Browser <https://www.torproject.org/>`_ to access the OnionShare service. Tor Browser will then prompt for the private key, which the people can also then copy and paste in.
ga: Ansin déanann na daoine a sheolann tú an URL chucu é a chóipeáil agus a ghreamú isteach ina `Brabhsálaí Tor <https://www.torproject.org/>`_ chun rochtain a fháil ar an tseirbhís OnionShare. Tabharfaidh Brabhsálaí Tor leid ansin don eochair phríobháideach, ar féidir le daoine a chóipeáil agus a ghreamú isteach ansin freisin.
ta: நீங்கள் முகவரி ஐ அனுப்பும் நபர்கள் பின்னர் அதை நகலெடுத்து தங்கள் `டோர் உலாவியில் ஒட்டவும் <https://www.torproject.org/>` _ `வெங்காய சேவையை அணுகலாம். டோர் உலாவி பின்னர் தனியார் விசையைத் தூண்டுகிறது, பின்னர் மக்கள் நகலெடுத்து ஒட்டலாம்.

source: If you run OnionShare on your laptop to send someone files, and then suspend it before the files are sent, the service will not be available until your laptop is unsuspended and on the internet again. OnionShare works best when working with people in real-time.
ga: Má ritheann tú OnionShare ar do ríomhaire glúine chun comhaid a sheoladh chuig duine éigin, agus ansin é a chur ar fionraí sula seoltar na comhaid, ní bheidh an tseirbhís ar fáil go dtí go mbeidh do ríomhaire glúine gan fionraí agus ar an idirlíon arís. Is fearr a oibríonn OnionShare agus iad ag obair le daoine i bhfíor-am.
ta: ஒருவரின் கோப்புகளை அனுப்ப உங்கள் மடிக்கணினியில் வெங்காயத்தை இயக்கினால், கோப்புகள் அனுப்பப்படுவதற்கு முன்பு அதை இடைநீக்கம் செய்தால், உங்கள் மடிக்கணினி சந்தேகத்திற்கு இடமின்றி மீண்டும் இணையத்தில் பணி கிடைக்காது. நிகழ்நேர மக்களுடன் பணிபுரியும் போது வெங்காயம் சிறப்பாக செயல்படுகிறது.

source: Because your own computer is the web server, *no third party can access anything that happens in OnionShare*, not even the developers of OnionShare. It's completely private. And because OnionShare is based on Tor onion services too, it also protects your anonymity. See the :doc:`security design </security>` for more info.
ga: Toisc gurb é do ríomhaire féin an freastalaí gréasáin, *ní féidir le tríú páirtí teacht ar aon rud a tharlaíonn in OnionShare*, ná fiú d’fhorbróirí OnionShare. Tá sé go hiomlán príobháideach. Agus toisc go bhfuil OnionShare bunaithe ar sheirbhísí oinniún Tor freisin, cosnaíonn sé d’ainmfhocal freisin. Féach an :doc:`security design </security>` le haghaidh tuilleadh eolais.
ta: உங்கள் சொந்த கணினி வலை சேவையகமாக இருப்பதால், *வெங்காயத்தில் நடக்கும் எதையும் மூன்றாம் தரப்பினரால் அணுக முடியாது *, வெங்காயத்தின் உருவாக்குபவர்கள் கூட இல்லை. இது முற்றிலும் தனிப்பட்டது. வெங்காயம் டோர் வெங்காய சேவைகளை அடிப்படையாகக் கொண்டிருப்பதால், இது உங்கள் அநாமதேயத்தையும் பாதுகாக்கிறது. மேலும் தகவலுக்கு `பாதுகாப்பு வடிவமைப்பு </security>` ஐப் பார்க்கவும்.

source: Share Files
ga: Comhaid Comhroinn
ta: கோப்புகளைப் பகிரவும்

source: You can use OnionShare to send files and folders to people securely and anonymously. Open a share tab, drag in the files and folders you wish to share, and click "Start sharing".
ga: Is féidir leat OnionShare a úsáid chun comhaid agus fillteáin a sheoladh chuig daoine go sábháilte agus gan ainm. Oscail cluaisín scaireanna, tarraing isteach na comhaid agus na fillteáin is mian leat a roinnt, agus cliceáil "Tosaigh ag roinnt".
ta: கோப்புகள் மற்றும் கோப்புறைகளை மக்களுக்கு பாதுகாப்பாகவும் அநாமதேயமாகவும் அனுப்ப நீங்கள் வெங்காயத்தைப் பயன்படுத்தலாம். ஒரு பகிர்வு தாவலைத் திறந்து, நீங்கள் பகிர விரும்பும் கோப்புகள் மற்றும் கோப்புறைகளில் இழுத்து, "பகிர்வைத் தொடங்கு" என்பதைக் சொடுக்கு செய்க.

source: After you add files, you'll see some settings. Make sure you choose the setting you're interested in before you start sharing.
ga: Tar éis duit comhaid a chur leis, feicfidh tú roinnt socruithe. Cinntigh go roghnaíonn tú an socrú a bhfuil suim agat ann sula dtosaíonn tú ag roinnt.
ta: நீங்கள் கோப்புகளைச் சேர்த்த பிறகு, சில அமைப்புகளைக் காண்பீர்கள். நீங்கள் பகிர்வதைத் தொடங்குவதற்கு முன்பு நீங்கள் விரும்பும் அமைப்பைத் தேர்வுசெய்கிறீர்கள் என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.

source: As soon as someone finishes downloading your files, OnionShare will automatically stop the server, removing the website from the internet. To allow multiple people to download them, uncheck the "Stop sharing after files have been sent (uncheck to allow downloading individual files)" box.
ga: Chomh luath agus a chríochnaíonn duine do chuid comhad a íoslódáil, stopfaidh OnionShare an freastalaí go huathoibríoch, ag baint an tsuímh ghréasáin den idirlíon. Chun gur féidir le daoine iolracha iad a íoslódáil, díthiceáil an bosca "Stop a roinnt tar éis do chomhaid a bheith seolta (díthiceáil chun comhaid aonair a íoslódáil)".
ta: உங்கள் கோப்புகளைப் பதிவிறக்குவதை யாராவது முடித்தவுடன், வெங்காயர் தானாகவே சேவையகத்தை நிறுத்தி, இணையதளத்தை இணையத்திலிருந்து அகற்றுவார். பல நபர்களை பதிவிறக்கம் செய்ய அனுமதிக்க, "கோப்புகள் அனுப்பப்பட்ட பிறகு பகிர்வதை நிறுத்துங்கள் (தனிப்பட்ட கோப்புகளைப் பதிவிறக்குவதை அனுமதிக்க தேர்வு செய்யாதீர்கள்)" பெட்டி.

source: Also, if you uncheck this box, people will be able to download the individual files you share rather than a single compressed version of all the files.
ga: Chomh maith leis sin, má dhíthiceáil tú an bosca seo, beidh daoine in ann na comhaid aonair a roinneann tú a íoslódáil seachas leagan comhbhrúite amháin de na comhaid go léir.
ta: மேலும், இந்த பெட்டியைத் தேர்வுசெய்தால், எல்லா கோப்புகளின் சுருக்கப்பட்ட பதிப்பைக் காட்டிலும் நீங்கள் பகிரும் தனிப்பட்ட கோப்புகளை மக்கள் பதிவிறக்கம் செய்ய முடியும்.

source: When you're ready to share, click the "Start sharing" button. You can always click "Stop sharing", or quit OnionShare, immediately taking the website down. You can also click the "↑" icon in the top-right corner to show the history and progress of people downloading files from you.
ga: Nuair atá tú réidh le roinnt, cliceáil ar an gcnaipe "Tosaigh roinnt". Is féidir leat cliceáil i gcónaí ar "Stop a roinnt", nó scor OnionShare, ag cur an suíomh gréasáin síos láithreach. Is féidir leat freisin cliceáil ar an "↑" icon sa chúinne uachtarach ar dheis a thaispeáint ar an stair agus dul chun cinn na ndaoine a íoslódáil comhaid ó tú.
ta: நீங்கள் பகிரத் தயாராக இருக்கும்போது, "பகிர்வு தொடங்கு" பொத்தானைக் சொடுக்கு செய்க. நீங்கள் எப்போதும் "பகிர்வதை நிறுத்துங்கள்" என்பதைக் சொடுக்கு செய்யலாம் அல்லது வெங்காயத்தை விட்டு வெளியேறலாம், உடனடியாக வலைத்தளத்தை கீழே கொண்டு செல்லலாம். உங்களிடமிருந்து கோப்புகளைப் பதிவிறக்கும் நபர்களின் வரலாறு மற்றும் முன்னேற்றத்தைக் காட்ட மேல்-வலது மூலையில் உள்ள "↑" ஐகானைக் சொடுக்கு செய்யலாம்.

source: Now that you have a OnionShare, copy the address and the private key and send it to the person you want to receive the files. If the files need to stay secure, or the person is otherwise exposed to danger, use an encrypted messaging app.
ga: Anois go bhfuil OnionShare agat, cóipeáil an seoladh agus an eochair phríobháideach agus seol chuig an duine ar mhaith leat na comhaid a fháil. Más gá do na comhaid fanacht slán, nó má tá an duine nochta do chontúirt ar shlí eile, bain úsáid as aip criptithe teachtaireachtaí.
ta: இப்போது உங்களிடம் ஒரு வெங்காயம் உள்ளது, முகவரி மற்றும் தனிப்பட்ட விசையை நகலெடுத்து நீங்கள் கோப்புகளைப் பெற விரும்பும் நபருக்கு அனுப்புங்கள். கோப்புகள் பாதுகாப்பாக இருக்க வேண்டும் என்றால், அல்லது நபர் இல்லையெனில் ஆபத்தை ஏற்படுத்தினால், மறைகுறியாக்கப்பட்ட செய்தியிடல் பயன்பாட்டைப் பயன்படுத்தவும்.

source: That person then must load the address in Tor Browser. After logging in with the private key, the files can be downloaded directly from your computer by clicking the "Download Files" link in the corner.
ga: Caithfidh an duine sin an seoladh a lódáil i mBrabhsálaí Tor ansin. Tar éis logáil isteach leis an eochair phríobháideach, is féidir na comhaid a íoslódáil go díreach ó do ríomhaire trí chliceáil ar an nasc "Comhaid Íoslódáil" sa chúinne.
ta: அந்த நபர் பின்னர் முகவரியை டோர் உலாவியில் ஏற்ற வேண்டும். தனிப்பட்ட விசையுடன் உள்நுழைந்த பிறகு, மூலையில் உள்ள "கோப்புகளைப் பதிவிறக்கு" இணைப்பைக் சொடுக்கு செய்வதன் மூலம் கோப்புகளை உங்கள் கணினியிலிருந்து நேரடியாக பதிவிறக்கம் செய்யலாம்.

source: Receive Files and Messages
ga: Faigh Comhaid agus Teachtaireachtaí
ta: கோப்புகள் மற்றும் செய்திகளைப் பெறுக

source: You can use OnionShare to let people anonymously submit files and messages directly to your computer, essentially turning it into an anonymous dropbox. Open a receive tab and choose the settings that you want.
ga: Is féidir leat OnionShare a úsáid chun ligean do dhaoine comhaid agus teachtaireachtaí a chur isteach go díreach chuig do ríomhaire gan ainm, go bunúsach é a iompú isteach i mbosca titim gan ainm. Oscail cluaisín glactha agus roghnaigh na socruithe atá uait.
ta: கோப்புகளையும் செய்திகளையும் நேரடியாக உங்கள் கணினியில் சமர்ப்பிக்க மக்களை அனுமதிக்க நீங்கள் வெங்காயத்தைப் பயன்படுத்தலாம், அடிப்படையில் அதை அநாமதேய டிராப்பாக்சாக மாற்றலாம். பெறும் தாவலைத் திறந்து நீங்கள் விரும்பும் அமைப்புகளைத் தேர்வுசெய்க.

source: You can browse for a folder to save messages and files that get submitted.
ga: Is féidir leat brabhsáil le haghaidh fillteán chun teachtaireachtaí agus comhaid a chuirtear isteach a shábháil.
ta: சமர்ப்பிக்கப்பட்ட செய்திகளையும் கோப்புகளையும் சேமிக்க ஒரு கோப்புறையை உலாவலாம்.

source: You can check "Disable submitting text" if want to only allow file uploads, and you can check "Disable uploading files" if you want to only allow submitting text messages, like for an anonymous contact form.
ga: Is féidir leat "Díchumasaigh téacs a chur isteach" a sheiceáil más mian leat uaslódála comhaid amháin a cheadú, agus is féidir leat "Díchumasaigh uaslódáil comhaid" a sheiceáil más mian leat gan ach teachtaireachtaí téacs a chur isteach, mar shampla foirm teagmhála gan ainm.
ta: கோப்பு பதிவேற்றங்களை மட்டுமே அனுமதிக்க விரும்பினால் "சமர்ப்பிக்கும் உரையை முடக்கு" என்பதை நீங்கள் சரிபார்க்கலாம், மேலும் அநாமதேய தொடர்பு படிவத்தைப் போலவே, உரைச் செய்திகளையும் சமர்ப்பிக்க மட்டுமே அனுமதிக்க விரும்பினால் "பதிவேற்றும் கோப்புகளை முடக்கு" என்பதை நீங்கள் சரிபார்க்கலாம்.

source: You can check "Use notification webhook" and then choose a webhook URL if you want to be notified when someone submits files or messages to your OnionShare service. If you use this feature, OnionShare will make an HTTP POST request to this URL whenever someone submits files or messages. For example, if you want to get an encrypted text messaging on the messaging app `Keybase <https://keybase.io/>`_, you can start a conversation with `@webhookbot <https://keybase.io/webhookbot>`_, type ``!webhook create onionshare-alerts``, and it will respond with a URL. Use that as the notification webhook URL. If someone uploads a file to your receive mode service, @webhookbot will send you a message on Keybase letting you know as soon as it happens.
ga: Is féidir leat "Úsáid fógrán gréasáin" a sheiceáil agus ansin URL cua gréasáin a roghnú más mian leat go gcuirfí ar an eolas tú nuair a chuireann duine comhaid nó teachtaireachtaí isteach chuig do sheirbhís OnionShare. Má úsáideann tú an ghné seo, déanfaidh OnionShare iarratas POST HTTP chuig an URL seo aon uair a chuireann duine comhaid nó teachtaireachtaí isteach. Mar shampla, más mian leat teachtaireachtaí téacs criptithe a fháil ar an aip teachtaireachtaí `Keybase <https://keybase.io/>`_, is féidir leat comhrá a thosú le `@webhookbot <https://keybase.io/webhookbot >`_, clóscríobh ``!Cruthaigh foláirimh oinniúin``, agus freagróidh sé le URL. Úsáid é sin mar URL an chuaille gréasáin fógra. Má uaslódálann duine éigin comhad chuig do sheirbhís mód glactha, seolfaidh @webhookbot teachtaireacht chugat ar Keybase ag cur in iúl duit a luaithe a tharlaíonn sé.
ta: "அறிவிப்பு வெப்ஊக்கைப் பயன்படுத்து" என்பதைத் தேர்வுசெய்து, உங்கள் வெங்காயப் பகிர்வு சேவையில் யாராவது கோப்புகள் அல்லது செய்திகளைச் சமர்ப்பிக்கும்போது உங்களுக்குத் தெரிவிக்கப்பட வேண்டுமென்றால், ஒரு வெப்ஊக் முகவரியைத் தேர்வுசெய்யலாம். இந்த அம்சத்தைப் பயன்படுத்தினால், யாராவது கோப்புகள் அல்லது செய்திகளைச் சமர்ப்பிக்கும் போதெல்லாம் வெங்காயப் பகிர்வு இந்த முகவரிக்கு உஉபநெ இடுகை கோரிக்கையை அனுப்பும். எடுத்துக்காட்டாக, `Keybase <https://keybase.io/>`_ என்ற செய்தியிடல் பயன்பாட்டில் மறைகுறியாக்கப்பட்ட உரைச் செய்தியைப் பெற விரும்பினால், `@webhookbot <https://keybase.io/webhookbot>`_ உடன் உரையாடலைத் தொடங்கலாம், ``!webhook create onionshare-alerts`` எனத் தட்டச்சு செய்தால், அது ஒரு முகவரியுடன் பதிலளிக்கும். அதை அறிவிப்பு வெப்ஊக் முகவரி ஆகப் பயன்படுத்தவும். யாராவது உங்கள் பெறும் பயன்முறை சேவையில் ஒரு கோப்பைப் பதிவேற்றினால், @webhookbot உங்களுக்கு Keybase இல் ஒரு செய்தியை அனுப்பும், இது நடந்தவுடன் உங்களுக்குத் தெரிவிக்கும்.

source: When you are ready, click "Start Receive Mode". This starts the OnionShare service. Anyone loading this address in their Tor Browser will be able to submit files and messages which get uploaded to your computer.
ga: Nuair atá tú réidh, cliceáil "Start Faigh Mód". Cuireann sé seo tús leis an tseirbhís OnionShare. Beidh duine ar bith atá ag lódáil an seoladh seo ina Bhrabhsálaí Tor in ann comhaid agus teachtaireachtaí a uaslódáil chuig do ríomhaire a chur isteach.
ta: நீங்கள் தயாராக இருக்கும்போது, "பெறு பயன்முறையைத் தொடங்கு" என்பதைக் சொடுக்கு செய்க. இது வெங்காய சேவையைத் தொடங்குகிறது. இந்த முகவரியை தங்கள் TOR உலாவியில் ஏற்றும் எவரும் உங்கள் கணினியில் பதிவேற்றப்படும் கோப்புகளையும் செய்திகளையும் சமர்ப்பிக்க முடியும்.

source: You can also click the down "↓" icon in the top-right corner to show the history and progress of people sending files to you.
ga: Is féidir leat freisin cliceáil ar an síos "↓" icon sa chúinne uachtarach ar dheis a thaispeáint ar an stair agus dul chun cinn na ndaoine comhaid a sheoladh chugat.
ta: உங்களுக்கு கோப்புகளை அனுப்பும் நபர்களின் வரலாறு மற்றும் முன்னேற்றத்தைக் காட்ட மேல்-வலது மூலையில் உள்ள கீழே உள்ள "" ஐகானைக் சொடுக்கு செய்யலாம்.

source: Here is what it looks like for someone sending you files and messages.
ga: Seo an chuma atá air do dhuine a sheolann comhaid agus teachtaireachtaí chugat.
ta: கோப்புகள் மற்றும் செய்திகளை உங்களுக்கு அனுப்பும் ஒருவர் எப்படி இருக்கிறது என்பது இங்கே.

source: When someone submits files or messages to your receive service, by default they get saved to a folder called ``OnionShare`` in the home folder on your computer, automatically organized into separate subfolders based on the time that the files get uploaded.
ga: Nuair a chuireann duine comhaid nó teachtaireachtaí isteach chuig do sheirbhís glactha, de réir réamhshocraithe sábhálfar iad chuig fillteán ar a dtugtar ``OnionShare`` san fhillteán baile ar do ríomhaire, arna eagrú go huathoibríoch i bhfofhillteáin ar leith bunaithe ar an am a n-uaslódáiltear na comhaid.
ta: உங்கள் பெறும் சேவையில் யாராவது கோப்புகள் அல்லது செய்திகளைச் சமர்ப்பிக்கும் போது, இயல்பாகவே அவர்கள் உங்கள் கணினியில் உள்ள வீட்டு கோப்புறையில் `` வெங்காயம்சேர்`` எனப்படும் கோப்புறையில் சேமிக்கப்படுகிறார்கள், கோப்புகள் பதிவேற்றப்பட்ட நேரத்தின் அடிப்படையில் தானாகவே தனி துணை கோப்புறைகளில் ஒழுங்கமைக்கப்படுகின்றன.

source: Setting up an OnionShare receiving service is useful for journalists and others needing to securely accept documents from anonymous sources. When used in this way, OnionShare is sort of like a lightweight, simpler, not quite as secure version of `SecureDrop <https://securedrop.org/>`_, the whistleblower submission system.
ga: Tá sé úsáideach seirbhís glactha OnionShare a bhunú d’iriseoirí agus do dhaoine eile ar gá dóibh glacadh go sábháilte le doiciméid ó fhoinsí anaithnide. Nuair a úsáidtear é ar an mbealach seo, tá OnionShare saghas cosúil le leagan éadrom, níos simplí, nach bhfuil chomh slán de `SecureDrop <https://securedrop.org/>`_, an córas aighneachta sceithire.
ta: ஒரு வெங்காயத்தைப் பெறும் சேவையை அமைப்பது ஊடகவியலாளர்களுக்கும் மற்றவர்களுக்கு அநாமதேய மூலங்களிலிருந்து ஆவணங்களை பாதுகாப்பாக ஏற்றுக்கொள்ள வேண்டிய மற்றவர்களுக்கு பயனுள்ளதாக இருக்கும். இந்த வழியில் பயன்படுத்தப்படும்போது, வெங்காயர் ஒரு இலகுரக, எளிமையானது, `செக்யூர்டு ராப் <https://securedrop.org/>` _, விசில்ப்ளோவர் சமர்ப்பிப்பு அமைப்பின் பாதுகாப்பான பதிப்பைப் போன்றது அல்ல.

source: Use at your own risk
ga: Bain úsáid as ar do phriacal féin
ta: உங்கள் சொந்த ஆபத்தில் பயன்படுத்தவும்

source: Just like with malicious email attachments, it's possible someone could try to attack your computer by uploading a malicious file to your OnionShare service. OnionShare does not add any safety mechanisms to protect your system from malicious files.
ga: Cosúil le ceangaltáin ríomhphoist mailíseacha, d'fhéadfadh duine iarracht a dhéanamh ionsaí a dhéanamh ar do ríomhaire trí chomhad mailíseach a uaslódáil chuig do sheirbhís OnionShare. Ní chuireann OnionShare meicníochtaí sábháilteachta ar bith leis chun do chóras a chosaint ó chomhaid mhailíseacha.
ta: தீங்கிழைக்கும் மின்னஞ்சல் இணைப்புகளைப் போலவே, தீங்கிழைக்கும் கோப்பை உங்கள் வெங்காய சேவையில் பதிவேற்றுவதன் மூலம் யாராவது உங்கள் கணினியைத் தாக்க முயற்சி செய்யலாம். தீங்கிழைக்கும் கோப்புகளிலிருந்து உங்கள் கணினியைப் பாதுகாக்க எந்த பாதுகாப்பு வழிமுறைகளையும் வெங்காயர்சேர் சேர்க்காது.

source: If you receive an Office document or a PDF through OnionShare, you can convert these documents into PDFs that are safe to open using `Dangerzone <https://dangerzone.rocks/>`_. You can also protect yourself when opening untrusted documents by opening them in `Tails <https://tails.boum.org/>`_ or in a `Qubes <https://qubes-os.org/>`_ disposableVM.
ga: Má fhaigheann tú doiciméad Office nó PDF trí OnionShare, is féidir leat na doiciméid seo a thiontú go PDF atá sábháilte le hoscailt ag baint úsáide as `Dangerzone <https://dangerzone.rocks/>`_. Is féidir leat tú féin a chosaint freisin agus doiciméid neamhiontaofa á n-oscailt agat trí iad a oscailt in `Tails <https://tails.boum.org/>`_ nó i `Qubes <https://qubes-os.org/>`_ disposableVM.
ta: நீங்கள் வெங்காயப் பகிர்வுமூலம் ஒரு அலுவலக ஆவணம் அல்லது எஆவ ஐப் பெற்றால், இந்த ஆவணங்களை `ஆபத்து மண்டலத்தைப் <https://dangerzone.rocks/>`_ பயன்படுத்தி திறக்கப் பாதுகாப்பான எஆவகளாக மாற்றலாம். `Tails <https://tails.boum.org/>`_ அல்லது `Qubes <https://qubes-os.org/>`_ disposableVM இல் திறப்பதன் மூலம் நம்பத் தகாத ஆவணங்களைத் திறக்கும்போது உங்களைப் பாதுகாத்துக் கொள்ளலாம்.

source: However, it is always safe to open text messages sent through OnionShare.
ga: Mar sin féin, tá sé sábháilte i gcónaí teachtaireachtaí téacs a sheoltar trí OnionShare a oscailt.
ta: இருப்பினும், வெங்காயம் மூலம் அனுப்பப்பட்ட குறுஞ்செய்திகளைத் திறப்பது எப்போதும் பாதுகாப்பானது.

source: Tips for running a receive service
ga: Leideanna maidir le seirbhís glactha a rith
ta: பெறும் சேவையை இயக்குவதற்கான உதவிக்குறிப்புகள்

source: If you want to host your own anonymous dropbox using OnionShare, it's recommended you do so on a separate, dedicated computer always powered on and connected to the internet, and not on the one you use on a regular basis.
ga: Más mian leat do bhosca anuas gan ainm féin a óstáil ag baint úsáide as OnionShare, moltar duit é sin a dhéanamh ar ríomhaire tiomnaithe ar leith atá i gcónaí faoi thiomáint agus ceangailte leis an idirlíon, agus ní ar an gceann a úsáideann tú go rialta.
ta: வெங்காயத்தைப் பயன்படுத்தி உங்கள் சொந்த அநாமதேய டிராப்பாக்சை நீங்கள் புரவலன் செய்ய விரும்பினால், ஒரு தனி, அர்ப்பணிப்புள்ள கணினியில் எப்போதும் இயங்கும் மற்றும் இணையத்துடன் இணைக்கப்பட்டுள்ளது, நீங்கள் வழக்கமான அடிப்படையில் பயன்படுத்தும் ஒன்றில் அல்ல.

source: If you intend to put the OnionShare address on your website or social media profiles, save the tab (see :ref:`save_tabs`) and run it as a public service (see :ref:`turn_off_private_key`). It's also a good idea to give it a custom title (see :ref:`custom_titles`).
ga: Má tá sé ar intinn agat an seoladh OnionShare a chur ar do shuíomh Gréasáin nó ar do phróifílí meán sóisialta, sábháil an táb (féach : ref:`save_tabs`) agus rith mar sheirbhís phoiblí é (féach : ref:`turn_off_private_key`). Is smaoineamh maith é freisin teideal saincheaptha a thabhairt dó (féach : ref: `custom_titles`).
ta: உங்கள் வலைத்தளம் அல்லது சமூக ஊடக சுயவிவரங்களில் வெங்காய முகவரியை வைக்க நீங்கள் விரும்பினால், தாவலைச் சேமிக்கவும் (பார்க்க: ref: `Save_tabs`) அதை பொது சேவையாக இயக்கவும் (பார்க்க: குறிப்பு:` turn_off_private_key`). தனிப்பயன் தலைப்பைக் கொடுப்பதும் நல்லது (பார்க்க: ref: `Custom_titles`).

source: Other caveats to be aware of in Receive Mode
ga: Uaimheanna eile le bheith feasach orthu sa Mhód Faighte
ta: பெறும் பயன்முறையில் விழிப்புடன் இருக்க வேண்டிய பிற முன்ன்றிவிப்புகள்

source: There are reports that OnionBrowser on iOS devices are unable to upload files to an OnionShare in Receive Mode, when operating in 'Silver' security mode. Try Bronze or Gold to see if you are able to upload a message or a file.
ga: Tá tuairiscí ann nach bhfuil OnionBrowser ar ghléasanna iOS in ann comhaid a uaslódáil chuig OnionShare i Mód Faighte, agus iad ag feidhmiú i mód slándála ‘Silver’. Bain triail as Cré-umha nó Ór le fáil amach an bhfuil tú in ann teachtaireacht nó comhad a uaslódáil.
ta: 'வெள்ளி' பாதுகாப்பு பயன்முறையில் இயங்கும்போது, ஐஓஎஸ் சாதனங்களில் வெங்காயப் பிரவுசர் பெறும் பயன்முறையில் கோப்புகளைப் பதிவேற்ற முடியாது என்ற தகவல்கள் உள்ளன. நீங்கள் ஒரு செய்தியை அல்லது கோப்பை பதிவேற்ற முடியுமா என்று பார்க்க வெண்கல அல்லது தங்கத்தை முயற்சிக்கவும்.

source: Host a Website
ga: Suíomh Gréasáin a óstáil
ta: ஒரு வலைத்தளத்தை புரவலன் செய்யுங்கள்
