Repository: onionshare/onionshare
Catalog: docs/source/locale/*/LC_MESSAGES/help.po
Languages: tr, uk

source: Getting Help
tr: Yardım Alma
uk: Довідка

source: If you need help with OnionShare, please follow the instructions below.
tr: OnionShare ile ilgili yardıma ihtiyacınız varsa, lütfen aşağıdaki talimatları izleyin.
uk: Якщо вам потрібна допомога з OnionShare, виконайте ці настанови.

source: Read this website
tr: Bu web sitesini okuyun
uk: Ознайомтеся з цим вебсайтом

source: This website is full of instructions on how to use OnionShare. Look through all of the sections first to see if it answers your questions.
tr: Bu web sitesi, OnionShare'in nasıl kullanılacağına dair talimatlarla doludur. Sorularınıza cevap verip vermediğini görmek için önce tüm bölümleri gözden geçirin.
uk: Цей вебсайт наповнено настановами щодо користування OnionShare. Спочатку перегляньте всі розділи, щоб дізнатися, чи відповідає він на ваші запитання.

source: Check the GitHub issues
tr: GitHub sorunlarına bakın
uk: Перегляньте наявні проблеми на GitHub

source: If you can't find a solution in this website, please check the `GitHub issues <https://github.com/micahflee/onionshare/issues>`_. It's possible that someone else has encountered the same problem and has either raised it with the developers, or maybe even posted a solution.
tr: Bu web sitesinde bir çözüm bulamazsanız, lütfen `GitHub sorunlarına <https://github.com/micahflee/onionshare/issues>`_ bakın. Bir başkasının aynı sorunla karşılaşması ve bunu geliştiricilere iletmesi, hatta bir çözüm göndermesi mümkündür.
uk: Якщо ви не можете знайти розв'язок на цьому вебсайті, перегляньте `GitHub issues <https://github.com/micahflee/onionshare/issues>`_. Можливо, хтось інший зіткнувся з тією ж проблемою, або запитав про неї у розробників, або, можливо, навіть опублікував розв'язок.

source: Submit an issue yourself
tr: Kendiniz bir sorun gönderin
uk: Поставте своє питання

source: If you can't find a solution to your problem, or you wish to ask a question or suggest a new feature, please `submit an issue <https://github.com/micahflee/onionshare/issues/new>`_. This requires `creating an GitHub account <https://help.github.com/articles/signing-up-for-a-new-github-account/>`_.
tr: Sorununuza bir çözüm bulamazsanız ya da bir soru sormak veya yeni bir özellik önermek istiyorsanız, lütfen `bir sorun gönderin <https://github.com/micahflee/onionshare/issues/new>`_. Bunun için `bir GitHub hesabı oluşturulması <https://help.github.com/articles/signing-up-for-a-new-github-account/>`_ gerekir.
uk: Якщо не можете знайти розв'язання своєї проблеми або хочете поставити питання чи запропонувати нову функцію, будь ласка, `надішліть питання <https://github.com/micahflee/onionshare/issues/new>`_. Для цього потрібно `створити обліковий запис GitHub <https://help.github.com/articles/signing-up-for-a-new-github-account/>`_.

source: Join our Keybase team
tr: Keybase ekibimize katılın
uk: Долучайтесь до нашої команди Keybase

source: See :ref:`collaborating` for instructions on how to join our Keybase team that we use to discuss the project.
tr: Projeyi tartışmak için kullandığımız Keybase ekibimize nasıl katılacağınıza ilişkin talimatlar için :ref:`collaborating` bölümüne bakın.
uk: Перегляньте :ref:`співпрацю`, щоб отримати вказівки щодо приєднання до нашої команди Keybase, яку ми використовуємо для обговорення проєкту.
