Repository: onionshare/onionshare
Catalog: docs/source/locale/*/LC_MESSAGES/install.po
Languages: el, pt, ru

source: Installation
el: Εγκατάσταση
pt: Instalação
ru: Установка

source: Windows or macOS
el: Windows ή macOS
pt: Windows ou MacOs
ru: Windows или macOS

source: You can download OnionShare for Windows and macOS from the `OnionShare website <https://onionshare.org/>`_.
el: Μπορείτε να κάνετε λήψη του OnionShare για Windows και macOS από την ιστοσελίδα `OnionShare <https://onionshare.org/>`_.
pt: Você pode baixar o OnionShare para Windows e macOS no `site do OnionShare <https://onionshare.org/>`_.
ru: Загрузить OnionShare для Windows или macOS можно по ссылке: `OnionShare <https://onionshare.org/>`_.

source: Mobile
el: Κινητό τηλέφωνο
ru: Мобильный

source: You can download OnionShare for Mobile from the follow links
el: Κάντε λήψη του OnionShare για κινητό τηλέφωνο από τους παρακάτω συνδέσμους
ru: Скачать OnionShare для мобильных устройств можно по следующим ссылкам

source: Direct IPA download: https://github.com/onionshare/onionshare-ios/releases
el: Απευθείας λήψη IPA: https://github.com/onionshare/onionshare-ios/releases
ru: Прямая загрузка IPA: https://github.com/onionshare/onionshare-ios/releases

source: Testflight: https://testflight.apple.com/join/ZCJeY65W
ru: Испытательный полет: https://testflight.apple.com/join/ZCJeY65W

source: There are various ways to install OnionShare for Linux, but the recommended way is to use either the `Flatpak <https://flatpak.org/>`_ or the `Snap <https://snapcraft.io/>`_ package. Flatpak and Snapcraft ensure that you'll always use the newest version and run OnionShare inside of a sandbox.
el: Υπάρχουν αρκετοί τρόποι εγκατάστασης του OnionShare σε Linux. Ο προτιμότερος τρόπος είναι η εγκατάσταση μέσω του `Flatpak <https://flatpak.org/>`_ ή του πακέτου `Snap <https://snapcraft.io/>`_. Οι τεχνολογίες Flatpak και Snapcraft διασφαλίζουν ότι χρησιμοποιείται πάντα η νεότερη έκδοση και ότι το OnionShare θα εκτελείται μέσα σε sandbox.
pt: Existem várias maneiras de instalar o OnionShare para Linux, mas a maneira recomendada é usar o pacote `Flatpak <https://flatpak.org/>`_ ou `Snap <https://snapcraft.io/>`_ . Flatpak e Snapcraft garantem que você sempre use a versão mais recente e execute o OnionShare dentro de uma caixa de areia.
ru: Существуют разные способы установки OnionShare на Linux. Рекомендуется использовать такие менеджеры пакетов, как `Flatpak <https://flatpak.org/>`_ или `Snap <https://snapcraft.io/>`_. Их использование гарантирует, что будет произведена установка самой свежей версии OnionShare и что его запуск будет производиться "в песочнице" (в специально выделенной (изолированной) среде для безопасного исполнения компьютерных программ).

source: Snapcraft support is built-in to Ubuntu and Fedora comes with Flatpak support, but which you use is up to you. Both work in all Linux distributions.
el: Η υποστήριξη Snapcraft είναι ενσωματωμένη στα Ubuntu καθώς και το Fedora διατίθεται με υποστήριξη Flatpak, αλλά εξαρτάται από εσάς ποιο θα χρησιμοποιήσετε. Και τα δύο λειτουργούν με όλες τις διανομές Linux.
pt: O suporte ao Snapcraft é integrado ao Ubuntu e o Fedora vem com suporte ao Flatpak, mas o que você usa depende de você. Ambos funcionam em todas as distribuições do Linux.
ru: По умолчанию поддержка Snap предусмотрена дистрибутивами Ubuntu, поддержка Flatpak — дистрибутивами Fedora. Нужно отметить, что окончательный выбор менеджера пакетов остаётся за пользователем, поскольку и тот, и другой работают во всех дистрибутивах Linux.

source: **Install OnionShare using Flatpak**: https://flathub.org/apps/details/org.onionshare.OnionShare
el: **Εγκατάσταση του OnionShare με χρήση του Flatpak**: https://flathub.org/apps/details/org.onionshare.OnionShare
pt: **Instale OnionShare usando Flatpak**: https://flathub.org/apps/details/org.onionshare.OnionShare
ru: **Установка OnionShare c использованием Flatpak**: https://flathub.org/apps/details/org.onionshare.OnionShare

source: **Install OnionShare using Snapcraft**: https://snapcraft.io/onionshare
el: **Εγκατάσταση του OnionShare με χρήση του Snapcraft**: https://snapcraft.io/onionshare
pt: **Instale o OnionShare usando o Snapcraft**: https://snapcraft.io/onionshare
ru: **Установка OnionShare с использованием Snap**: https://snapcraft.io/onionshare

source: You can also download and install PGP-signed ``.flatpak`` or ``.snap`` packages from https://onionshare.org/dist/ if you prefer.
el: Μπορείτε να κάνετε λήψη και εγκατάσταση ενός πακέτου PGP-signed ``.flatpak`` ή ``.snap`` από https://onionshare.org/dist/ εάν επιθυμείτε.
pt: Você também pode baixar e instalar pacotes ``.flatpak`` ou ``.snap`` assinados por PGP em https://onionshare.org/dist/ se preferir.
ru: Также, в случае необходимости, загрузить и установить имеющие цифровую PGP-подпись пакеты ``.flatpak`` или ``.snap`` можно отсюда: https://onionshare.org/dist/.

source: Manual Flatpak Installation
el: Μη αυτόματη εγκατάσταση Flatpak
ru: Ручная установка Flatpak

source: If you'd like to install OnionShare manually with Flatpak using the PGP-signed `single-file bundle <https://docs.flatpak.org/en/latest/single-file-bundles.html>`_, you can do so like this:
el: Αν θέλετε να εγκαταστήσετε το OnionShare χειροκίνητα με το Flatpak χρησιμοποιώντας το υπογεγραμμένο πακέτο αρχείου PGP `<https://docs.flatpak.org/en/latest/single-file-bundles.html>`_, μπορείτε να το κάνετε ως εξής:
ru: Если вы хотите установить OnionShare вручную с помощью Flatpak, используя подписанный PGP `single-file bundle <https://docs.flatpak.org/en/latest/single-file-bundles.html>`_, вы можете сделать это следующим образом:

source: Install Flatpak by following the instructions at https://flatpak.org/setup/.
el: Εγκαταστήστε το Flatpak ακολουθώντας τις οδηγίες στη διεύθυνση https://flatpak.org/setup/.
ru: Установите Flatpak, следуя инструкциям на сайте https://flatpak.org/setup/.

source: Add the Flathub repository by running ``flatpak remote-add --if-not-exists flathub https://flathub.org/repo/flathub.flatpakrepo``. Even though you won't be downloading OnionShare from Flathub, OnionShare depends on some packages that are only available there.
el: Προσθέστε το αποθετήριο Flathub εκτελώντας την εντολή ``flatpak remote-add --if-not-exists flathub https://flathub.org/repo/flathub.flatpakrepo``. Παρόλο που δε θα κατεβάσετε το OnionShare από το Flathub, το OnionShare εξαρτάται από κάποια πακέτα που είναι διαθέσιμα μόνο εκεί.
ru: Добавьте репозиторий Flathub, запустив ``flatpak remote-add --if-not-exists flathub https://flathub.org/repo/flathub.flatpakrepo``. Несмотря на то, что вы не будете загружать OnionShare с Flathub, OnionShare зависит от некоторых пакетов, которые доступны только там.

source: Go to https://onionshare.org/dist/, choose the latest version of OnionShare, and download the ``.flatpak`` and ``.flatpak.asc`` files.
el: Μεταβείτε στο https://onionshare.org/dist/, επιλέξτε την τελευταία έκδοση του OnionShare και κατεβάστε τα αρχεία ``.flatpak`` και ``.flatpak.asc``.
ru: Перейдите на сайт https://onionshare.org/dist/, выберите последнюю версию OnionShare и загрузите файлы ``.flatpak`` и ``.flatpak.asc``.

source: Verify the PGP signature of the ``.flatpak`` file. See :ref:`verifying_sigs` for more info.
el: Επαληθεύστε την υπογραφή PGP του αρχείου ``.flatpak``. Ανατρέξτε στην ενότητα :ref:`verifying_sigs` για περισσότερες πληροφορίες.
ru: Проверка PGP-подписи файла ``.flatpak``. Дополнительную информацию смотрите в :ref:`verifying_sigs`.

source: Install the ``.flatpak`` file by running ``flatpak install OnionShare-VERSION.flatpak``. Replace ``VERSION`` with the version number of the file you downloaded.
el: Εγκαταστήστε το ``.flatpak`` εκτελώντας την εντολή ``flatpak install OnionShare-VERSION.flatpak``. Αντικαταστήστε το ``VERSION`` με τον αριθμό έκδοσης του αρχείου που κατεβάσατε.
ru: Установите файл ``.flatpak``, выполнив команду ``flatpak install OnionShare-VERSION.flatpak``. Замените ``VERSION`` на номер версии загруженного файла.

source: You can run OnionShare with: `flatpak run org.onionshare.OnionShare`.
el: Μπορείτε να τρέξετε το OnionShare με: `flatpak run org.onionshare.OnionShare`.
ru: Запустить OnionShare можно с помощью: `flatpak run org.onionshare.OnionShare`.

source: Manual Snapcraft Installation
el: Μη αυτόματη εγκατάσταση Snapcraft
ru: Руководство по установке Snapcraft

source: If you'd like to install OnionShare manually with Snapcraft using the PGP-signed Snapcraft package, you can do so like this:
el: Αν θέλετε να εγκαταστήσετε το OnionShare χειροκίνητα με το Snapcraft χρησιμοποιώντας το υπογεγραμμένο PGP πακέτο Snapcraft, μπορείτε να το κάνετε ως εξής:
ru: Если вы хотите установить OnionShare вручную с помощью Snapcraft, используя пакет Snapcraft с PGP-подписью, вы можете сделать это следующим образом:

source: Install Snapcraft by following the instructions at https://snapcraft.io/docs/installing-snapd.
el: Εγκαταστήστε το Snapcraft ακολουθώντας τις οδηγίες στη διεύθυνση https://snapcraft.io/docs/installing-snapd.
ru: Установите Snapcraft, следуя инструкциям на сайте https://snapcraft.io/docs/installing-snapd.

source: Go to https://onionshare.org/dist/, choose the latest version of OnionShare, and download the ``.snap`` and ``.snap.asc`` files.
el: Μεταβείτε στη διεύθυνση https://onionshare.org/dist/, επιλέξτε την τελευταία έκδοση του OnionShare και κατεβάστε τα αρχεία ``.snap`` και ``.snap.asc``.
ru: Перейдите на сайт https://onionshare.org/dist/, выберите последнюю версию OnionShare и загрузите файлы ``.snap`` и ``.snap.asc``.

source: Verify the PGP signature of the ``.snap`` file. See :ref:`verifying_sigs` for more info.
el: Επαληθεύστε την υπογραφή PGP του αρχείου ``.snap``. Ανατρέξτε στην ενότητα :ref:`verifying_sigs` για περισσότερες πληροφορίες.
ru: Проверка PGP-подписи файла ``.snap``. Дополнительную информацию см. в :ref:`verifying_sigs`.

source: Install the ``.snap`` file by running ``snap install --dangerous onionshare_VERSION_amd64.snap``. Replace ``VERSION`` with the version number of the file you downloaded. Note that you must use `--dangerous` because the package is not signed by the Snapcraft store, however you did verify its PGP signature, so you know it's legitimate.
el: Εγκαταστήστε το αρχείο ``.snap`` εκτελώντας την εντολή ``snap install --dangerous onionshare_VERSION_amd64.snap``. Αντικαταστήστε το ``VERSION`` με τον αριθμό έκδοσης του αρχείου που κατεβάσατε. Σημειώστε ότι πρέπει να χρησιμοποιήσετε το `--dangerous` επειδή το πακέτο δεν είναι υπογεγραμμένο από το Snapcraft, ωστόσο επαληθεύσατε την υπογραφή PGP, οπότε γνωρίζετε ότι είναι νόμιμο.
ru: Установите файл ``.snap``, выполнив команду ``nap install --dangerous onionshare_VERSION_amd64.snap``. Замените ``VERSION`` на номер версии загруженного файла. Обратите внимание, что вы должны использовать `--dangerous`, потому что пакет не подписан магазином Snapcraft, однако вы проверили его PGP-подпись, поэтому вы знаете, что он легитимный.

source: You can run OnionShare with: `snap run onionshare`.
el: Μπορείτε να εκτελέσετε το OnionShare με: `snap run onionshare`.
ru: Вы можете запустить OnionShare с помощью: `nap run onionshare`.

source: Command-line only
el: Μόνο γραμμή εντολών
pt: Somente linha de comando
ru: Отдельная установка консольной версии

source: You can install just the command-line version of OnionShare on any operating system using the Python package manager ``pip``. :ref:`cli` has more info.
el: Μπορείτε να εγκαταστήσετε μόνο την έκδοση με τη γραμμή εντολών του OnionShare σε οποιοδήποτε λειτουργικό σύστημα χρησιμοποιώντας τον διαχειριστή πακέτων Python ``pip``. Δείτε το :ref:`cli` για περισσότερες πληροφορίες.
pt: Você pode instalar apenas a versão de Linha de Comando do OnionShare em qualquer sistema operacional, usando o gerenciador de pacotes Python ``pip``. :ref:`cli` tem mais informações.
ru: Консольную версию OnionShare можно установить отдельно на любую операционную систему при помощи менеджера пакетов Python ``pip``. Больше информации можно найти по :ref:`cli`.

source: Althought not being officially developed for this platform, OnionShare can also be installed on `FreeBSD <https://freebsd.org/>`_. It's available via its ports collection or as pre-built package. Should you opt to install and use OnionShare on a FreeBSD operating system, please be aware that it's **NOT** officially supported by the OnionShare project.
ru: Несмотря на то, что OnionShare официально не разрабатывался для этой платформы, его можно установить и на `FreeBSD <https://freebsd.org/>`_. Он доступен через коллекцию портов или в виде предварительно собранного пакета. Если вы решите установить и использовать OnionShare на операционной системе FreeBSD, пожалуйста, имейте в виду, что проект OnionShare **НЕ** официально поддерживается.

source: Though not being offered and officially maintained by the OnionShare developers, the FreeBSD packages and ports do fetch and verifies the source codes from the official OnionShare repository (or its official release packages from `PyPI <https://pypi.org/project/onionshare-cli/>`_). Should you wish to check changes related to this platform, please refer to the following resources:
ru: Несмотря на то, что разработчики OnionShare не предлагают и не поддерживают ее официально, пакеты и порты FreeBSD получают и проверяют исходные коды из официального репозитория OnionShare (или ее официальных релизных пакетов из `PyPI <https://pypi.org/project/onionshare-cli/>`_). Если вы хотите проверить изменения, связанные с этой платформой, пожалуйста, обратитесь к следующим ресурсам:

source: Manual pkg Installation
el: Μη αυτόματη εγκατάσταση pkg
ru: Руководство по установке

source: To install the binary package, use ``pkg install pyXY-onionshare``, with ``pyXY`` specifying the version of Python the package was built for. So, in order to install OnionShare for Python 3.9, use::
ru: Чтобы поставить бинарный пакет, используйте ``pkg install pyXY-onionshare``, при этом ``pyXY`` указывает версию Python, для которой был собран пакет. Так, чтобы установить OnionShare для Python 3.9, используйте::

source: There's also a **Command-line only** version of OnionShare available as pre-built package. Replace ``py39-onionshare`` by ``py39-onionshare-cli`` if you want to install that version.
ru: Существует также **версия OnionShare только для командной строки**, доступная в виде предварительно собранного пакета. Замените ``py39-onionshare`` на ``py39-onionshare-cli``, если вы хотите установить эту версию.

source: For additional information and details about the FreeBSD pre-built packages, please refer to its `official Handbook section about pkg <https://docs.freebsd.org/en/books/handbook/ports/#pkgng-intro>`_.
ru: Для получения дополнительной информации и подробностей о предварительно собранных пакетах FreeBSD, пожалуйста, обратитесь к разделу `официального руководства о pkg <https://docs.freebsd.org/en/books/handbook/ports/#pkgng-intro>`_.

source: Manual port Installation
el: Μη αυτόματη εγκατάσταση port
ru: Установка порта вручную

source: To install the FreeBSD port, change directory to the `ports collection <https://freebsd.org/ports/>`_ you must have checked out before and run the following::
ru: Чтобы установить порт FreeBSD, перейдите в каталог `ports collection <https://freebsd.org/ports/>`_, который вы должны были проверить ранее, и выполните следующее::

source: The ports collection also offers a dedicated port for the **Command-line only** version of OnionShare. Replace ``www/onionshare`` by ``www/onionshare-cli`` if you want to install that version.
ru: Коллекция портов также предлагает специальный порт для **Command-line only** версии OnionShare. Замените ``www/onionshare`` на ``www/onionshare-cli``, если вы хотите установить эту версию.

source: For additional information and details about the FreeBSD ports collection, please refer to its `official Handbook section about ports <https://docs.freebsd.org/en/books/handbook/ports/#ports-using>`_.
ru: За дополнительной информацией и подробностями о коллекции портов FreeBSD обращайтесь к разделу `Официального справочника по портам<https://docs.freebsd.org/en/books/handbook/ports/#ports-using>`_.

source: Verifying PGP signatures
el: Επιβεβαίωση υπογραφών PGP
pt: Verificando assinaturas PGP
ru: Проверка подписей PGP

source: You can verify that the package you download is legitimate and hasn't been tampered with by verifying its PGP signature. For Windows and macOS, this step is optional and provides defense in depth: the OnionShare binaries include operating system-specific signatures, and you can just rely on those alone if you'd like.
el: Μπορείτε να επαληθεύσετε ότι το πακέτο που κατεβάσετε είναι νόμιμο και δεν έχει παραβιαστεί, επαληθεύοντας την υπογραφή του PGP. Για Windows και macOS, αυτό το βήμα είναι προαιρετικό και παρέχει άμυνα σε βάθος: τα δυαδικά αρχεία OnionShare περιλαμβάνουν συγκεκριμένες υπογραφές λειτουργικού συστήματος και μπορείτε απλώς να βασιστείτε σε αυτά και μόνο αν θέλετε.
pt: Você pode verificar se o pacote baixado é legítimo e não foi adulterado verificando sua assinatura PGP. Para Windows e macOS, esta etapa é opcional e fornece defesa em profundidade: os binários OnionShare incluem assinaturas específicas do sistema operacional e você pode confiar apenas nelas, se desejar.
ru: Пользователь может произвести проверку целостности самостоятельно загруженных пакетов при помощи цифровой подписи PGP. Это необязательный шаг для операционных систем Windows и macOS, по скольку бинарные файлы OnionShare уже содержат в себе цифровые подписи, специфичные для каждой из этих операционных систем. Тем не менее, возможность такой проверки предусмотрена, в случае если есть необходимость дополнительно удостовериться в безопасности загруженных файлов.

source: Signing key
el: Κλειδί υπογραφής
pt: Chave de assinatura
ru: Ключ подписи

source: Packages are signed by the core developer who is responsible for the particular release. Here is the GPG key information for each of the core developers of OnionShare:
ru: Пакеты подписаны основным разработчиком, который отвечает за конкретный релиз. Вот ключевая информация GPG для каждого из основных разработчиков OnionShare:

source: Micah Lee:
ru: Майка Ли:

source: PGP public key fingerprint ``927F419D7EC82C2F149C1BD1403C2657CD994F73``.
el: Αποτύπωση δημόσιου κλειδιού PGP ``927F419D7EC82C2F149C1BD1403C2657CD994F73``.
ru: Отпечаток открытого ключа PGP ``927F419D7EC82C2F149C1BD1403C2657CD994F73``.

source: You can download Micah's key `from the keys.openpgp.org keyserver <https://keys.openpgp.org/vks/v1/by-fingerprint/927F419D7EC82C2F149C1BD1403C2657CD994F73>`_.
el: Μπορείτε να κατεβάσετε το κλειδί του Micah από το `διακομιστή κλειδιών keys.openpgp.org <https://keys.openpgp.org/vks/v1/by-fingerprint/927F419D7EC82C2F149C1BD1403C2657CD994F73>`_.
ru: Вы можете загрузить ключ Михи с сервера ключей`keys.openpgp.org <https://keys.openpgp.org/vks/v1/by-fingerprint/927F419D7EC82C2F149C1BD1403C2657CD994F73>`_.

source: Saptak Sengupta:
ru: Саптак Сенгупта:

source: PGP public key fingerprint ``2AE3D40A6905C8E4E8ED95ECE46A2B977C14666B``.
el: Αποτύπωση δημόσιου κλειδιού PGP ``2AE3D40A6905C8E4E8ED95ECE46A2B977C14666B``.
ru: Отпечаток открытого ключа PGP ``2AE3D40A6905C8E4E8ED95ECE46A2B977C14666B``.

source: You can download Saptak's key `from the keys.openpgp.org keyserver <https://keys.openpgp.org/vks/v1/by-fingerprint/2AE3D40A6905C8E4E8ED95ECE46A2B977C14666B>`_.
el: Μπορείτε να κατεβάσετε το κλειδί του Saptak από το `διακομιστή κλειδιών keys.openpgp.org <https://keys.openpgp.org/vks/v1/by-fingerprint/2AE3D40A6905C8E4E8ED95ECE46A2B977C14666B>`_.
ru: Вы можете скачать ключ Саптака с сервера ключей `keys.openpgp.org <https://keys.openpgp.org/vks/v1/by-fingerprint/2AE3D40A6905C8E4E8ED95ECE46A2B977C14666B>`_.

source: Miguel Jacq:
ru: Мигель Жак:

source: PGP public key fingerprint ``00AE817C24A10C2540461A9C1D7CDE0234DB458D``.
ru: Отпечаток публичного ключа PGP ``00AE817C24A10C2540461A9C1D7CDE0234DB458D``.

source: You can download Miguel's key `from the keys.openpgp.org keyserver <https://keys.openpgp.org/vks/v1/by-fingerprint/00AE817C24A10C2540461A9C1D7CDE0234DB458D>`_.
ru: Вы можете скачать ключ Мигеля ` с клавиш.openpgp.org keyserver <https://keys.openpgp.org/vks/v1/by-fingerprint/00AE817C24A10C2540461A9C1D7CDE0234DB458D>`_.

source: You must have GnuPG installed to verify signatures. For macOS you probably want `GPGTools <https://gpgtools.org/>`_, and for Windows you probably want `Gpg4win <https://www.gpg4win.org/>`_.
el: Για την επιβεβαίωση υπογραφών θα πρέπει να έχετε εγκατεστημένο το GnuPG. Για macOS χρειάζεστε το `GPGTools <https://gpgtools.org/>`_ και για Windows το `Gpg4win <https://www.gpg4win.org/>`_.
pt: Você deve ter o GnuPG instalado para verificar as assinaturas. Para macOS, você provavelmente queira o `GPGTools <https://gpgtools.org/>`_ e, para Windows, provavelmente queira o `Gpg4win <https://www.gpg4win.org/>`_.
ru: Для проверки цифровых подписей PGP на компьютере пользователя должно быть установлено программное обеспечение GnuPG. Для macOS рекомендуется использовать `GPGTools <https://gpgtools.org/>`_, для Windows `Gpg4win <https://www.gpg4win.org/>`_.

source: Signatures
el: Υπογραφές
pt: Assinaturas
ru: Подписи

source: You can find the signatures (as ``.asc`` files), as well as Windows, macOS, Flatpak, Snap, and source packages, at https://onionshare.org/dist/ in the folders named for each version of OnionShare. You can also find them on the `GitHub Releases page <https://github.com/onionshare/onionshare/releases>`_.
el: Θα βρείτε τις υπογραφές (αρχεία ``.asc``), για Windows, macOS, Flatpak, Snap και αρχεία εγκατάστασης στο https://onionshare.org/dist/ στο φάκελο με όνομα ανάλογο της έκδοσης του OnionShare. Μπορείτε επίσης να τα βρείτε και στη `σελίδα εκδόσεων του GitHub <https://github.com/onionshare/onionshare/releases>`_.
ru: Вы можете найти сигнатуры (в виде файлов ``.asc``), а также пакеты для Windows, macOS, Flatpak, Snap и исходные тексты по адресу https://onionshare.org/dist/ в папках, названных для каждой версии OnionShare. Вы также можете найти их на странице `GitHub Releases <https://github.com/onionshare/onionshare/releases>`_.

source: Verifying
el: Επιβεβαίωση
pt: Verificando
ru: Проверка

source: Once you have imported the core developers public keys into your GnuPG keychain, downloaded the binary and ``.asc`` signature, you can verify the binary in a terminal like this:
ru: После того как вы импортировали открытые ключи разработчиков ядра в свою связку ключей GnuPG, загрузили бинарник и подпись ``.asc``, вы можете проверить бинарник в терминале следующим образом:

source: For Windows::
el: Για Windows::
ru: Для Windows::

source: For macOS::
el: Για macOS::
ru: Для macOS::

source: For Linux::
el: Για Linux::
ru: Для Linux::

source: and for the source file::
el: και για το αρχείο προέλευσης::
ru: и для исходного файла::

source: The expected output looks like this::
el: Θα πρέπει να δείτε κάτι όπως::
pt: A saída esperada se parece com isso::
ru: Ожидаемый результат выполнения команды::

source: If you don't see ``Good signature from``, there might be a problem with the integrity of the file (malicious or otherwise), and you should not install the package.
el: Εάν δεν εμφανιστεί το ``Σωστή υπογραφή από``, ενδέχεται να υπάρχει πρόβλημα με την ακεραιότητα του αρχείου (κακόβουλο ή άλλο) και δεν πρέπει να το εγκαταστήσετε.
ru: Если вы не видите ``Good signature from``, возможно, существует проблема с целостностью файла (вредоносная или иная), и вам не следует устанавливать пакет.
