Repository: onionshare/onionshare
Catalog: docs/source/locale/*/LC_MESSAGES/install.po
Languages: el, pt, ru

source: The ``WARNING:`` shown above, is not a problem with the package, it only means you haven't defined a level of "trust" of Micah's (the core developer) PGP key.
el: Η ``ΠΡΟΕΙΔΟΠΟΙΗΣΗ:`` που φαίνεται παραπάνω, δεν αποτελεί πρόβλημα με το πακέτο, σημαίνει μόνο ότι δεν έχετε ορίσει το επίπεδο "εμπιστοσύνης" του κλειδιού PGP του Micah.
ru: Предупреждение ``WARNING:``, показанное выше, не является проблемой с пакетом, оно лишь означает, что вы не определили уровень "доверия" к PGP-ключу Михи (основного разработчика).

source: If you want to learn more about verifying PGP signatures, the guides for `Qubes OS <https://www.qubes-os.org/security/verifying-signatures/>`_ and the `Tor Project <https://support.torproject.org/tbb/how-to-verify-signature/>`_ may be useful.
el: Εάν θέλετε να μάθετε περισσότερα σχετικά με την επαλήθευση των υπογραφών PGP, οι οδηγοί για `Qubes OS <https://www.qubes-os.org/security/verifying-signatures/>`_ και το `Tor Project <https://support.torproject.org/tbb/how-to-verify-signature/>`_ θα σας φανούν χρήσιμα.
pt: Se você quiser saber mais sobre a verificação de assinaturas PGP, os guias para `Qubes OS <https://www.qubes-os.org/security/verifying-signatures/>`_ e o `Tor Project <https://support .torproject.org/tbb/how-to-verify-signature/>`_ podem ser úteis.
ru: Дополнительную информацию о проверке цифровых подписей PGP можно здесь: `Qubes OS <https://www.qubes-os.org/security/verifying-signatures/>`_ и здесь: `Tor Project <https://support.torproject.org/tbb/how-to-verify-signature/>`_ .

source: Packages are signed by Micah Lee, the core developer, using his PGP public key with fingerprint ``927F419D7EC82C2F149C1BD1403C2657CD994F73``. You can download Micah's key `from the keys.openpgp.org keyserver <https://keys.openpgp.org/vks/v1/by-fingerprint/927F419D7EC82C2F149C1BD1403C2657CD994F73>`_.
pt: Os pacotes são assinados por Micah Lee, o principal desenvolvedor, usando sua chave pública PGP com impressão digital ``927F419D7EC82C2F149C1BD1403C2657CD994F73``. Você pode baixar a chave de Micah `do servidor de chaves keys.openpgp.org <https://keys.openpgp.org/vks/v1/by-fingerprint/927F419D7EC82C2F149C1BD1403C2657CD994F73>`_.

source: You can find the signatures (as ``.asc`` files), as well as Windows, macOS, Flatpak, Snap, and source packages, at https://onionshare.org/dist/ in the folders named for each version of OnionShare. You can also find them on the `GitHub Releases page <https://github.com/micahflee/onionshare/releases>`_.
pt: Você pode encontrar as assinaturas (como arquivos ``.asc``), bem como Windows, macOS, Flatpak, Snap e pacotes de origem, em https://onionshare.org/dist/ nas pastas nomeadas para cada versão do OnionShare. Você também pode encontrá-los na `página de lançamentos do GitHub <https://github.com/micahflee/onionshare/releases>`_.

source: Once you have imported Micah's public key into your GnuPG keychain, downloaded the binary and and ``.asc`` signature, you can verify the binary for macOS in a terminal like this::
pt: Depois de importar a chave pública de Micah para o seu chaveiro GnuPG, baixar o binário e a assinatura ``.asc``, você pode verificar o binário para macOS em um terminal como este::

source: Or for Windows, in a command-prompt like this::
pt: Ou para Windows, em um prompt de comando como este::

source: If you don't see ``Good signature from``, there might be a problem with the integrity of the file (malicious or otherwise), and you should not install the package. (The ``WARNING:`` shown above, is not a problem with the package, it only means you haven't defined a level of "trust" of Micah's (the core developer) PGP key.)
pt: Se você não vir ``Good signature from``, pode haver um problema com a integridade do arquivo (malicioso ou não) e você não deve instalar o pacote. (O ``WARNING:`` mostrado acima, não é um problema com o pacote, significa apenas que você não definiu um nível de "confiança" na chave PGP de Micah (o principal desenvolvedor).
