Repository: onionshare/onionshare
Catalog: docs/source/locale/*/LC_MESSAGES/security.po
Languages: de, es, ga, sk, ta, tr

source: Security design
de: Sicherheits-Design
es: Diseño de seguridad

source: First read :ref:`how_it_works` to understand the basics of how OnionShare works.
de: Lies zuerst :ref:`how_it_works`, um die grundlegende Funktionsweise von OnionShare zu verstehen.
es: Primero lee :ref:`how_it_works` para entender las bases de cómo funciona OnionShare.

source: Like all software, OnionShare may contain bugs or vulnerabilities.
de: Wie jede Software kann OnionShare Fehler oder Sicherheitslücken aufweisen.
es: Como todo software, OnionShare podría contener errores o vulnerabilidades.
ga: Cosúil le gach bogearraí, d’fhéadfadh fabhtanna nó leochaileachtaí a bheith i OnionShare.
sk: Ako každý softvér, aj OnionShare môže obsahovať chyby alebo zraniteľnosti.
ta: எல்லா மென்பொருளையும் போலவே, வெங்காயத்தில் பிழைகள் அல்லது பாதிப்புகள் இருக்கலாம்.
tr: Tüm yazılımlar gibi, OnionShare de hatalar veya güvenlik açıkları içerebilir.

source: What OnionShare protects against
de: Wogegen OnionShare schützt
es: Contra qué protege OnionShare
ga: Cad a chosnaíonn OnionShare ina choinne
sk: Pred čím OnionShare chráni
ta: வெங்காயத்தைப் பாதுகாக்கிறது
tr: OnionShare neye karşı korur

source: **Third parties don't have access to anything that happens in OnionShare.** When you use OnionShare, you host services directly on your computer. For example, when you share files with OnionShare, you don't upload these files to any server, and when you start an OnionShare chat room, your computer is the chat room server itself. Traditional ways of sharing files or setting up websites and chat rooms require trusting a service with access to your data.
de: **Dritte haben keinen Zugriff auf das, was über OnionShare läuft.** Wenn du OnionShare benutzt, hostest du Dienste direkt auf deinem Rechner. Wenn du beispielsweise Dateien über OnionShare freigibst, werden diese Dateien auf keinen Server hochgeladen, und wenn du einen OnionShare-Chatroom startest, wird dein Rechner zum Chatserver. Üblicherweise benötigt man zum Freigeben von Dateien oder zum Hosten von Webseiten und Chatrooms die Dienste von Drittanbietern, denen man vertrauen können muss und die Zugriff auf deine Daten haben.
es: **Ningún tercero tiene acceso a cualquier cosa que pase en OnionShare.** Cuando usas OnionShare, alojas servicios directamente en tu computadora. Por ejemplo, cuando compartes archivos con OnionShare, no los subes a ningún servidor, y cuando inicias un cuarto de charla OnionShare, tu computadora es el servidor del mismo. Las maneras tradicionales de compartir archivos o configurar sitios web y cuartos de charla requieren confiar en un servicio con acceso a tus datos.

source: **Network eavesdroppers can't spy on anything that happens in OnionShare in transit.** Because connections between Tor onion services and Tor Browser are end-to-end encrypted, no network attackers can eavesdrop on what happens in an OnionShare service. If the eavesdropper is positioned on the OnionShare user's end, the Tor Browser user's end, or is a malicious Tor node, they will only see Tor traffic. If the eavesdropper is a malicious rendezvous node used to connect Tor Browser with OnionShare's onion service, the traffic will be encrypted using the onion service key.
de: **Schnüffler im Netzwerk können nicht sehen, was über OnionShare läuft.** Weil Verbindungen zwischen Onion-Diensten und Tor Browser Ende zu Ende verschlüsselt sind, kann ein Angreifer im Netzwerk nicht sehen, was über einen OnionShare-Dienst läuft. Wenn der Schnüffler auf Seite des OnionShare-Nutzers oder des Nutzers des Tor Browser sitzt oder er ein bösartiger Tor-Knoten ist, wird er nur Tor-Netzwerkverkehr sehen. Wenn der Schnüffler ein bösartiger Rendezvous-Knoten ist, über den der Tor Browser mit dem OnionShare-Onion-Dienst verbunden wird, ist der Netzwerkverkehr über den Schlüssel des Onion-Dienstes verschlüsselt.
es: **Quienes estén observando la red no pueden espiar nada de lo que pasa en tránsito en OnionShare.** Debido a que las conexiones entre los servicios onion de Tor y el Navegador Tor están cifradas de extremo a extremo, ningún atacante de red puede espiar qué es lo que pasa en un servicio OnionShare. Si el espía está posicionado en el extremo del usuario de OnionShare, el extremo del usuario del Navegador Tor, o es un nodo Tor malicioso, solamente verá tráfico Tor. Si el espía es un nodo de encuentro malicioso usado para conectar al Navegador Tor con el servicio onion de OnionShare, el tráfico estará cifrado usando la clave del servicio onion.

source: **Anonymity of OnionShare users are protected by Tor.** OnionShare and Tor Browser protect the anonymity of the users. As long as the OnionShare user anonymously communicates the OnionShare address with the Tor Browser users, the Tor Browser users and eavesdroppers can't learn the identity of the OnionShare user.
de: **Die Anonymität der OnionShare-Nutzer wird über Tor geschützt.** OnionShare und Tor Browser schützen die Anonymität ihrer Nutzer. So lange der OnionShare-Nutzer seine OnionShare-Adresse anonym den Nutzern des Tor Browsers mitteilt, können Nutzer des Tor Browsers sowie Schnüffler die Identität des OnionShare-Nutzers nicht herausfinden.
es: **El anonimato de los usuarios de OnionShare está protegido por Tor.** OnionShare y el Navegador Tor protegen el anonimato de los usuarios. En la medida en que el usuario de OnionShare comunique anónimamente la dirección OnionShare con los usuarios del Navegador Tor, ni éstos ni los espías pueden saber la identidad del usuario de OnionShare.
ga: **Tá anaithnideacht úsáideoirí OnionShare cosanta ag Tor.** Cosnaíonn OnionShare agus Brabhsálaí Tor anaithnideacht na n-úsáideoirí. Chomh fada agus a chuireann an t-úsáideoir OnionShare an seoladh OnionShare in iúl go anaithnid le húsáideoirí Bhrabhsálaí Tor, ní féidir le húsáideoirí Brabhsálaí Tor ná le cluasáin aitheantas an úsáideora OnionShare a fhoghlaim.
sk: **Anonymitu používateľov služby OnionShare chráni Tor.** OnionShare a prehliadač Tor Browser chránia anonymitu používateľov. Pokiaľ používateľ služby OnionShare anonymne komunikuje adresu OnionShare s používateľmi prehliadača Tor, používatelia prehliadača Tor a odpočúvači nemôžu zistiť identitu používateľa služby OnionShare.
ta: **வெங்காய பயனர்களின் பெயர் தெரியாதது டோர் மூலம் பாதுகாக்கப்படுகிறது.** வெங்காயர் பயனர் டோர் உலாவிப் பயனர்களுடன் வெங்காய முகவரியை அநாமதேயமாகத் தொடர்பு கொள்ளும் வரை, டோர் உலாவிப் பயனர்கள் மற்றும் ஈவ் டிராப்பர்கள் வெங்காய பயனரின் அடையாளத்தைக் கற்றுக்கொள்ள முடியாது.
tr: **OnionShare kullanıcılarının anonimliği Tor ile korunmaktadır.** OnionShare ve Tor Browser, kullanıcıların anonimliğini korumaktadır. OnionShare kullanıcısı, OnionShare adresini Tor Browser kullanıcılarına anonim olarak ilettiği sürece, Tor Browser kullanıcıları ve dinleyiciler OnionShare kullanıcısının kimliğini öğrenemez.

source: **If an attacker learns about the onion service, they still can't access anything.** There have been attacks against the Tor network that can enumerate onion services. Even if someone discovers the .onion address of an OnionShare onion service, they can't access it without also knowing the service's random password (unless, of course, the OnionShare users chooses to disable the password and make it public). The password is generated by choosing two random words from a list of 6800 words, meaning there are 6800^2, or about 46 million possible password. But they can only make 20 wrong guesses before OnionShare stops the server, preventing brute force attacks against the password.
de: **Falls ein Angreifer einen Onion-Dienst entdeckt, wird er immer noch keinen Zugang zu irgendetwas auf diesem Dienst haben.** Es gab Angriffe auf das Tor-Netwerk, wodurch Onion-Dienste entdeckt wurden. Selbst wenn jemand die .onion-Adresse zu einem OnionShare-Dienst herausfindet, kann er hierauf nicht zugreifen, wenn er nicht auch noch das zufällig erzeugte Passwort kennt (es sei denn, freilich, der OnionShare-Nutzer deaktiviert das Passwort und macht seinen Dienst öffentlich). Das Passwort wird erzeugt, indem zwei zufällige Wörter aus einer Liste mit 6800 Wörtern gewählt werden, d.h. es gibt 6800^2 oder rund 46 Millionen mögliche Passwörter. Ein Angreifer kann allerdings nur 20 falsche Versuche machen, ehe OnionShare den Dienst stoppt und so einen Brute-Force-Angriff verhindert.
es: **Si un atacante sabe acerca del servicio onion, aún así no puede acceder a nada.** Han habido ataques en contra de la red Tor que pueden enumerar servicios onion. Aún si alguien descubre la dirección .onion de un servicio onion de OnionShare, no puede accederla sin conocer también la contraseña aleatoria del servicio (a menos, por supuesto, que el usuario de OnionShare elija deshabilitarla y hacerla pública). La contraseña es generada eligiendo dos palabras aleatorias de una lista de 6800, lo cual significa que hay 6800^2, o cerca de 46 millones de contraseñas posibles. Pero pueden hacer solamente 20 intentos fallidos antes de que OnionShare detenga al servidor, evitando ataques de fuerza bruta en contra de la contraseña.

source: What OnionShare doesn't protect against
de: Wogegen OnionShare nicht schützt
es: Contra qué no protege OnionShare
ga: Rudaí nach dtugann OnionShare cosaint ina aghaidh
sk: Pred čím OnionShare nechráni
ta: வெங்காயம் என்ன பாதுகாக்காது
tr: OnionShare neye karşı korumaz

source: **Communicating the OnionShare address might not be secure.** The OnionShare user is responsible for securely communicating the OnionShare address with people. If they send it insecurely (such as through an email message, and their email is being monitored by an attacker), the eavesdropper will learn that they're using OnionShare. If the attacker loads the address in Tor Browser before the legitimate recipient gets to it, they can access the service. If this risk fits the user's threat model, they must find a more secure way to communicate the address, such as in an encrypted email, chat, or voice call. This isn't necessary in cases where OnionShare is being used for something that isn't secret.
de: **Das Teilen einer OnionShare-Adresse könnte unsicher sein.** Der OnionShare-Nutzer ist dafür verantwortlich, die OnionShare-Adresse auf sicherem Wege mit anderen Leuten zu teilen. Wenn sie es auf unsicherem Wege teilen (beispielsweise per einfacher E-Mail, wenn der E-Mail-Verkehr von einem Angreifer mitgeschnitten wird), wird der Angreifer wissen, dass sie OnionShare benutzen. Wenn der Angreifer die Adresse im Tor Browser öffnet, ehe der beabsichtigte Empfänger sie öffnen kann, hat der Angreifer Zugriff auf den Dienst. Falls dieses Risiko laut Risikomodell besteht, muss ein sichererer Weg zum Teilen der OnionShare-Adresse gefunden werden (z.B. per verschlüsselter E-Mail oder verschlüsseltem Chat, oder per Telefon). Dies ist nicht notwendig, wenn OnionShare für etwas genutzt wird, was ohnehin nicht geheim ist.
es: **Comunicar la dirección de OnionShare podría no ser seguro.** El usuario de OnionShare es responsable de comunicar en forma segura la dirección de OnionShare con las personas. Si lo hace inseguramente (tal como a través de un mensaje de correo electrónico, mientras que éste está siendo monitoreado por un atacante), el espía sabrá que está usando OnionShare. Si el atacante carga la dirección en el Navegador Tor antes que el receptor legítimo lo haga, puede acceder al servicio. Si este riesgo se ajusta al modelo de amenaza del usuario, debe encontrar una manera más segura de comunicar la dirección, tal como en un correo electrónico, charla o llamada de voz cifradas. Esto no es necesario en casos donde OnionShare está siendo usado para algo que no es secreto.

source: **Communicating the OnionShare address might not be anonymous.** While OnionShare and Tor Browser allow for anonymity, if the user wishes to remain anonymous they must take extra steps to ensure this while communicating the OnionShare address. For example, they might need to use Tor to create a new anonymous email or chat account, and only access it over Tor, to use for sharing the address. This isn't necessary in cases where there's no need to protect anonymity, such as co-workers who know each other sharing work documents.
de: **Das Mitteilen der OnionShare-Adresse könnte nicht anonym geschehen.** Während OnionShare und Tor Browser grundsätzlich Anonymität ermöglichen, muss der Nutzer zusätzliche Schritte unternehmen, um beim Teilen der OnionShare-Adresse anonym zu bleiben. Beispielsweise könnte er Tor verwenden, um einen anonymen E-Mail- oder Chat-Account anzulegen, um von dort aus die OnionShare-Adresse zu teilen; auf den Account dürfte er dann nur per Tor zugreifen. Das ist in solchen Fällen nicht notwendig, wo die Anonymität nicht gewahrt werden muss, beispielsweise bei Arbeitskollegen, die sich untereinander kennen und die Arbeitsdokumente teilen möchten.
es: **Comunicar la dirección de OnionShare podría no ser anónimo.** Mientras que OnionShare y el Navegador Tor permiten el anonimato, si el usuario desea permanecer anónimo, debe tomar pasos extra para asegurar esto mientras comunica la dirección de OnionShare. Por ejemplo, podría necesitar usar Tor para crear un nuevo correo electrónico o cuenta de charla anónimos, y accederla solamente sobre Tor, para usarla para compartir la dirección. Esto no es necesario en casos donde no hay necesidad de proteger el anonimato, tales como con colegas que se conocen entre sí, y comparten documentos de trabajo.

source: Security Design
ga: Dearadh Slándála
sk: Bezpečnostný design
ta: பாதுகாப்பு வடிவமைப்பு
tr: Güvenlik Tasarımı

source: Read :ref:`how_it_works` first to get a handle on how OnionShare works.
ga: Léigh : ref: `how_it_works` ar dtús chun eolas a fháil ar an gcaoi a n-oibríonn OnionShare.
sk: Najprv si prečítajte :ref:`how_it_works`, aby ste pochopili, ako OnionShare funguje.
ta: படியுங்கள்: குறிப்பு: `எப்படி_ஐடி_ வொர்க்ச்` முதலில் வெங்காயம்சேர் எவ்வாறு செயல்படுகிறது என்பதற்கான கைப்பிடியைப் பெற.
tr: OnionShare'in nasıl çalıştığını anlamak için önce :ref:`how_it_works` bölümünü okuyun.

source: **Third parties don't have access to anything that happens in OnionShare.** Using OnionShare means hosting services directly on your computer. When sharing your files with OnionShare, they are not uploaded to any third-party server. If you make an OnionShare chat room, your computer acts as a server for that too. This avoids the traditional model of having to trust the computers of others.
ga: **Níl rochtain ag tríú páirtithe ar rud ar bith a tharlaíonn in OnionShare.** Trí OnionShare a úsáid, is féidir seirbhísí a óstáil go díreach ar do ríomhaire. Agus do chuid comhad á roinnt le OnionShare, ní uaslódáiltear iad chuig aon fhreastalaí tríú páirtí. Má dhéanann tú seomra comhrá OnionShare, feidhmíonn do ríomhaire mar fhreastalaí chuige sin freisin. Seachnaíonn sé seo an tsamhail thraidisiúnta a bhaineann le muinín a bheith agat as ríomhairí daoine eile.
sk: **Tretie strany nemajú prístup k ničomu, čo sa deje v službe OnionShare.** Používanie služby OnionShare znamená hosťovanie služieb priamo vo vašom počítači. Pri zdieľaní vašich súborov pomocou služby OnionShare sa tieto súbory nenahrávajú na server tretej strany. Ak vytvoríte diskusnú miestnosť OnionShare, váš počítač funguje ako server aj pre ňu. Toto umožňuje vyhnúť sa tradičnému modelu, pri ktorom je potrebné dôverovať počítačom iných používateľov.
ta: ** வெங்காயத்தில் நடக்கும் எதையும் மூன்றாம் தரப்பினருக்கு அணுகல் இல்லை. ** வெங்காயத்தைப் பயன்படுத்துவது என்பது உங்கள் கணினியில் நேரடியாக சேவைகளை புரவலன் செய்வது. உங்கள் கோப்புகளை வெங்காயவாதியுடன் பகிரும்போது, அவை எந்த மூன்றாம் தரப்பு சேவையகத்திலும் பதிவேற்றப்படாது. நீங்கள் ஒரு வெங்காய அரட்டை அறையை உருவாக்கினால், உங்கள் கணினி அதற்கான சேவையகமாக செயல்படுகிறது. இது மற்றவர்களின் கணினிகளை நம்ப வேண்டிய பாரம்பரிய மாதிரியைத் தவிர்க்கிறது.

source: **Network eavesdroppers can't spy on anything that happens in OnionShare in transit.** The connection between the Tor onion service and Tor Browser is end-to-end encrypted. This means network attackers can't eavesdrop on anything except encrypted Tor traffic. Even if an eavesdropper is a malicious rendezvous node used to connect the Tor Browser with OnionShare's onion service, the traffic is encrypted using the onion service's private key.
ga: **Ní féidir le sceimhleoirí líonra spiaireacht a dhéanamh ar aon rud a tharlaíonn in OnionShare faoi bhealach.** Tá an nasc idir an tseirbhís oinniúin Tor agus Brabhsálaí Tor criptithe ó cheann ceann. Ciallaíonn sé seo nach féidir le hionsaitheoirí líonra cluas a chaitheamh ar rud ar bith seachas trácht criptithe Tor. Fiú más nód rindreála mailíseach é an sceimhleoir a úsáidtear chun Brabhsálaí Tor a nascadh le seirbhís oinniúin OnionShare, déantar an trácht a chriptiú ag baint úsáide as eochair phríobháideach na seirbhíse oinniún.
sk: **Sieťoví odpočúvači nemôžu špehovať nič, čo sa deje v službe OnionShare počas prenosu.** Spojenie medzi službou Tor onion a prehliadačom Tor je od začiatku do konca šifrované. To znamená, že sieťoví útočníci nemôžu odpočúvať nič okrem šifrovanej prevádzky služby Tor. Aj keď je odpočúvačom zneužitý stretávací uzol použitý na prepojenie prehliadača Tor Browser so službou OnionShare onion, prevádzka je šifrovaná pomocou súkromného kľúča služby onion.
ta: **நெட்வொர்க் ஈவ் டிராப்பர்கள் டிரான்சிட்டில் வெங்காயத்தில் நடக்கும் எதையும் உளவு பார்க்க முடியாது** டோர் வெங்காய சேவைக்கும் டோர் உலாவிக்கும் இடையிலான தொடர்பு இறுதி முதல் இறுதி மறைகுறியாக்கப்பட்டுள்ளது. இதன் பொருள் பிணையம் தாக்குபவர்கள் மறைகுறியாக்கப்பட்ட டோர் போக்குவரத்தைத் தவிர வேறு எதையும் கேட்க முடியாது. டோர் உலாவியை வெங்காயத்தின் வெங்காய சேவையுடன் இணைக்கப் பயன்படுத்தப்படும் தீங்கிழைக்கும் ரெண்டெச்வச் முனை ஒரு ஈவ் ட்ரோப்பர் என்றாலும், வெங்காய சேவையின் தனிப்பட்ட விசையைப் பயன்படுத்தி போக்குவரத்து குறியாக்கம் செய்யப்படுகிறது.
tr: **Ağdaki dinleyiciler, aktarım sırasında OnionShare'de meydana gelen hiçbir şeyi gözetleyemez.** Tor onion hizmeti ile Tor Browser arasındaki bağlantı uçtan uca şifrelenmektedir. Bu, ağdaki saldırganların şifrelenmiş Tor trafiği dışında hiçbir şeyi dinleyemeyeceği anlamına gelir. Bu dinleyici, OnionShare'in onion hizmetine bağlamak için Tor Browser kullanan kötü niyetli bir buluşma düğümü olsa bile, trafik onion hizmetinin özel anahtarı kullanılarak şifrelenmektedir.

source: **If an attacker learns about the onion service, they still can't access anything.** Prior attacks against the Tor network to enumerate onion services allowed attackers to discover private ``.onion`` addresses. To access an OnionShare service from its address, the private key used for client authentication must be guessed (unless the service is already made public by turning off the private key -- see :ref:`turn_off_private_key`).
ga: **Má fhaigheann ionsaitheoir amach faoin tseirbhís oinniúin, ní féidir leis rochtain a fháil ar rud ar bith go fóill.** Cheadaigh ionsaithe roimhe seo ar líonra Tor chun seirbhísí oinniúin a áireamh d'ionsaitheoirí seoltaí príobháideacha ``.oinniún`` a aimsiú. Chun rochtain a fháil ar sheirbhís OnionShare óna sheoladh, ní mór an eochair phríobháideach a úsáidtear le haghaidh fíordheimhnithe cliant a thomhas (mura bhfuil an tseirbhís foilsithe cheana féin tríd an eochair phríobháideach a mhúchadh -- féach :ref:`turn_off_private_key`).
sk: **Ak sa útočník dozvie o službe onion, stále nemá k ničomu prístup.** Predchádzajúce útoky na sieť Tor s cieľom vypočítať služby onion umožnili útočníkom zistiť súkromné adresy ``.onion``. Ak by chceli získať prístup k službe OnionShare z jej adresy, musia uhádnuť súkromný kľúč používaný na autentifikáciu klienta (pokiaľ služba už nie je zverejnená vypnutím súkromného kľúča -- pozri :ref:`turn_off_private_key`).
ta: **ஒரு தாக்குபவர் வெங்காய சேவையைப் பற்றி அறிந்தாலும், அவர்களால் எதையும் அணுக முடியாது.** வெங்காய சேவைகளைக் கணக்கிடுவதற்காக டோர் நெட்வொர்க்கிற்கு எதிரான முந்தைய தாக்குதல்கள், தாக்குதல் செய்பவர்கள் தனிப்பட்ட ``.onion`` முகவரிகளைக் கண்டறிய அனுமதித்தன. ஒரு வெங்காய பகிர்வுச் சேவையை அதன் முகவரியிலிருந்து அணுக, கிளையன்ட் அங்கீகாரத்திற்குப் பயன்படுத்தப்படும் தனிப்பட்ட விசையை யூகிக்க வேண்டும் (தனிப்பட்ட விசையை முடக்குவதன் மூலம் சேவை ஏற்கனவே பொதுவில் வெளியிடப்படாவிட்டால் -- பார்க்க :ref:`turn_off_private_key`).

source: **Communicating the OnionShare address and private key might not be secure.** Communicating the OnionShare address to people is the responsibility of the OnionShare user. If sent insecurely (such as through an e-mail message monitored by an attacker), an eavesdropper can tell that OnionShare is being used. Eavesdroppers can access services that are still up by loading their addresses and/or lost key in the Tor Browser. Avoid this by communicating the address securely, via encrypted text message (probably with disappearing messages enabled), encrypted e-mail, or in person. This isn't necessary when using OnionShare for something that isn't secret.
ga: **B’fhéidir nach bhfuil sé slán an seoladh OnionShare agus an eochair phríobháideach a chur in iúl.** Is ar úsáideoir OnionShare atá an fhreagracht seoladh OnionShare a chur in iúl do dhaoine. Má sheoltar é go neamhdhaingean (mar shampla trí theachtaireacht ríomhphoist arna monatóireacht ag ionsaitheoir), is féidir le sceimhleoir a rá go bhfuil OnionShare á úsáid. Is féidir le hEavesdroppers rochtain a fháil ar sheirbhísí atá fós in airde tríd a gcuid seoltaí agus/nó eochair chaillte a lódáil i mBrabhsálaí Tor. Seachain é seo ach an seoladh a chur in iúl go slán, trí theachtaireacht téacs criptithe (is dócha agus teachtaireachtaí atá imithe in imeacht cumasaithe), ríomhphost criptithe, nó go pearsanta. Níl sé seo riachtanach agus OnionShare á úsáid le haghaidh rud éigin nach bhfuil faoi rún.
sk: **Oznámenie adresy OnionShare a súkromného kľúča nemusí byť bezpečná.** Za oznámenie adresy OnionShare ľuďom je zodpovedný používateľ OnionShare. Ak sa pošle nezabezpečeným spôsobom (napríklad prostredníctvom e-mailovej správy monitorovanej útočníkom), odpočúvajúci môže zistiť, že sa používa služba OnionShare. Odpočúvači môžu získať prístup k službám, ktoré sú stále v prevádzke, načítaním ich adries a/alebo strateného kľúča v prehliadači Tor Browser. Vyhnite sa tomu bezpečným oznámením adresy prostredníctvom šifrovanej textovej správy (pravdepodobne so zapnutou funkciou miznutia správ), šifrovaného e-mailu alebo osobne. Nie je to potrebné, ak používate službu OnionShare na niečo, čo nie je tajné.
ta: ** வெங்காயக் முகவரி மற்றும் தனியார் விசையைத் தொடர்புகொள்வது பாதுகாப்பாக இருக்காது. ** வெங்காயவாத முகவரியை மக்களுக்குத் தெரிவிப்பது வெங்காயர் பயனரின் பொறுப்பாகும். பாதுகாப்பற்ற முறையில் அனுப்பப்பட்டால் (தாக்குபவரால் கண்காணிக்கப்படும் ஒரு மின்னஞ்சல் செய்தி போன்றவை), வெங்காயவை பயன்படுத்தப்படுவதாக ஒரு ஈவ்ச் ட்ரோப்பர் சொல்ல முடியும். டோர் உலாவியில் தங்கள் முகவரிகள் மற்றும்/அல்லது இழந்த விசையை ஏற்றுவதன் மூலம் இன்னும் இருக்கும் சேவைகளை eavesdroppers அணுகலாம். குறியாக்கப்பட்ட உரைச் செய்தி (அநேகமாக மறைந்துபோகும் செய்திகளுடன் இயக்கப்பட்டிருக்கலாம்), மறைகுறியாக்கப்பட்ட மின்னஞ்சல் அல்லது நேரில் முகவரியைத் தொடர்புகொள்வதன் மூலம் இதைத் தவிர்க்கவும். இரகசியமில்லாத ஒன்றுக்கு வெங்காயத்தைப் பயன்படுத்தும் போது இது தேவையில்லை.
