Repository: onionshare/onionshare
Catalog: docs/source/locale/*/LC_MESSAGES/security.po
Languages: de, es, ga, sk, ta, tr

source: **Communicating the OnionShare address and private key might not be anonymous.** Extra precaution must be taken to ensure the OnionShare address is communicated anonymously. A new e-mail or chat account, only accessed over Tor, can be used to share the address. This isn't necessary unless anonymity is a goal.
ga: **B’fhéidir nach bhfuil sé anaithnid an seoladh OnionShare agus an eochair phríobháideach a chur in iúl.** Ní mór cúram breise a ghlacadh lena chinntiú go gcuirtear seoladh OnionShare in iúl gan ainm. Is féidir cuntas ríomhphoist nó comhrá nua, nach bhfuil rochtain air ach amháin thar Tor, a úsáid chun an seoladh a roinnt. Níl sé seo riachtanach mura rud é gur sprioc é anaithnideacht.
sk: **Oznámenie adresy OnionShare a súkromného kľúča nemusí byť anonymné.** Je potrebné prijať dodatočné opatrenia, aby sa zabezpečilo, že adresa OnionShare bude oznámená anonymne. Na zdieľanie adresy možno použiť nový e-mailový alebo diskusný účet, ku ktorému sa pristupuje len cez Tor. Nie je to potrebné, ak nie je cieľom anonymita.
ta: **வெங்காயப் பகிர்வு முகவரி மற்றும் தனிப்பட்ட விசையைத் தொடர்புகொள்வது அநாமதேயமாக இருக்காது.** வெங்காயப் பகிர்வு முகவரி அநாமதேயமாகத் தொடர்பு கொள்ளப்படுவதை உறுதிசெய்யக் கூடுதல் முன்னெச்சரிக்கை எடுக்கப்பட வேண்டும். டோர் வழியாக மட்டுமே அணுகக்கூடிய ஒரு புதிய மின்னஞ்சல் அல்லது அரட்டைக் கணக்கைப் பயன்படுத்தி முகவரியைப் பகிரலாம். பெயர் தெரியாதது ஒரு குறிக்கோளாக இல்லாவிட்டால் இது தேவையில்லை.

source: **Third parties don't have access to anything that happens in OnionShare.** Using OnionShare means hosting services directly on your computer. When sharing files with OnionShare, they are not uploaded to any server. If you make an OnionShare chat room, your computer acts as a server for that too. This avoids the traditional model of having to trust the computers of others.
tr: **Üçüncü tarafların OnionShare'de olan hiçbir şeye erişimi yoktur.** OnionShare kullanmak, hizmetlerin doğrudan bilgisayarınızda barındırılması anlamına gelir. Dosyaları OnionShare ile paylaşırken, herhangi bir sunucuya yüklenmezler. Bir OnionShare sohbet odası oluşturursanız, bilgisayarınız bunun için de bir sunucu görevi görür. Bu, geleneksel başkalarının bilgisayarlarına güvenmek zorunda kalma modelini ortadan kaldırır.

source: **If an attacker learns about the onion service, it still can't access anything.** Prior attacks against the Tor network to enumerate onion services allowed the attacker to discover private .onion addresses. If an attack discovers a private OnionShare address, a password will be prevent them from accessing it (unless the OnionShare user chooses to turn it off and make it public). The password is generated by choosing two random words from a list of 6800 words, making 6800², or about 46 million possible passwords. Only 20 wrong guesses can be made before OnionShare stops the server, preventing brute force attacks against the password.
tr: **Bir saldırgan onion hizmetini öğrense bile hiçbir şeye erişemez.** Onion hizmetlerini numaralandırmak için Tor ağına yapılan önceki saldırılar, saldırganın özel .onion adreslerini keşfetmesine izin verdi. Saldırı, özel bir OnionShare adresini keşfederse, bir parola bu adrese erişmesini engelleyecektir (OnionShare kullanıcısı bunu kapatmayı ve herkese açık hale getirmeyi seçmediği sürece). Parola, 6800 sözcükten oluşan bir listeden rastgele iki sözcük seçilerek, yani 6800² veya yaklaşık 46 milyon olası parola arasından oluşturulur. Parolaya yönelik kaba kuvvet saldırılarını önlemek için OnionShare sunucuyu durdurmadan önce yalnızca 20 yanlış tahmin yapılabilir.

source: **Communicating the OnionShare address might not be secure.** Communicating the OnionShare address to people is the responsibility of the OnionShare user. If sent insecurely (such as through an email message monitored by an attacker), an eavesdropper can tell that OnionShare is being used. If the eavesdropper loads the address in Tor Browser while the service is still up, they can access it. To avoid this, the address must be communicateed securely, via encrypted text message (probably with disappearing messages enabled), encrypted email, or in person. This isn't necessary when using OnionShare for something that isn't secret.
tr: **OnionShare adresinin iletilmesi güvenli olmayabilir.** OnionShare adresini kişilere iletmek, OnionShare kullanıcısının sorumluluğundadır. Güvenli olmayan bir şekilde gönderilirse (örneğin, bir saldırgan tarafından izlenen bir e-posta mesajı yoluyla), dinleyen biri OnionShare'in kullanıldığını öğrenebilir. Dinleyici, hizmet hala açıkken adresi Tor Browser'da açarsa, ona erişebilir. Bundan kaçınmak için adresin güvenli bir şekilde; şifreli metin mesajı (muhtemelen kaybolan mesajlar etkinleştirilmiş), şifrelenmiş e-posta yoluyla veya şahsen iletilmesi gerekmektedir. Gizli olmayan bir şey için OnionShare kullanırken bu gerekli değildir.

source: **Communicating the OnionShare address might not be anonymous.** Extra precautions must be taken to ensure the OnionShare address is communicated anonymously. A new email or chat account, only accessed over Tor, can be used to share the address. This isn't necessary unless anonymity is a goal.
tr: **OnionShare adresinin iletilmesi anonim olmayabilir.** OnionShare adresinin anonim olarak iletilmesini sağlamak için ek önlemler alınmalıdır. Adresi paylaşmak için yalnızca Tor üzerinden erişilen yeni bir e-posta veya sohbet hesabı kullanılabilir. Anonimlik bir amaç olmadığı sürece bu gerekli değildir.
