Repository: onionshare/onionshare
Catalog: docs/source/locale/*/LC_MESSAGES/tor.po
Languages: ga, sv

source: Connecting to Tor
ga: Ag nascadh le Tor
sv: Ansluta till Tor

source: When OnionShare starts, it will show you a screen asking you to connect to the Tor network.
ga: Nuair a thosaíonn OnionShare, taispeánfaidh sé scáileán duit ag iarraidh ort ceangal le líonra Tor.
sv: När OnionShare startar visas en skärm som ber dig ansluta till Tor-nätverket.

source: You can toggle on the switch "Connect to Tor automatically" before clicking "Connect to Tor". This means that next time OnionShare starts, it will automatically connect with its Tor connection settings from the last session, instead of presenting you with the connection options. If the connection fails, you can still try bridges or reconfigure Tor via the "Network Settings" button.
ga: Is féidir leat scoránaigh ar an lasc "Ceangail le Tor go huathoibríoch" roimh "Ceangail le Tor" a chliceáil. Ciallaíonn sé seo an chéad uair eile a thosaíonn OnionShare, nascfaidh sé go huathoibríoch lena shocruithe nasc Tor ón seisiún deireanach, in ionad na roghanna ceangail a chur i láthair duit. Má theipeann ar an nasc, is féidir leat droichid a thriail go fóill nó Tor a athchumrú tríd an gcnaipe "Socruithe Líonra".
sv: Du kan aktivera "Anslut till Tor automatiskt" innan du klickar på "Anslut till Tor". Det betyder att nästa gång OnionShare startar kommer den automatiskt att ansluta med sina Tor-anslutningsinställningar från den senaste sessionen, istället för att visa anslutningsalternativen. Om anslutningen misslyckas kan du fortfarande prova broar eller konfigurera om Tor via knappen "Nätverksinställningar".

source: You can click "Connect to Tor" to begin the connection process. If there are no problems with your network, including any attempts to block your access to the Tor network, this should hopefully work the first time.
ga: Is féidir leat "Ceangail le Tor" a chliceáil chun tús a chur leis an bpróiseas nasctha. Mura bhfuil fadhbanna ar bith le do líonra, lena n-áirítear aon iarrachtaí chun rochtain ar líonra Tor a bhlocáil, tá súil againn go n-oibreoidh sé seo den chéad uair.
sv: Du kan klicka på "Anslut till Tor" för att starta anslutningsprocessen. Om det inte finns några problem med ditt nätverk, inklusive försök att blockera din åtkomst till Tor-nätverket, borde detta förhoppningsvis fungera första gången.

source: Or, if you want to manually configure Bridges or other Tor settings before you connect, you can click "Network Settings".
ga: Nó, más mian leat Droichid nó socruithe Tor eile a chumrú de láimh sula ndéanann tú ceangal, is féidir leat "Socruithe Líonra" a chliceáil.
sv: Eller, om du vill konfigurera broar eller andra Tor-inställningar manuellt innan du ansluter, kan du klicka på "Nätverksinställningar".

source: Automatic censorship circumvention
ga: Imchéimniú cinsireachta uathoibríoch
sv: Automatisk kringgående av censur

source: When you click "Connect to Tor", if OnionShare fails to connect, it might be because Tor is censored in your country or on your local network.
ga: Nuair a chliceálann tú "Ceangail le Tor", má theipeann ar OnionShare ceangal a dhéanamh, d'fhéadfadh sé tarlú go bhfuil Tor cinsireachta i do thír féin nó ar do líonra áitiúil.
sv: Om OnionShare inte kan ansluta när du klickar på "Anslut till Tor", kan det bero på att Tor är censurerat i ditt land eller på ditt lokala nätverk.

source: If this occurs, you will have these choices:
ga: Má tharlaíonn sé seo, beidh na roghanna seo agat:
sv: Om detta inträffar har du dessa val:

source: Try again without a bridge
ga: Bain triail eile as gan droichead
sv: Försök igen utan en bro

source: Automatically determine my country from my IP address for bridge settings
ga: Cinntigh go huathoibríoch mo thír ó mo sheoladh IP le haghaidh socruithe droichead
sv: Bestäm automatiskt mitt land från min IP-adress för broinställningar

source: Manually select my country for bridge settings
ga: Roghnaigh mo thír de láimh le haghaidh socruithe droichead
sv: Välj mitt land manuellt för broinställningar

source: If you choose the "Try again without a bridge" option, OnionShare will retry connecting to Tor like normal, without attempting to bypass censorship.
ga: Má roghnaíonn tú an rogha "Bain triail eile as gan droichead", bainfidh OnionShare triail eile as nascadh le Tor mar is gnách, gan iarracht a dhéanamh an chinsireacht a sheachbhóthar.
sv: Om du väljer alternativet "Försök igen utan bro" kommer OnionShare att försöka ansluta till Tor igen som vanligt, utan att försöka kringgå censuren.

source: The other two options will attempt to automatically bypass censorship using Tor bridges. If your network provider is blocking access to the Tor network, you can hopefully still connect to a Tor bridge, which will then connect you to the Tor network, circumventing the censorship. Both of these options use the Tor Project's Censorship Circumvention API to provide you with bridge settings that should work for you. OnionShare will temporarily use the `Meek <https://gitlab.torproject.org/legacy/trac/-/wikis/doc/meek/>`_ domain-fronting proxy to make a non-Tor connection from your computer to Tor's Censorship Circumvention API. The Meek proxy hides the fact that you are trying to find a way to connect to Tor.
ga: Déanfaidh an dá rogha eile iarracht an chinsireacht a sheachbhóthar go huathoibríoch ag baint úsáide as droichid Tor. Má tá do sholáthraí líonra ag cur bac ar rochtain ar líonra Tor, tá súil againn go mbeidh tú fós in ann nascadh le droichead Tor, a nascfaidh ansin le líonra Tor tú, ag dul timpeall ar an gcinsireacht. Baineann an dá rogha seo úsáid as API Circumvention Censorship Project Tor chun socruithe droichid a sholáthar duit ar cheart dóibh oibriú duit. Úsáidfidh OnionShare an seachfhreastalaí `Meek <https://gitlab.torproject.org/legacy/trac/-/wikis/doc/meek/>`_ chun nasc neamh-Tor a dhéanamh ó do ríomhaire le Cinsireacht Tor Circumvention API. Cuireann an seachfhreastalaí Meek i bhfolach go bhfuil tú ag iarraidh bealach a aimsiú chun ceangal le Tor.
sv: De andra två alternativen försöker automatiskt kringgå censur med hjälp av Tor-broar. Om din nätverksleverantör blockerar åtkomst till Tor-nätverket kan du förhoppningsvis fortfarande ansluta till en Tor-bro, som sedan ansluter dig till Tor-nätverket och kringgår censuren. Båda dessa alternativ använder Tor Projects Censorship Circumvention API för att förse dig med bryoinställningar som borde fungera för dig. OnionShare kommer tillfälligt att använda `Meek <https://gitlab.torproject.org/legacy/trac/-/wikis/doc/meek/>`_ domänfrontproxyn för att skapa en icke-Tor-anslutning från din dator till Tors Censorship Circumvention API. Meek-proxyn döljer det faktum att du försöker hitta ett sätt att ansluta till Tor.

source: If you choose "Automatically determine my country from my IP address for bridge settings", the Censorship Circumvention API will consider your IP address (yes, your real IP address) to determine what country you might reside in. Based on the country information, the API will try to automatically find bridges that suit your location.
ga: Má roghnaíonn tú "Mo thír a chinneadh go huathoibríoch ó mo sheoladh IP le haghaidh socruithe droichead", breithneoidh an Censorship Circumvention API do sheoladh IP (tá, do sheoladh IP fíor) chun a chinneadh cén tír ina bhfuil tú i do chónaí. Bunaithe ar an bhfaisnéis faoin tír, an Déanfaidh API iarracht droichid a oireann do do shuíomh a aimsiú go huathoibríoch.
sv: Om du väljer "Bestäm mitt land automatiskt från min IP-adress för broinställningar" kommer Censorship Circumvention API att ta hänsyn till din IP-adress (ja, din riktiga IP-adress) för att avgöra vilket land du kan tänkas bo i. Baserat på landsinformationen kommer API:et att försöka automatiskt hitta bro som passar din plats.

source: If you choose "Manually select my country for bridge settings", the Censorship API will find the bridges that suit the country that you specified.
ga: Má roghnaíonn tú "Roghnaigh de láimh mo thír le haghaidh socruithe droichead", gheobhaidh an API Cinsireachta na droichid a oireann don tír a shonraigh tú.
sv: Om du väljer "Välj mitt land manuellt för broinställningar" kommer Censur-API:et att hitta de broar som passar det land du angav.

source: How automatic censorship circumvention works
ga: Conas a oibríonn imchéimniú cinsireachta uathoibríoch
sv: Hur automatisk censurkringgång fungerar

source: If the Censorship Circumvention API finds bridges that it believes will suit you, OnionShare will try to reconnect to Tor using those bridges. If the API does not find any bridges for your location, OnionShare will ask the API for "fallback" options, and then try to reconnect using those.
ga: Má aimsíonn an Censorship Circumvention API droichid a chreideann sé a oireann duit, déanfaidh OnionShare iarracht athcheangal le Tor ag baint úsáide as na droichid sin. Mura bhfaighidh an API droichid ar bith do do shuíomh, iarrfaidh OnionShare roghanna "backback" ar an API, agus ansin déanfaidh sé iarracht iad sin a athcheangal.
sv: Om Censorship Circumvention API hittar broar som den tror passar dig, kommer OnionShare att försöka återansluta till Tor med hjälp av dessa broar. Om API:et inte hittar några broar för din plats, kommer OnionShare att be API:et om "reserv"-alternativ och sedan försöka återansluta med hjälp av dessa.

source: If for some reason OnionShare fails to connect to the Censorship API itself, or if the API returns an error message, OnionShare will attempt to use the obfs4 built-in bridges.
ga: Más rud é ar chúis éigin nach ndéanann OnionShare ceangal leis an API Cinsireachta féin, nó má sheolann an API teachtaireacht earráide ar ais, déanfaidh OnionShare iarracht na droichid obfs4 ionsuite a úsáid.
sv: Om OnionShare av någon anledning inte kan ansluta till själva Censur-API:et, eller om API:et returnerar ett felmeddelande, kommer OnionShare att försöka använda de inbyggda broarna i obfs4.

source: It's important to note that the requests to the Censorship Circumvention API do not go over the Tor network (because if you could connect to Tor already, you wouldn't need to connect to the API).
ga: Tá sé tábhachtach a thabhairt faoi deara nach dtéann na hiarratais chuig an Censorship Circumvention API thar líonra Tor (mar dá bhféadfá nascadh le Tor cheana féin, ní bheadh ort ceangal leis an API).
sv: Det är viktigt att notera att förfrågningarna till Censorship Circumvention API inte går över Tor-nätverket (eftersom om du redan kunde ansluta till Tor skulle du inte behöva ansluta till API:et).

source: Even though it's hard for an adversary to discover where the Meek request is going, this may still be risky for some users. Therefore, it is an opt-in feature. The use of Meek and non-torified network requests are limited only to making one or two requests to the Censorship Circumvention API. Then Meek is stopped, and all further network requests happen over the Tor network.
ga: Cé go bhfuil sé deacair ag namhaid a fháil amach cá bhfuil an t-iarratas Meek ag dul, d'fhéadfadh sé seo a bheith contúirteach do roinnt úsáideoirí. Mar sin, is gné rogha an diúltaithe é. Tá úsáid iarratais líonra Meek agus neamh-thorified teoranta ach amháin chun iarratas nó dhó a dhéanamh ar an Censorship Circumvention API. Stoptar Meek ansin, agus tarlaíonn gach iarratas líonra breise thar líonra Tor.
sv: Även om det är svårt för en motståndare att upptäcka vart Meek-förfrågan tar vägen, kan detta fortfarande vara riskabelt för vissa användare. Därför är det en funktion man väljer att delta i. Användningen av Meek och icke-torifierade nätverksförfrågningar är begränsad till att göra en eller två förfrågningar till Censorship Circumvention API. Sedan stoppas Meek, och alla ytterligare nätverksförfrågningar sker över Tor-nätverket.

source: If you are uncomfortable with making a request that doesn't go over the Tor network, you can click "Network Settings" (or the Settings icon in the bottom right corner, followed by the Tor Settings tab in the screen that appears), and manually configure bridges. After you save any bridge settings, OnionShare will try to reconnect using those bridges.
ga: Mura bhfuil tú compordach le hiarratas a dhéanamh nach dtéann thar líonra Tor, is féidir leat "Socruithe Líonra" a chliceáil (nó ar an deilbhín Socruithe sa chúinne ag bun ar dheis, agus an cluaisín Socruithe Tor ina dhiaidh sin sa scáileán a fheictear), agus droichid a chumrú de láimh. Tar éis duit aon socruithe droichid a shábháil, déanfaidh OnionShare iarracht na droichid sin a úsáid arís.
sv: Om du inte känner dig bekväm med att göra en förfrågan som inte går över Tor-nätverket kan du klicka på "Nätverksinställningar" (eller inställningsikonen längst ner till höger, följt av fliken Tor-inställningar på skärmen som visas) och konfigurera broar manuellt. När du har sparat eventuella broinställningar kommer OnionShare att försöka återansluta med hjälp av dessa broar.

source: Manually configure Tor settings
ga: Cumraigh socruithe Tor de láimh
sv: Konfigurera Tor-inställningar manuellt

source: You can get to the Tor settings by clicking "Network Settings" on the welcome screen, or by clicking the "⚙" icon in the bottom-right corner of the application, and then switch to the Tor Settings tab in the screen that appears.
ga: Is féidir leat socruithe Tor a bhaint amach trí "Socruithe Líonra" a chliceáil ar an scáileán fáilte, nó cliceáil ar an deilbhín "⚙" sa chúinne ag bun ar dheis an fheidhmchláir, agus ansin athraigh go dtí an táb Socruithe Tor sa scáileán a fheictear.
sv: Du kan komma åt Tor-inställningarna genom att klicka på "Nätverksinställningar" på välkomstskärmen, eller genom att klicka på ikonen "⚙" i programmets nedre högra hörn och sedan växla till fliken Tor-inställningar på skärmen som visas.

source: Here are the different ways you can configure OnionShare to connect to Tor:
ga: Seo na bealaí éagsúla inar féidir leat OnionShare a chumrú chun ceangal le Tor:
sv: Här är de olika sätten du kan konfigurera OnionShare för att ansluta till Tor:

source: Use the Tor version built into OnionShare
ga: Úsáid an leagan Tor atá ionsuite in OnionShare
sv: Använd Tor-versionen som är inbyggd i OnionShare

source: This is the default, simplest and most reliable way that OnionShare connects to Tor. For this reason, it's recommended for most users.
ga: Is é seo an bealach réamhshocraithe, is simplí agus is iontaofa a nascann OnionShare le Tor. Ar an gcúis seo, tá sé molta don chuid is mó úsáideoirí.
sv: Detta är det standardiserade, enklaste och mest pålitliga sättet som OnionShare ansluter till Tor. Av denna anledning rekommenderas det för de flesta användare.

source: When you open OnionShare, it launches an already configured ``tor`` process in the background for OnionShare to use. It doesn't interfere with other ``tor`` processes on your computer, so you can use the Tor Browser or the system ``tor`` on their own.
ga: Nuair a osclaíonn tú OnionShare, seolann sé próiseas `` tor`` atá cumraithe cheana féin sa chúlra chun OnionShare a úsáid. Ní chuireann sé isteach ar phróisis ``tor`` eile ar do ríomhaire, mar sin is féidir leat Brabhsálaí Tor nó an córas ``tor`` a úsáid ina n-aonar.
sv: När du öppnar OnionShare startar den en förkonfigurerad ``tor``-process i bakgrunden för OnionShare att använda. Det stör inte andra ``tor``-processer på din dator, så du kan använda Tor Browser eller systemet ``tor`` på egen hand.

source: **Using bridges**
ga: **Droichid a úsáid**
sv: **Använda broar**

source: To use a bridge, you must select "Use the Tor version built into OnionShare" and check the "Use a bridge" checkbox.
ga: Chun droichead a úsáid, ní mór duit "Úsáid an leagan Tor a tógadh isteach i OnionShare" a roghnú agus an ticbhosca "Úsáid droichead" a sheiceáil.
sv: För att använda en bro måste du välja "Använd Tor-versionen som är inbyggd i OnionShare" och markera kryssrutan "Använd en bro".

source: Try using a built-in bridge first. Using `obfs4` or `snowflake` bridges is recommended over using `meek-azure`.
ga: Bain triail as droichead ionsuite a úsáid ar dtús. Moltar droichid `obfs4` nó `cáithníní sneachta` a úsáid seachas `meek-azure` a úsáid.
sv: Försök först att använda en inbyggd bro. Det rekommenderas att använda `obfs4`- eller `snowflake`-broar istället för `meek-azure`.

source: If using a built-in bridge doesn't work, you can request a bridge from torproject.org. You will have to solve a CAPTCHA in order to request a bridge. (This makes it more difficult for governments or ISPs to block access to Tor bridges.)
ga: Mura n-oibríonn úsáid droichead ionsuite, is féidir leat droichead a iarraidh ó torproject.org. Beidh ort CAPTCHA a réiteach chun droichead a iarraidh. (Déanann sé seo níos deacra do rialtais nó ISPanna rochtain ar dhroichid Tor a bhac.)
sv: Om det inte fungerar att använda en inbyggd bro kan du begära en bro från torproject.org. Du måste lösa en CAPTCHA för att kunna begära en bro. (Detta gör det svårare för myndigheter eller internetleverantörer att blockera åtkomst till Tor-broar.)

source: You also have the option of using a bridge that you learned about from a trusted source.
ga: Tá an rogha agat freisin droichead a d’fhoghlaim tú faoi ó fhoinse iontaofa a úsáid.
sv: Du har också möjlighet att använda en bro som du lärt dig om från en betrodd källa.

source: Attempt auto-configuration with Tor Browser
ga: Déan iarracht uathchumrú le Brabhsálaí Tor
sv: Försök att konfigurera automatiskt med Tor Browser

source: If you have `downloaded the Tor Browser <https://www.torproject.org>`_ and don't want two ``tor`` processes running, you can use the ``tor`` process from the Tor Browser. Keep in mind you need to keep Tor Browser open in the background while you're using OnionShare for this to work.
ga: Má tá an `Brabhsálaí Tor íoslódáilte agat <https://www.torproject.org>`_ agus mura dteastaíonn uait go mbeidh dhá phróiseas ``tor`` ag rith, is féidir leat an próiseas ``tor`` ón mBrabhsálaí Tor a úsáid. Coinnigh i gcuimhne go gcaithfidh tú an Brabhsálaí Tor a choinneáil ar oscailt sa chúlra agus tú ag úsáid OnionShare chun go n-oibreoidh sé seo.
sv: Om du har `laddat ner Tor Browser <https://www.torproject.org>`_ och inte vill att två tor-processer ska köras kan du använda ``tor``-processen från Tor Browser. Tänk på att du måste hålla Tor Browser öppen i bakgrunden medan du använder OnionShare för att detta ska fungera.

source: Using a system ``tor`` in Windows
ga: Ag baint úsáide as córas `` tor`` i Windows
sv: Använda ett ``system-tor`` i Windows

source: This is fairly advanced. You'll need to know how edit plaintext files and do stuff as an administrator.
ga: Tá sé seo sách chun cinn. Beidh a fhios agat conas comhaid ghnáththéacs a chur in eagar agus rudaí a dhéanamh mar riarthóir.
sv: Det här är ganska avancerat. Du måste veta hur du redigerar klartextfiler och gör saker som administratör.

source: Download the Tor Windows Expert Bundle `from the Tor website <https://www.torproject.org/download/tor/>`_. Extract the compressed file and copy the extracted folder to ``C:\Program Files (x86)\`` Rename the extracted folder with ``Data`` and ``Tor`` in it to ``tor-win32``.
ga: Íoslódáil Beart Saineolaithe Tor Windows `ó shuíomh Gréasáin Tor <https://www.torproject.org/download/tor/>`_. Bain an comhad comhbhrúite agus cóipeáil an fillteán asbhainte go `` C: \ Program Files (x86) \`` Athainmnigh an fillteán a bhaintear le `` Sonraí`` agus `` Tor`` ann go `` tor-win32``.
sv: Hämta Tor Windows Expert Bundle från Tor-webbplatsen <https://www.torproject.org/download/tor/>`_. Extrahera den komprimerade filen och kopiera den extraherade mappen till ``C:\Program Files (x86)\``. Byt namn på den extraherade mappen med ``Data`` och ``Tor`` till ``tor-win32``.

source: Make up a control port password. (Using 7 words in a sequence like ``comprised stumble rummage work avenging construct volatile`` is a good idea for a password.) Now open a command prompt (``cmd``) as an administrator, and use ``tor.exe --hash-password`` to generate a hash of your password. For example::
ga: Déan suas pasfhocal port rialaithe. (Úsáid 7 bhfocal i seicheamh cosúil le `` obair rummage stumble comhdhéanta avenging construct so-ghalaithe`` is smaoineamh maith é do phasfhocal.) Anois oscail ordú leid (``cmd``) mar riarthóir, agus úsáid ``tor. exe --hash-password`` chun hash de do phasfhocal a ghiniúint. Mar shampla::
sv: Skapa ett lösenord för kontrollporten. (Att använda 7 ord i en sekvens som ``comprised stumble rummage work avenging construct volatile`` är en bra idé för ett lösenord.) Öppna nu en kommandotolk (cmd) som administratör och använd ``tor.exe --hash-password`` för att generera en hash av ditt lösenord. Till exempel::

source: The hashed password output is displayed after some warnings (which you can ignore). In the case of the above example, it is ``16:00322E903D96DE986058BB9ABDA91E010D7A863768635AC38E213FDBEF``.
ga: Taispeántar an t-aschur pasfhocal hashed tar éis roinnt rabhaidh (ar féidir leat neamhaird a dhéanamh). I gcás an sampla thuas, is é ``16:00322E903D96DE986058BB9ABDA91E010D7A863768635AC38E213FDBEF``.
sv: Hash-lösenordsutmatningen visas efter vissa varningar (som du kan ignorera). När det gäller exemplet ovan är det ``'16:00322E903D96DE986058BB9ABDA91E010D7A863768635AC38E213FDBEF``.

source: Now create a new text file at ``C:\Program Files (x86)\tor-win32\torrc`` and put your hashed password output in it, replacing the ``HashedControlPassword`` with the one you just generated::
ga: Anois cruthaigh téacschomhad nua ag `` C: \ Program Files (x86) \ tor-win32 \ torrc`` agus cuir aschur do phasfhocal hashed ann, agus cuir an ceann a ghin tú díreach in ionad an ``HashedControlPassword``::
sv: Skapa nu en ny textfil på ``C:\Program Files (x86)\tor-win32\torrc`` och lägg din hashade lösenordsutmatning i den och ersätt ``HashedControlPassword`` med den du just genererade::

source: In your administrator command prompt, install ``tor`` as a service using the appropriate ``torrc`` file you just created (as described in `<https://2019.www.torproject.org/docs/faq.html.en#NTService>`_). Like this::
ga: I do leid riarthóra, suiteáil ``tor`` mar sheirbhís ag baint úsáide as an gcomhad `` torrc`` cuí a chruthaigh tú (mar a thuairiscítear in `<https://2019.www.torproject.org/docs/faq.html.en#NTService>`_). Mar seo::
sv: I kommandotolken för administratör installerar du ``tor`` som en tjänst med lämplig ``torrc``-fil som du just skapade (enligt beskrivningen i `<https://2019.www.torproject.org/docs/faq.html.en#NTService>`_). Som det här::

source: You are now running a system ``tor`` process in Windows!
ga: Tá próiseas ``tor`` córais á rith agat anois i Windows!
sv: Du kör nu en system-``tor``-process i Windows!
