Repository: onionshare/onionshare
Catalog: docs/source/locale/*/LC_MESSAGES/tor.po
Languages: ga, sv

source: Open OnionShare, click the "⚙" icon in it, and switch to the Tor Settings tab. Under "How should OnionShare connect to Tor?" choose "Connect using control port", and set "Control port" to ``127.0.0.1`` and "Port" to ``9051``. Under "Tor authentication settings" choose "Password" and set the password to the control port password you picked above. Click the "Test Connection to Tor" button. If all goes well, you should see "Connected to the Tor controller".
ga: Oscail OnionShare, cliceáil ar an deilbhín "⚙" ann, agus athraigh go dtí an táb Socruithe Tor. Faoi "Conas ba chóir OnionShare nascadh le Tor?" roghnaigh "Ceangail ag baint úsáide as port rialaithe", agus socraigh "Port rialaithe" go `` 127.0.0.1`` agus "Port" go `` 9051``. Faoi "Socruithe fíordheimhnithe Tor" roghnaigh "Pasfhocal" agus socraigh an focal faire chuig an pasfhocal port rialaithe a roghnaigh tú thuas. Cliceáil ar an gcnaipe "Tástáil Ceangal le Tor". Má théann gach rud go maith, ba cheart duit "Ceangailte le rialtóir Tor" a fheiceáil.
sv: Öppna OnionShare, klicka på ikonen "⚙" i den och växla till fliken Tor-inställningar. Under "Hur ska OnionShare ansluta till Tor?" väljer du "Anslut med kontrollport" och ställ in "Kontrollport" till "127.0.0.1" och "Port" till "9051". Under "Tor-autentiseringsinställningar" väljer du "Lösenord" och ställ in lösenordet till kontrollportens lösenord du valde ovan. Klicka på knappen "Testa anslutning till Tor". Om allt går bra bör du se "Ansluten till Tor-kontrollanten".

source: Using a system ``tor`` in macOS
ga: Ag baint úsáide as córas `` tor`` i macOS
sv: Använda en system-``tor`` i macOS

source: First, install `Homebrew <https://brew.sh/>`_ if you don't already have it, and then install Tor::
ga: Ar dtús, suiteáil `Homebrew <https://brew.sh/>`_ mura bhfuil sé agat cheana féin, agus ansin suiteáil Tor::
sv: Installera först `Homebrew <https://brew.sh/>`_ om du inte redan har det och installera sedan Tor::

source: Now configure Tor to allow connections from OnionShare::
ga: Anois cumraigh Tor chun naisc ó OnionShare a cheadú::
sv: Konfigurera nu Tor till att ansluta från OnionShare::

source: And start the system Tor service::
ga: Agus cuir tús le seirbhís Tor an chórais ::
sv: Och starta systemets Tor-tjänst::

source: Open OnionShare, click the "⚙" icon in it, and switch to the Tor Settings tab. Under "How should OnionShare connect to Tor?" choose "Connect using socket file", and set the socket file to be ``/usr/local/var/run/tor/control.socket``. Under "Tor authentication settings" choose "No authentication, or cookie authentication". Click the "Test Connection to Tor" button.
ga: Oscail OnionShare, cliceáil ar an deilbhín "⚙" ann, agus athraigh go dtí an táb Socruithe Tor. Faoi "Conas ba chóir OnionShare nascadh le Tor?" roghnaigh "Ceangail ag baint úsáide as comhad soicéad", agus socraigh an comhad soicéad mar ``/usr/local/var/run/tor/control.socket``. Faoi "Socruithe fíordheimhnithe Tor" roghnaigh "Gan fíordheimhniú, nó fíordheimhniú fianán". Cliceáil ar an gcnaipe "Tástáil Ceangal le Tor".
sv: Öppna OnionShare, klicka på ikonen "⚙" i den och växla till fliken Tor-inställningar. Under "Hur ska OnionShare ansluta till Tor?" väljer du "Anslut med socketfil" och ställ in socketfilen till ``/usr/local/var/run/tor/control.socket``. Under "Tor-autentiseringsinställningar" väljer du "Ingen autentisering eller cookie-autentisering". Klicka på knappen "Testa anslutning till Tor".

source: If all goes well, you should see "Connected to the Tor controller".
ga: Má théann gach rud go maith, ba cheart duit "Ceangailte le rialtóir Tor" a fheiceáil.
sv: Om allt går bra bör du se "Ansluten till Tor-styrenheten".

source: Using a system ``tor`` in Linux
ga: Ag baint úsáide as córas `` tor`` i Linux
sv: Använda ett system-``tor`` i Linux

source: First, install the ``tor`` package. If you're using Debian, Ubuntu, or a similar Linux distro, It is recommended to use the Tor Project's `official repository <https://support.torproject.org/apt/tor-deb-repo/>`_.
ga: Gcéad dul síos, suiteáil an pacáiste `` tor``. Má tá Debian, Ubuntu, nó distro Linux comhchosúil á úsáid agat, moltar úsáid a bhaint as `stór oifigiúil Tionscadal Tor <https://support.torproject.org/apt/tor-deb-repo/>`_.
sv: Installera först ``tor``-paketet. Om du använder Debian, Ubuntu eller en liknande Linuxdistribution rekommenderas att du använder Tor-projektets `officiella arkiv <https://support.torproject.org/apt/tor-deb-repo/>`_.

source: Next, add your user to the group that runs the ``tor`` process (in the case of Debian and Ubuntu, ``debian-tor``) and configure OnionShare to connect to your system ``tor``'s control socket file.
ga: Ansin, cuir d'úsáideoir leis an ngrúpa a ritheann an próiseas `` tor`` (i gcás Debian agus Ubuntu, `` debian-tor``) agus cumraigh OnionShare chun ceangal le do chóras `` tor`` rialú comhad soicéad.
sv: Lägg sedan till din användare i gruppen som kör tor-processen (när det gäller Debian och Ubuntu, ``debian-tor``) och konfigurera OnionShare för att ansluta till systemets tor-kontrollsocketfil.

source: Add your user to the ``debian-tor`` group by running this command (replace ``username`` with your actual username)::
ga: Cuir d'úsáideoir leis an ngrúpa ``debian-tor`` tríd an ordú seo a rith (cuir d'ainm úsáideora iarbhír in ionad ``ainm úsáideora``)::
sv: Lägg till din användare i gruppen ``debian-tor`` genom att köra detta kommando (ersätt ``användarnamn`` med ditt faktiska användarnamn):

source: Reboot your computer. After it boots up again, open OnionShare, click the "⚙" icon in it, and switch to the Tor Settings tab. Under "How should OnionShare connect to Tor?" choose "Connect using socket file". Set the socket file to be ``/var/run/tor/control``. Under "Tor authentication settings" choose "No authentication, or cookie authentication". Click the "Test Connection to Tor" button.
ga: Atosaigh do ríomhaire. Tar éis dó a bheith tosaithe arís, oscail OnionShare, cliceáil ar an deilbhín "⚙" ann, agus aistrigh go dtí an táb Socruithe Tor. Faoi "Conas ba chóir OnionShare nascadh le Tor?" roghnaigh "Ceangail ag baint úsáide as comhad soicéad". Socraigh an comhad soicéad mar ``/var/run/tor/control``. Faoi "Socruithe fíordheimhnithe Tor" roghnaigh "Gan fíordheimhniú, nó fíordheimhniú fianán". Cliceáil ar an gcnaipe "Tástáil Ceangal le Tor".
sv: Starta om datorn. När den har startat om, öppna OnionShare, klicka på ikonen "⚙" i den och växla till fliken Tor-inställningar. Under "Hur ska OnionShare ansluta till Tor?" väljer du "Anslut med socketfil". Ställ in socketfilen till ``/var/run/tor/control``. Under "Tor-autentiseringsinställningar" väljer du "Ingen autentisering eller kak-autentisering". Klicka på knappen "Testa anslutning till Tor".
